Autodesk.Aec.DatabaseServices.StreamCollectBodies
Represents a stream that collects the bodies that are produced during a sequence of draw routines.

Autodesk.Aec.DatabaseServices.StreamCollectBodies.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the StreamCollectBodies class using the specified database.
db: The specified database.

Autodesk.Aec.DatabaseServices.StreamCollectBodies.GetBody
Gets the current body. The oringal body data in the stream is transfered to the returned body.  This function is much faster than GetBodyCopy.
Returns: The current body.

Autodesk.Aec.DatabaseServices.StreamCollectBodies.GetBodyCopy
Gets a copy of the current body.
Returns: The copy of the current body.

Autodesk.Aec.DatabaseServices.StreamCollectBodies.InitializeBody
Initializes the current body.