Autodesk.Aec.DatabaseServices.StandardDisplaySetType
StandardDisplaySetType enumeration.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.NotStandard
Not standard set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.Standard
Standard set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.Model
Model set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.Plan
Plan set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.Reflected
Reflected set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.Section
Section set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.PlanLowDetail
Plan low detail set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.PlanHighDetail
Plan high detail set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.ModelLowDetail
Model low detail set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.ModelHighDetail
Model high detail set.

Autodesk.Aec.DatabaseServices.StandardDisplaySetType.NumberOfStandardSets
Number of standard display sets.