Autodesk.Aec.DatabaseServices.DatabaseData
Represents a data base data.

Autodesk.Aec.DatabaseServices.DatabaseData.#ctor
Initializes a new instance of the DatabaseData class.

Autodesk.Aec.DatabaseServices.DatabaseData.Database
Gets the database.

Autodesk.Aec.DatabaseServices.DatabaseData.DrawingInitializedAndPromoted
Gets or sets if drawing is initialized and promoted.