Autodesk.Aec.DatabaseServices.LayoutCurveNode
Represents a layout curve node.

Autodesk.Aec.DatabaseServices.LayoutCurveNode.#ctor
Initializes a new instance of the LayoutCurveNode class.

Autodesk.Aec.DatabaseServices.LayoutCurveNode.UPosition
Gets or sets the node position on the U axis.
Returns: Returns node position.