Autodesk.Aec.DatabaseServices.NestedGridDivisionDivideBy
Represents a nested grid division divide by.

Autodesk.Aec.DatabaseServices.NestedGridDivisionDivideBy.#ctor
Initializes a new instance of the NestedGridDivisionDivideBy class.

Autodesk.Aec.DatabaseServices.NestedGridDivisionDivideBy.DivideByCount
Gets or sets the divide by count value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.