Autodesk.Aec.DatabaseServices.EditingConstraint
Editing constraint enumeration.

Autodesk.Aec.DatabaseServices.EditingConstraint.None
None.

Autodesk.Aec.DatabaseServices.EditingConstraint.WidthFixed
Width fixed.

Autodesk.Aec.DatabaseServices.EditingConstraint.DepthFixed
Depth fixed.

Autodesk.Aec.DatabaseServices.EditingConstraint.WidthDepthFixed
Width depth fixed.

Autodesk.Aec.DatabaseServices.EditingConstraint.RectangularShape
Rectangular shape.