Autodesk.Aec.Modeler.HiddenLineDrawingImprove
HiddenLineDrawingImprove enumeration.

Autodesk.Aec.Modeler.HiddenLineDrawingImprove.NoDrawingImprove
NoDrawingImprove.

Autodesk.Aec.Modeler.HiddenLineDrawingImprove.ConnectDrawingImprove
ConnectDrawingImprove.

Autodesk.Aec.Modeler.HiddenLineDrawingImprove.ArcReconstructDrawingImprove
ArcReconstructDrawingImprove.