Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode
Represents an entity to a layout node anchor.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.#ctor
Initializes a new instance of the AnchorEntityToLayoutNode class.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.LayoutToolId
Gets or sets the Id of the layout tool.
Returns: Returns the Id of the layout tool.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.LayoutNodeId
Gets or sets the Id of the layout node.
Returns: Returns the Id of the layout node.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.LayoutNodeIndex
Gets or sets the index of the layout node.
Returns: Returns the index of the layout node.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.XRotation
Gets or sets the rotation in X.
Returns: Returns the rotation in X.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.YRotation
Gets or sets the rotation in Y.
Returns: Returns the rotation in Y.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.ZRotation
Gets or sets the rotation in Z.
Returns: Returns the rotation in X.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.OffsetVector
Gets or sets the offset vector.
Returns: Returns the offset vector.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.NormalVector
Gets or sets the normal vector.
Returns: Returns the normal vector.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.FlipX
Gets or sets the flip in X value.
Returns: Returns the flip in X value.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.FlipY
Gets or sets the flip in Y value.
Returns: Returns the flip in Y value.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.FlipZ
Gets or sets the flip in Z value.
Returns: Returns the flip in Z value.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.UseLocalCoordinateSystem
Gets or sets the value that determines if the local coordinate system is used.
Returns: Returns the value that determines if the local coordinate system is used.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutNode.OffsetToCenter
Gets or sets the offset to center value.
Returns: Returns the offset to center value.