Autodesk.Aec.DatabaseServices.UserDefined
UserDefined.

Autodesk.Aec.DatabaseServices.PreDefined
PreDefined.

Autodesk.Aec.DatabaseServices.CustomDefined
CustomDefined.

Autodesk.Aec.DatabaseServices.SolidFill
SolidFill.

Autodesk.Aec.DatabaseServices.CurrentLU
CurrentLU.

Autodesk.Aec.DatabaseServices.Scientific
Scientific.

Autodesk.Aec.DatabaseServices.Decimal
Decimal.

Autodesk.Aec.DatabaseServices.Engineering
Engineering.

Autodesk.Aec.DatabaseServices.Architectural
Architectural.

Autodesk.Aec.DatabaseServices.Fractional
Fractional.

Autodesk.Aec.DatabaseServices.CurrentAU
CurrentAU.

Autodesk.Aec.DatabaseServices.Degrees
Degrees.

Autodesk.Aec.DatabaseServices.DegMinSec
DegMinSec.

Autodesk.Aec.DatabaseServices.Grads
Grads.

Autodesk.Aec.DatabaseServices.Radians
Radians.

Autodesk.Aec.DatabaseServices.Surveyor
Surveyor.

Autodesk.Aec.DatabaseServices.CellRotationHorizontal
CellRotationHorizontal.

Autodesk.Aec.DatabaseServices.CellRotationVertical
CellRotationVertical.

Autodesk.Aec.DatabaseServices.ThemeSymbolSquare
ThemeSymbolSquare.

Autodesk.Aec.DatabaseServices.ThemeSymbolCircle
ThemeSymbolCircle.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorIsNone
RuleComparisonOperatorIsNone.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorEqualTo
RuleComparisonOperatorEqualTo.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorNotEqualTo
RuleComparisonOperatorNotEqualTo.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorLessThan
RuleComparisonOperatorLessThan.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorLessThanEqualTo
RuleComparisonOperatorLessThanEqualTo.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorGreaterThan
RuleComparisonOperatorGreaterThan.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorGreaterThanEqualTo
RuleComparisonOperatorGreaterThanEqualTo.

Autodesk.Aec.DatabaseServices.RuleComparisonOperatorInRange
RuleComparisonOperatorInRange.