Autodesk.Aec.DatabaseServices.MultiViewBlockReference
Represents a multi view block reference.
Remarks: Defines a reference to a multi view block (i.e. refers to an instance of a MultiViewBlockDefinition). Provides methods for obtaining the number of views available on the multiview block, and also for accessing each available view.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.#ctor
Initializes a new instance of the MultiViewBlockReference class.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.ViewInstances
Gets the collection of view instances.
Returns: Returns the collection of view instances.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.UpdateViewInstances
Updates the multiview blocks.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Updates any matching or non-existant overrides, and removes any "stale" overrides.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.HasAttributes
Returns true if the Multiview block has attributes, false otherwise.
Returns: Returns true if the Multiview block has attributes, false otherwise.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.UpdateViewInstancesAttributes(System.Boolean)
Updates all of the attributes for the given view blocks. Ignores attribute width.
includeTextStyle: true to include text style on updates; false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: This will create/remove attributes as well as making sure that the properties of the attributes match. This is only meant to be used with MultiViewBlock/Update or when you know you want things to be totally synched up.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.UpdateViewInstancesAttributesIncludeWidth(System.Boolean)
Updates all of the attributes for the given view blocks. Includes attribute width.
includeTextStyle: true to include text style on updates; false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: This will create/remove attributes as well as making sure that the properties of the attributes match. This is only meant to be used with MultiViewBlock/Update or when you know you want things to be totally synched up.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.NumberOfAnnotationScaleContexts
Return the number of annotation scale contexts.
Returns: Return the number of annotation scale contexts.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.updateAnnotative
Add or remove Annotation Scale Context Data.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.AnnotationScale
Return the AnnotationScale.
Returns: Return the AnnotationScale.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.AnnotationScaleUniqueIdentifier
Return the Annotation Scale Id.
Returns: Return the Annotation Scale Id.

Autodesk.Aec.DatabaseServices.MultiViewBlockReference.ScaleDependentOffset
Sets the Scale Dependent Offset.
vector: The scale dependent offset.
Returns: void.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.