Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType
Flags indicate the category of display properties to be skipped for pushing and popping.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.None
None.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.Color
Color.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.Layer
Layer.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.LineType
Line type.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.LineWeight
Line weight.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.LineTypeScale
Line type scale.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.PlotStyle
Plot type.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.VisualStyle
Visual style.

Autodesk.Aec.DatabaseServices.SkipPushPopDisplayPropertiesType.AutoCADRenderMaterial
AutoCAD render material.