Autodesk.Aec.DatabaseServices.DictionaryMultiViewBlockDefinition
Represents a multi view block definition dictionary.

Autodesk.Aec.DatabaseServices.DictionaryMultiViewBlockDefinition.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMultiViewBlockDefinition class using the specified database.
db: The drawing database.

Autodesk.Aec.DatabaseServices.DictionaryMultiViewBlockDefinition.GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the id of the standard multiview block definition, which is always available, for the specified drawing database.
db: The drawing database.
Returns: Returns the object id of the standard multiview block definition.