Autodesk.Aec.DatabaseServices.ObjectIdCollection
Represents a collection of object ids.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.#ctor
Initializes a new instance of the ObjectIdCollection.
db: The drawing database.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.CopyTo(Autodesk.Aec.DatabaseServices.ObjectId[],System.Int32)
Copies the collection to the array.
array: The ObjectId array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.Item(System.Int32)
Gets or sets the ObjectId at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.Count
Returns the number of ObjectIds available on this collection.
Returns: Returns the number of ObjectIds available on this collection.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.Add(Autodesk.Aec.DatabaseServices.ObjectId)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.IndexOf(Autodesk.Aec.DatabaseServices.ObjectId)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.ObjectId)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.Remove(Autodesk.Aec.DatabaseServices.ObjectId)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.Contains(Autodesk.Aec.DatabaseServices.ObjectId)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.ObjectIdCollection.Clear
Removes all items from the collection.