Autodesk.Aec.DatabaseServices.ConnectionComponent
Represents a connection component.

Autodesk.Aec.DatabaseServices.ConnectionComponent.MaxSimultaneousConnections
Gets the maximum number of simultaneous connections.
Returns: The maximum number of simultaneous connections. If there is no limit, returns 0.

Autodesk.Aec.DatabaseServices.ConnectionComponent.BoundBox
Gets the bounding box for this connection component.
Returns: The bounding box for this connection component.

Autodesk.Aec.DatabaseServices.ConnectionComponent.ConnectsWith(Autodesk.Aec.DatabaseServices.ConnectionComponent)
Determines whether this ConnectionComponent connects with the input ConnectionComponent.
component: Input the connection component.
Returns: true if this ConnectionComponent connects with the input ConnectionComponent, or false otherwise.