Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutVolume
Represents an entity to a layout volume anchor.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutVolume.#ctor
Initializes a new instance of the AnchorEntityToLayoutVolume class.