Autodesk.Aec.DatabaseServices.Slice
Represents a slice.

Autodesk.Aec.DatabaseServices.Slice.#ctor
Initializes a new instance of the Slice class.

Autodesk.Aec.DatabaseServices.Slice.PlaneWidth
Gets or sets the width of the slice plane.
Returns: The width of the slice plane.

Autodesk.Aec.DatabaseServices.Slice.PlaneDepth
Gets or sets the depth of the slice plane.
Returns: The depth of the slice plane.

Autodesk.Aec.DatabaseServices.Slice.AppendObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Append/Attach an object to the slice.
objectId: The ObjectId of the attached object.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Slice.RemoveObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Remove/Detach an object from the slice.
objectId: The ObjectId of the detached object.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Slice.GetEntities
Get all attached entities/objects of the slice.
Returns: All attached entities/objects of the slice.

Autodesk.Aec.DatabaseServices.Slice.Profile
Get the profile generated by the slice and its attached objects.
Returns: The profile generated by the slice and its attached objects.