Autodesk.Aec.Geometry.SegmentPosition
The segment position types for the curve.

Autodesk.Aec.Geometry.SegmentPosition.None
No position defined.

Autodesk.Aec.Geometry.SegmentPosition.Discard
Segment position marked as discard.

Autodesk.Aec.Geometry.SegmentPosition.Front
Segment position marked as front.

Autodesk.Aec.Geometry.SegmentPosition.Back
Segment position marked as back.

Autodesk.Aec.Geometry.SegmentPosition.Left
Segment position marked as left.

Autodesk.Aec.Geometry.SegmentPosition.Right
Segment position marked as right.

Autodesk.Aec.Geometry.SegmentPosition.Top
Segment position marked as top.

Autodesk.Aec.Geometry.SegmentPosition.Bottom
Segment position marked as bottom.