Autodesk.Aec.DatabaseServices.ProjectState
ProjectState enumeration.

Autodesk.Aec.DatabaseServices.ProjectState.New
New construction.

Autodesk.Aec.DatabaseServices.ProjectState.Existing
Renovation or expansion.

Autodesk.Aec.DatabaseServices.ProjectState.Demolition
Destruction.