Autodesk.Aec.DatabaseServices.StreamExtent
Represents a stream that calculates an extents box based on all of the geometry pushed in.  The resulting extents are in world coordinates and are orthogonal to the world origin.  By default the results include graphics that are on non-visible layers.

Autodesk.Aec.DatabaseServices.StreamExtent.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the StreamExtent class using the specified database.
db: The specified database.

Autodesk.Aec.DatabaseServices.StreamExtent.Extents
Gets the extents.
Returns: The extents.

Autodesk.Aec.DatabaseServices.StreamExtent.PushTextStrokingStatus(System.Boolean)
Pushes a text stroking status into the status stack.
isTextStrokingOn: Indicates if text stroking is on.

Autodesk.Aec.DatabaseServices.StreamExtent.PopTextStrokingStatus
Pops the text stroking status stack.

Autodesk.Aec.DatabaseServices.StreamExtent.TextStrokingStatus
Gets the current text stroking status. The top value of the status stack.
Returns: The current text stroking status.

Autodesk.Aec.DatabaseServices.StreamExtent.SetIncludeLiveSectionInExtent(System.Boolean)
Sets if live sections should be included in the extent.
value: Indicates if live sections should be included in the extent.

Autodesk.Aec.DatabaseServices.StreamExtent.AllowMText
Gets or sets if MText is allowed.