Autodesk.Aec.DatabaseServices.SectionVertexCollection
Represents a collection of section vertex.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.Count
Returns the number of SectionVertexs available on this collection.
Returns: Returns the number of SectionVertexs available on this collection.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.CopyTo(Autodesk.Aec.DatabaseServices.SectionVertex[],System.Int32)
Copies the collection to the array.
array: The SectionVertex array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.Item(System.Int32)
Gets or sets the SectionVertex at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.Add(Autodesk.Aec.DatabaseServices.SectionVertex)
Adds a SectionVertex to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.Contains(Autodesk.Aec.DatabaseServices.SectionVertex)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.IndexOf(Autodesk.Aec.DatabaseServices.SectionVertex)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.SectionVertex)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.Remove(Autodesk.Aec.DatabaseServices.SectionVertex)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionVertexCollection.Clear
Removes all items from the collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.