Autodesk.Aec.Modeler.SurfaceType
SurfaceType enumeration.

Autodesk.Aec.Modeler.SurfaceType.Unspecified
Unspecified.

Autodesk.Aec.Modeler.SurfaceType.Cylinder
Cylinder.

Autodesk.Aec.Modeler.SurfaceType.Cone
Cone.

Autodesk.Aec.Modeler.SurfaceType.Sphere
Sphere.

Autodesk.Aec.Modeler.SurfaceType.Torus
Torus.