Autodesk.Aec.DatabaseServices.LayoutGrid3dVolume
Represents a layout grid 3d volume.

Autodesk.Aec.DatabaseServices.LayoutGrid3dVolume.#ctor
Initializes a new instance of the LayoutGrid3dVolume class.

Autodesk.Aec.DatabaseServices.LayoutGrid3dVolume.UIndex
Gets or sets the index on the U axis.
Returns: Returns the index on the U axis.

Autodesk.Aec.DatabaseServices.LayoutGrid3dVolume.VIndex
Gets or sets the index on the V axis.
Returns: Returns the index on the V axis.

Autodesk.Aec.DatabaseServices.LayoutGrid3dVolume.WIndex
Gets or sets the index on the W axis.
Returns: Returns the index on the W axis.