Autodesk.Aec.DatabaseServices.PolygonStyleEdgeWidthJustify
PolygonStyleEdgeWidthJustify enumeration.

Autodesk.Aec.DatabaseServices.PolygonStyleEdgeWidthJustify.In
Justify relative to inside.

Autodesk.Aec.DatabaseServices.PolygonStyleEdgeWidthJustify.Center
Justify relative to center.

Autodesk.Aec.DatabaseServices.PolygonStyleEdgeWidthJustify.Out
Justify relative to outside.