Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType
Defines identifiers that indicate by material display component type.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.None
None.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.Linework
Linework.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.Elevation2dSection
2d Section Elevation.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.Body
Body.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.PlanHatch
Plan Hatch.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.SurfaceHatch
Surface Hatch.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.SectionHatch
Section Hatch.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.SectionBoundary
Section Boundary.

Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType.SectionedBody
Sectioned Body.