Autodesk.Aec.DatabaseServices.GridUvw
Represents a grid uvw, a tridimensional grid with nodes, cells, and volumes.

Autodesk.Aec.DatabaseServices.GridUvw.#ctor
Initializes a new instance of the GridUvw class.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutVolumeCentroid(System.Int32)
Gets the centroid of the volume layout.
volumeId: The volume id.
Returns: The centroid of the layout volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by the derived classes only.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutVolumeBody(System.Int32,Autodesk.AutoCAD.Geometry.Matrix3d@)
Gets the layout volume body and the coordinate system of the layout volume with the given id.
volumeId: The volume id.
toWcs: The coordinate system of the layout volume (if found.)
Returns: Returns the layout volume body.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by the derived classes only.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutVolumeExtent(System.Int32,System.Double@,System.Double@,System.Double@,Autodesk.AutoCAD.Geometry.Matrix3d@)
Gets the layout volume extents (length, width, height, and coordinate system).
volumeId: The volume layout id.
length: The volume layout length to be returned.
width: The volume layout width to be returned.
height: The volume layout height to be returned.
toWcs: The volume layout coordinate system to be returned.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by the derived classes only.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutGrid3dNodeAt(System.Int32)
Gets node at the index given.
index: The index.
Returns: Returns the LayoutGrid3dNode at the index given.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutGrid3dNode(System.Int32)
Gets node that has the given id.
id: The node id.
Returns: Returns the node that has the given id, or null if not found.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutGrid3dCellAt(System.Int32)
Gets the cell at the given index.
index: The index.
Returns: Returns the cell at the given index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutGrid3dCell(System.Int32)
Gets the cell that has the given id.
id: The cell id.
Returns: Returns the cell that has the given id, or null if not found.

Autodesk.Aec.DatabaseServices.GridUvw.VolumeCount
Gets the number of volumes.
Returns: Returns the number of volumes.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutGrid3dVolumeAt(System.Int32)
Gets the volume at the given index.
index: The index.
Returns: Returns the volume at the given index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridUvw.GetLayoutGrid3dVolume(System.Int32)
Gets the volume that has the given id.
id: The volume id.
Returns: Returns the volume that has the given id, or null if not found.

Autodesk.Aec.DatabaseServices.GridUvw.LayoutVolumeIds
Gets a collection of volume Ids.
Returns: Returns a collection of volume Ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvw.WAxisLength
Gets or sets the length of W Axis.
Returns: Returns the length of W Axis.

Autodesk.Aec.DatabaseServices.GridUvw.WSpacing
Gets or sets the spacing along W Axis.
Returns: Returns the spacing along W Axis.

Autodesk.Aec.DatabaseServices.GridUvw.WStartOffset
Gets or sets the offset from the W Axis to the start of the grid .
Returns: The offset distance.

Autodesk.Aec.DatabaseServices.GridUvw.WEndOffset
Gets or sets the offset from end of W Axis to end grid.
Returns: The offset distance.

Autodesk.Aec.DatabaseServices.GridUvw.WLayoutMode
Gets or sets the layout mode of the W axis.
Returns: The layout mode.

Autodesk.Aec.DatabaseServices.GridUvw.AppendGridLevel(System.Double)
Adds a node at every intersection of V param and U param at the W level.
parameterW: The node.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvw.MoveGridLevel(System.Double,System.Double)
Moves all nodes at old W position to new W position.
oldParameter: Old W position.
newParameter: New W position.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvw.RemoveGridLevel(System.Double)
Remove all nodes that exist with W parameter.
parameterW: The W parameter.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvw.AddNode(System.Double,System.Double,System.Double)
Adds a single node at U, V, W position.
parameterU: U position.
parameterV: V position.
parameterW: W position.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvw.WParameters
Get parameters of grid lines along W Axis.
Returns: Collection of W parameters.