Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase
Represents a display theme component base class.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase.#ctor
Initializes a new instance of the DisplayThemeComponentBase class.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase.SupportsEntity(Autodesk.Aec.DatabaseServices.Entity)
Check if it supports entity.
entity: Entity.
Returns: Ture if it supports, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase.DisplayProperties
Gets display properties.
Returns: Display component hatch.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase.Name
Gets or sets the name of this display component hatch.
Returns: The name of this display component hatch.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase.GetDisplayString()
Gets display String.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase.Rules
Gets or sets rules.
Returns: Rules.