Autodesk.Aec.DatabaseServices.RXClassToObjectId
Represents a class consisting of RXClass type and corresponding all object ids.

Autodesk.Aec.DatabaseServices.RXClassToObjectId.Type(Autodesk.AutoCAD.Runtime.RXClass)
Sets the RXClass type.

Autodesk.Aec.DatabaseServices.RXClassToObjectId.Ids(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Sets the collection of object ids.

Autodesk.Aec.DatabaseServices.RXClassToObjectId.op_Equality(Autodesk.Aec.DatabaseServices.RXClassToObjectId, Autodesk.Aec.DatabaseServices.RXClassToObjectId)
Compares equality of two objects of RXClassToObjectId type.

Autodesk.Aec.DatabaseServices.RXClassToObjectId.op_Inequality(Autodesk.Aec.DatabaseServices.RXClassToObjectId, Autodesk.Aec.DatabaseServices.RXClassToObjectId)
Compares inequality of two objects of RXClassToObjectId type.