Autodesk.Aec.DatabaseServices.SurfaceHatchFlags
Defines identifiers that indicate surface hatch flags.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.NoHatch
No hatch.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Top
Top.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Bottom
Bottom.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Right
Right.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Left
Left.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Front
Front.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Back
Back.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Section
Section.

Autodesk.Aec.DatabaseServices.SurfaceHatchFlags.Discard
Discard.