Autodesk.Aec.DatabaseServices.LayoutGrid2d
Represents a layout grid 2d. LayoutGrid2d builds onto CellLayoutTool by restricting node layouts to a regular 2d grid structure.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.#ctor
Initializes a new instance of the LayoutGrid2d class.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.BaseGrid
Gets the base grid.
Returns: The base grid, or null if the grid was not defined yet.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.CustomGrid
Gets the custom grid for this layout grid 2d.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.GridType
Gets or sets the grid type.
Returns: Returns the grid type.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.BoundaryId
Gets or sets the boundary id.
Returns: Returns the boundary id.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.BoundaryHoles
Gets a collection containing the ids of all the holes on the layout grid 2d.
Returns: Returns a collection containing the ids of all the holes on the layout grid 2d.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.AppendBoundaryHole(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Appends a boundary hole on the layout grid 2d.
id: The id of the boundary hole.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.RemoveBoundaryHole(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the boundary hole with given id from the layout grid 2d.
id: The id of the boundary hole to be removed.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.BoundaryProfile
Gets the boundary profile of the layout grid 2d.
Returns: Returns the boundary profile of the layout grid 2d, or null if none was defined yet.

Autodesk.Aec.DatabaseServices.LayoutGrid2d.OppositeLayoutNode(System.Int32,System.Double,System.Int32@,System.Double@)
Gets the node opposite to the node given.
nodeId: The id of the given node.
angleOffset: The angle offset of the given node.
oppositeNodeId: The id of the opposite node (if found.)
oppositeAngleOffset: The angle offset of the opposite node (if found.)
Returns: true if it found the node opposite to the node given; false otherwise.