Autodesk.Aec.DatabaseServices.DBObjectRelationshipCollection
Represents a collection of relationships.
Remarks: A simple unowned collection of relationships that are read-only, meaning that modification to it would not affect the object providing it.