Autodesk.Aec.DatabaseServices.NameTranslator
Represents a name translator.

Autodesk.Aec.DatabaseServices.NameTranslator.#ctor
Initializes a new instance of the NameTranslator class.

Autodesk.Aec.DatabaseServices.NameTranslator.Create(System.IntPtr,System.Boolean)
Creates a new instance of the NameTranslator class.
unmanagedPointer: Inputs the unmanaged pointer of NameTranslator object.
autoDelete: Inputs true if unmanaged object is destroyed by wrapper, otherwise false.

Autodesk.Aec.DatabaseServices.NameTranslator.Add(System::String^,System::String^)
Adds a translation entry from globalName to localName.
globalName: The global name to translate.
localName: The local name to be translated to.
Returns: true, if added; false, otherwise.

Autodesk.Aec.DatabaseServices.NameTranslator.Get(System::String^,System::String^)
Gets the translation for globalName.
globalName: The global name to translate.
Returns: The local name translated to.

Autodesk.Aec.DatabaseServices.NameTranslator.ManageTranslator(NameTranslator^)
Passes ownership of the memory for a translator elsewhere, to be deleted when the application is closed.
translator: The translator to be managed.
Returns: true if ownership was successfully transfered, false if the translator is already managed.

Autodesk.Aec.DatabaseServices.NameTranslator.IsTranslatorManaged(NameTranslator^)
Tells whether or not the memory of a translator is being managed.
translator: The translator being queried.
Returns: true if translator is being managed, false otherwise.