Autodesk.Aec.DatabaseServices.LayerKeyStyle
Represents a layer key style.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.#ctor
Initializes a new instance of the LayerKeyStyle class.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.OverrideCount
Gets the override count.
Returns: Returns the override count.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.OverrideExists(System.String)
Determines if the specified override key exists.
name: The override key name.
Returns: Returns true if the specified override key exists.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.GetOverrideAt(System.String,System.String)
Gets the override value for the specified key name.
name: The override key name.
value: The override value.
Returns: Returns the override value for the specified key name.
Remarks: The name will be equivalent to a descriptive field from the layer standard on which this key style is based.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.GetOverrideAt(System.Int32,System.String,System.String)
Gets the override key name and value at the specified index.
index: The index.
name: The key name.
value: The value.
Returns: Returns the override key name and value at the specified index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Remarks: The name will be equivalent to a descriptive field from the layer standard on which this key style is based.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.SetOverrideAt(System.String,System.String)
Sets the override value for the specified key name.
name: The key name.
value: The value.
Remarks: The name will be equivalent to a descriptive field from the layer standard on which this key style is based.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.SetOverrideAt(System.Int32,System.String)
Sets the override value at the specified index.
index: The index.
value: The value.
Remarks: The name will be equivalent to a descriptive field from the layer standard on which this key style is based.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.Standard
Gets or sets the name of the layer standard on which to base the key style.
Returns: Returns the name of the layer standard on which to base the key style.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.OverridesEnabled
Determines if overrides are enabled.
Returns: Returns true if overrides are enabled.
Remarks: Specifies whether override values are applied to newly generated key-based layers.

Autodesk.Aec.DatabaseServices.LayerKeyStyle.KeyDefinitions
Gets all key definitions in the layer key definition..