Autodesk.Aec.Modeler.PointInBodyLocation
PointInBodyLocation enumeration.

Autodesk.Aec.Modeler.PointInBodyLocation.PointOutsideBody
The point is outside the body.

Autodesk.Aec.Modeler.PointInBodyLocation.PointAtVertex
The point is at the vertex.

Autodesk.Aec.Modeler.PointInBodyLocation.PointOnEdge
The point is on then edge.

Autodesk.Aec.Modeler.PointInBodyLocation.PointInFace
The point is in the face.

Autodesk.Aec.Modeler.PointInBodyLocation.PointInsideBody
The point is inside the body.