Autodesk.Aec.DatabaseServices.IndexSpecifierLocation
Represents an index specifier location.

Autodesk.Aec.DatabaseServices.IndexSpecifierLocation.#ctor
Initializes a new instance of the IndexSpecifierLocation class.

Autodesk.Aec.DatabaseServices.IndexSpecifierLocation.AppliesToStartIndex
Gets or sets the applies to start index state.

Autodesk.Aec.DatabaseServices.IndexSpecifierLocation.AppliesToEndIndex
Gets or sets the applies to end index state.

Autodesk.Aec.DatabaseServices.IndexSpecifierLocation.AppliesToMiddleIndex
Gets or sets the applies to middle index state.