Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter
DisplayRepresentationSetParameter enumeration.

Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter.DisplayRepresentation
Display representation.

Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter.ClippedMaterials
Clipped materials.

Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter.SurfaceHatching
View dependent set.

Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter.SectionBodyDisplay
Surface hatching.

Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter.Classification
Classification.

Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter.SectionByDisplayRange
Section by display range.

Autodesk.Aec.DatabaseServices.DisplayRepresentationSetParameter.LiveSectionClipVolumes
Live section clip volumes.