Autodesk.Aec.Modeler.ConeSurface
Represents a cone surface.

Autodesk.Aec.Modeler.ConeSurface.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for ConeSurface.

Autodesk.Aec.Modeler.ConeSurface.#ctor
Initializes a new instance of the ConeSurface class.

Autodesk.Aec.Modeler.ConeSurface.#ctor(Autodesk.AutoCAD.Geometry.LineSegment3d,System.Double,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the ConeSurface class using the specified line, readius, approx and body.
axis: The axis.
radius1: The first radius.
radius2: The second radius.
approx: The approx.
body: The body.

Autodesk.Aec.Modeler.ConeSurface.Radius
Gets the radius.
Returns: The radius.

Autodesk.Aec.Modeler.ConeSurface.TanAngle
Gets the tan angle.
Returns: The tan angle.

Autodesk.Aec.Modeler.ConeSurface.Approximation
Gets the approx.
Returns: The approx.

Autodesk.Aec.Modeler.ConeSurface.Apex
Gets the apex point.
Returns: The apex point.