Autodesk.Aec.DatabaseServices.LineWorkRuleCollection
Represents a collection of section vertex.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.Count
Returns the number of LineWorkRules available on this collection.
Returns: Returns the number of LineWorkRules available on this collection.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.CopyTo(Autodesk.Aec.DatabaseServices.LineWorkRule[],System.Int32)
Copies the collection to the array.
array: The LineWorkRule array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.Item(System.Int32)
Gets or sets the LineWorkRule at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.Add(Autodesk.Aec.DatabaseServices.LineWorkRule)
Adds a LineWorkRule to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.Contains(Autodesk.Aec.DatabaseServices.LineWorkRule)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.IndexOf(Autodesk.Aec.DatabaseServices.LineWorkRule)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.LineWorkRule)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkRule)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.LineWorkRuleCollection.Clear
Removes all items from the collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.