Autodesk.Aec.DatabaseServices.NestedGridDivisionManual
Represents a nested grid division manual.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManual.#ctor
Initializes a new instance of the NestedGridDivisionManual class.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManual.ManualEdgeDefinitionCount
Gets the manual edge definition count.
Returns: The manual edge definition count.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManual.ManualEdgeDefinitionAt(System.Int32)
Gets the manual edge definition at the given index.
index: The given index.
Returns: The manual edge definition at the given index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManual.AddManualEdgeDefinition(Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition)
Adds the manual edge definition to this NestedGridDivisionManual.
edgeDefinition: The manual edge definition.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: This method transfers ownership of the object wrapped by the NestedGridDivisionManualEdgeDefinition to the NestedGridDivisionManual.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManual.RemoveManualEdgeDefinitionAt(System.Int32)
Removes the manual edge definition at the given index.
index: The given index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.