Autodesk.Aec.DatabaseServices.GridAssemblyComponentType
GridAssembly component type.

Autodesk.Aec.DatabaseServices.GridAssemblyComponentType.Frame
Frame grid assembly component.

Autodesk.Aec.DatabaseServices.GridAssemblyComponentType.Mullion
Mullion grid assembly component.

Autodesk.Aec.DatabaseServices.GridAssemblyComponentType.Infill
Infill grid assembly component.