Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase
Represents a display theme rule base class.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.DisplayString
Gets display string.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.PropertyOwnerTypeName
Gets property owner type name.
Returns: Property owner type name.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.PropertyOwnerName
Gets or sets property owner name.
Returns: Property owner name.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.PropertyName
Gets or sets property name.
Returns: Property name.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.GetCollectPropertyOwners()
Gets the collect properties owners.
Returns: The collect property owners .

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.GetCollectProperties()
Gets the collect properties.
Returns: The collect property .

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.GetCollectPropertiesDefaultIndex()
Gets the collect properties default index.
Returns: The collect properties default index,return -1 if can not find the default index.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.Units
Gets units.
Returns: Units.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.Precision
Gets Precision.
Returns: Precision.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.GetTrueFalseText(System.Boolean)
Get true false text.
isFormatted: True if formatted, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.GetCount
Gets the count of rule nodes.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.Add(Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase)
Adds the display theme rule to the rule nodes collection.
value: The display theme rule.
Returns: The index of the newly added node.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.Insert(Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase)
Inserts the display theme rule to the specified position of the rule nodes collection.
index: The position.
value: The display theme rule.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.GetAt(System.Int32)
Gets the display theme rule at the specified position.
index: The position.
Returns: The display theme rule.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.RemoveAt(System.Int32)
Removes the display theme rule at the specified position from the rule node collection.
index: The position.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.RemoveAll
Removes all display theme rules from the rule node collection.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.ComparisonOperator
Gets or sets comparision operator.
Returns: Operator.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.NextNodeOperator
Gets or sets next node operator.
Returns: Next node operator.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.DataType
Gets or sets data type.
Returns: Data type.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.Value()
Gets value.
data: Value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.ValueAsString
Gets value as string.
Returns: Value as string.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.FormattedValue
Gets formatted value.
Returns: Formatted value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.Value
Set value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase.SupportsEntity(Autodesk.Aec.DatabaseServices.Entity)
Check if supports entity.
entity: Entity.
Returns: Ture if it supports, false otherwise.