Autodesk.Aec.DatabaseServices.GraphicsStorageShell.Vertices
Gets the vertices of the shell.
Returns: The vertices of the shell.

Autodesk.Aec.DatabaseServices.GraphicsStorageShell.FaceList
Gets the face list of the shell.
Returns: The face list of the shell.
Remarks: Negative values in the array indicate holes.

Autodesk.Aec.DatabaseServices.GraphicsStorageShell.FaceData
Gets the face data of the shell.
Returns: The face data of the shell.

Autodesk.Aec.DatabaseServices.GraphicsStorageShell.EdgeData
Gets the edge data of the shell.
Returns: The edge data of the shell.

Autodesk.Aec.DatabaseServices.GraphicsStorageShell
Represents a graphics storage that stores shell data.