Autodesk.Aec.Modeler.VertexSurfaceDataCollection
Represents a collection of VertexSurfaceDatas.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.Item(System.Int32)
Gets or sets the VertexSurfaceData at the given index.
index: The index.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.Count
Returns the number of VertexSurfaceDatas available on this collection.
Returns: Returns the number of VertexSurfaceDatas available on this collection.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.Add(Autodesk.Aec.Modeler.VertexSurfaceData)
Adds the specified item to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.IndexOf(Autodesk.Aec.Modeler.VertexSurfaceData)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.Insert(System.Int32,Autodesk.Aec.Modeler.VertexSurfaceData)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.Remove(Autodesk.Aec.Modeler.VertexSurfaceData)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.Contains(Autodesk.Aec.Modeler.VertexSurfaceData)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.VertexSurfaceDataCollection.CopyTo(Autodesk.Aec.Modeler.VertexSurfaceData[],System.Int32)
Copies the collection to the array.
array: The VertexSurfaceData array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.