Autodesk.Aec.DatabaseServices.GridDefinitionLocationType
Location for GridDefinition.

Autodesk.Aec.DatabaseServices.GridDefinitionLocationType.InstanceBased
GridDefinition is located on the instance itself.

Autodesk.Aec.DatabaseServices.GridDefinitionLocationType.StyleBased
GridDefinition is located on the style.