Autodesk.Aec.DatabaseServices.PlaneType
Plane types for the Grid Cells.

Autodesk.Aec.DatabaseServices.PlaneType.UV
Cell is defined by U and V axis.

Autodesk.Aec.DatabaseServices.PlaneType.UW
Cell is defined by U and W axis.

Autodesk.Aec.DatabaseServices.PlaneType.VW
Cell is defined by V and W axis.