Autodesk.Aec.DatabaseServices.GraphicsStorageBody.Body
Gets the body.
Returns: The body.

Autodesk.Aec.DatabaseServices.GraphicsStorageBody.DiscardedEdgeFaceMask
Gets the mask of the discarded edge face.
Returns: The mask of the discarded edge face.

Autodesk.Aec.DatabaseServices.GraphicsStorageBody
Represents a graphics storage that stores body data.