Autodesk.Aec.Geometry.NestedGridCellMergeData
Represents nested grid cell merge data.

Autodesk.Aec.Geometry.NestedGridCellMergeData.#ctor
Initializes a new instance of the NestedGridCellMergeData class.

Autodesk.Aec.Geometry.NestedGridCellMergeData.PrimaryCellPath
Gets or sets the primary cell path.
Returns: The primary cell path.

Autodesk.Aec.Geometry.NestedGridCellMergeData.SecondaryCellPath
Gets or sets the secondary cell path.
Returns: The secondary cell path.

Autodesk.Aec.Geometry.NestedGridCellMergeData.IsStyleBased
Gets or sets whether the merge data is style based.
Returns: True to indicate style based, or false otherwise.