Autodesk.Aec.Geometry.RingCollection
Represents a ring collection.

Autodesk.Aec.Geometry.RingCollection.DeleteUnmanagedObject()
Disposes the unmanaged object.

Autodesk.Aec.Geometry.RingCollection.CopyTo
Copies the collection to an array.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Geometry.RingCollection.Item(System.Int32)
Gets or sets the Ring at the given index.
index: The index.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Method currently unavailable. Will throw an InvalidOperationException() if used.

Autodesk.Aec.Geometry.RingCollection.Count
Returns the number of elements in the collection.

Autodesk.Aec.Geometry.RingCollection.GetEnumerator
Gets the enumerator for the collection.

Autodesk.Aec.Geometry.RingCollection.CopyTo(Autodesk.Aec.Geometry.Ring[],System.Int32)
Copies the collection to an array.
array: The Ring array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.