Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection
Represents a collection of vectors for the leader to a node anchor.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.Item(System.Int32)
Gets or sets an item from the collection at the specified index.
index: The index of the item.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.RemoveAt(System.Int32)
Removes an item from the collection at the specified index.
index: The index of the item to remove.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.Count
Gets the number of items in the collection.
Returns: Returns the number of items in the collection.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.GetEnumerator
Gets the enumerator for this collection.
Returns: Returns the enumerator for this collection.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.Add(Autodesk.AutoCAD.Geometry.Vector2d)
Adds the specified item to the collection.
value: The item to add.
Returns: The number of items in the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.IndexOf(Autodesk.AutoCAD.Geometry.Vector2d)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.Insert(System.Int32,Autodesk.AutoCAD.Geometry.Vector2d)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.Remove(Autodesk.AutoCAD.Geometry.Vector2d)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.Contains(Autodesk.AutoCAD.Geometry.Vector2d)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNodeVectorCollection.CopyTo(Autodesk.AutoCAD.Geometry.Vector2d[],System.Int32)
Copies the collection to the Vector2d array.
array: The Vector2d array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.