Autodesk.Aec.DatabaseServices.GridAssemblyCell
Represents a grid assembly cell.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.#ctor
Initializes a new instance of the GridAssemblyCell class.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.NestingPath
Gets the nesting path.
Returns: A collection with the ids of the nesting path.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.CellAssignmentId
Gets or sets the cell assignment id.
Returns: The cell assignment id.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.GetInfillDefinition(Autodesk.Aec.DatabaseServices.GridAssemblyComponentSet,Autodesk.Aec.DatabaseServices.GridAssemblyDefinition)
Gets the infill definition.
componentSet: The component set.
gridDefinition: The grid definition.
Returns: The infill definition.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.IntersectsCutPlane(System.Double)
Returns true if the given elevation intersects the cut plane.
elevation: The elevation.
Returns: true if the given elevation intersects the cut plane, false otherwise.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.GrossStartX
Gets or sets the gross start X.
Returns: The gross start X.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.GrossStartY
Gets or sets the gross start Y.
Returns: The gross start Y.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.GrossEndX
Gets or sets the gross end X.
Returns: The gross end X.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.GrossEndY
Gets or sets the gross end Y.
Returns: The gross end Y.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.IsLeafCell
Gets or sets leaf cell state.
Returns: Returns true if cell is a leaf cell, false otherwise.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.IsOverridden
Gets or sets the overridden state.
Returns: true if it is overridden, false otherwise.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.AtEntityStart
Gets or sets entity at start state.
Returns: true if entity is located at start, false otherwise.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.AtEntityEnd
Gets or sets entity at end state.
Returns: true if entity is located at end, false otherwise.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.IsVoid
Gets or sets the memory state of the grid assembly cell.
Returns: true if its void, false if its allocated.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.WasTransfered
Gets or sets the transferred state.
Returns: true if the cell was transferred, false otherwise.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.InfillOverrideId
Gets or sets the infill override id.
Returns: The infill override id.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.HasNetProfile
Gets the has net profile state.
Returns: true if there is a net profile, false otherwise.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.NetCellProfile
Gets or sets the net profile.
Returns: The net profile, or null if none was set.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.NetStartX
Gets or sets the net start X value.
Returns: The net start X value.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: This property is only allowed if there is no net cell profile defined. Trying to use it when there is a net cell profile will throw an exception.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.NetStartY
Gets or sets the net start Y value.
Returns: The net start Y value.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: This property is only allowed if there is no net cell profile defined. Trying to use it when there is a net cell profile will throw an exception.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.NetEndX
Gets or sets the net end X value.
Returns: The net end X value.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: This property is only allowed if there is no net cell profile defined. Trying to use it when there is a net cell profile will throw an exception.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.NetEndY
Gets or sets the net end Y value.
Returns: The net end Y value.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: This property is only allowed if there is no net cell profile defined. Trying to use it when there is a net cell profile will throw an exception.

Autodesk.Aec.DatabaseServices.GridAssemblyCell.ContainedEntityId
Gets or sets the id of the contained entity.
Returns: The id of the contained entity.