Autodesk.Aec.Modeler.ValidityCheckingLevel
ValidityCheckingLevel enumeration.

Autodesk.Aec.Modeler.ValidityCheckingLevel.NoChecking
No checking.

Autodesk.Aec.Modeler.ValidityCheckingLevel.SimpleChecking
Simple topology and geometry checking.

Autodesk.Aec.Modeler.ValidityCheckingLevel.ExtensiveChecking
Extensive topology and geometry checking.