Autodesk.Aec.DatabaseServices.ShapeSubType
Shape sub types.

Autodesk.Aec.DatabaseServices.ShapeSubType.Unspecified
Profile is not set.

Autodesk.Aec.DatabaseServices.ShapeSubType.ProfileInternal
Maintains an embedded profile.

Autodesk.Aec.DatabaseServices.ShapeSubType.ProfileExternal
Refers to a profile definition.