Autodesk.Aec.DatabaseServices.RelationType
Defines identifiers that indicate relation types.

Autodesk.Aec.DatabaseServices.RelationType.NotApplicable
Does not apply.

Autodesk.Aec.DatabaseServices.RelationType.DisplayReferenceOf
Example: Door is DisplayReferenceOf DoorStyle.

Autodesk.Aec.DatabaseServices.RelationType.DisplayReferenceFor
Example: DoorStyle is DisplayReferenceFor Door.

Autodesk.Aec.DatabaseServices.RelationType.LocationReferenceOf
Location determinant.

Autodesk.Aec.DatabaseServices.RelationType.LocationReferenceFor
Location dependent.

Autodesk.Aec.DatabaseServices.RelationType.OwnerOf
Example: Wall is OwnerOf door.

Autodesk.Aec.DatabaseServices.RelationType.OwnedBy
Example: Door is OwnedBy Wall.

Autodesk.Aec.DatabaseServices.RelationType.TwoWayReference
Example: Wall to merged Wall.