Autodesk.Aec.DatabaseServices.PropertyBase
Represents Property Base.

Autodesk.Aec.DatabaseServices.PropertyBase.#ctor
Initializes a new instance of the PropertyBase class.

Autodesk.Aec.DatabaseServices.PropertyBase.DataType
Gets or sets the property data type.
Returns: The property data type.

Autodesk.Aec.DatabaseServices.PropertyBase.Name
Gets or sets the name.
Returns: The name.