Autodesk.Aec.DatabaseServices.StreamColorToPropertiesMap
This class is for future use with the StreamBodyColorModeType kUseAsMapIndex to allow associating an object with a color of a body edge or face.

Autodesk.Aec.DatabaseServices.StreamColorToPropertiesMap.#ctor
Initializes a new instance of the StreamColorToPropertiesMap class.

Autodesk.Aec.DatabaseServices.StreamColorToPropertiesMap.Lookup(System.Int32)
Gets the display component entity indexed by the specified key.
key: The key used to look up the entity.
Throws Autodesk.AutoCAD.Runtime.Exception: The exception is thrown if the entity indexed by the key is not found.

Autodesk.Aec.DatabaseServices.StreamColorToPropertiesMap.SetAt(System.Int32,Autodesk.Aec.DatabaseServices.DisplayComponentEntity,System.Boolean)
Sets the specified entity at the specified index key.
key: The specified index key.
value: The specified entity.
deleteExisting: Boolean value indicates whether the entity should be deleted if it exists.

Autodesk.Aec.DatabaseServices.StreamColorToPropertiesMap.DeleteAll
Deletes all items.