Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.#ctor
Initializes a new instance of the ObjectIdAndBlockReferencePathCollection class.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Add(Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePath)
Add item.
ObjectIdAndBlockReferencePath: The id and block reference path.
Returns: The added index.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Add(Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePath,System.Boolean)
Add item.
ObjectIdAndBlockReferencePath: The item.
bypassCheck: If bypass check.
Returns: The added index.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Append(Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection)
Append item.
containerToAppend: The item.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Append(Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection,System.Boolean)
Append item.
containerToAppend: The item to append.
bypassCheck: If bypass check.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Remove(Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePath)
Remove item.
blockRefPath: The item.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.RemoveAt(System.Int32)
Remove item at certain index.
index: The index.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Clear
Clear all items.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Contains(Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePath)
If contains certain item.
ObjectIdAndBlockReferencePath: The item.
Returns: True if it contains, false otherwise.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Item
Gets or sets the indexed item.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.IndexOf(Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePath)
Index of certain item.
Returns: The index.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.Count
Gets the count.
Returns: The count.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.ObjectIdAndBlockReferencePathCollection
Represents a ObjectId and BlockReferencePath Collection.