Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData
Represents a data class to store the infomation about the location of display properties.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.#ctor
Initializes a new instance of the DisplayComponentPushPopData class.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.#ctor(Autodesk.Aec.DatabaseServices.DisplayComponentEntity)
Initializes a new instance of the DisplayComponentPushPopData class using the specified display component entity.
entity: The specified display component entity.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.#ctor(Autodesk.Aec.DatabaseServices.DisplayComponentEntity,System.String)
Initializes a new instance of the DisplayComponentPushPopData class using the specified display component entity and the component name.
entity: The specified display component entity.
componentName: The specified component name.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.MaterialId
Gets or sets the object id of the material.
Returns: The object id of the material.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.HasMaterial
Gets the boolean value to indicate if the data object contains material informations.
Returns: The boolean value indicates if the data object contains material informations.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.DisplayComponentName
Gets or sets the display component name.
Returns: The display component name.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.HasName
Gets the boolean value to indicate if the data object has its name.
Returns: The boolean value indicates if the data object has its name.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.DisplayComponentEntity
Gets or sets the display component entity.
Returns: The display comonent entity.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.SetDisplayComponentData(Autodesk.Aec.DatabaseServices.DisplayComponentEntity,System.String)
Sets the display component data.
entity: The specified display component entity.
name: The specified name.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.SetMaterialDisplayComponentData(Autodesk.Aec.DatabaseServices.DisplayComponentEntity,System.String)
Sets the material display component data.
entity: The specified display component entity.
strName: The specified name.

Autodesk.Aec.DatabaseServices.DisplayComponentPushPopData.MaterialInformation
Gets or sets the material information of the data object.
Returns: The material information of the data object.