Autodesk.Aec.DatabaseServices.Section2dStyleParameter
Section2d style parameter type enumeration.

Autodesk.Aec.DatabaseServices.Section2dStyleParameter.Component
Component.

Autodesk.Aec.DatabaseServices.Section2dStyleParameter.LineWorkRule
Line work rule.

Autodesk.Aec.DatabaseServices.Section2dStyleParameter.KeepHiddenLineWork
Keep hidden line work.

Autodesk.Aec.DatabaseServices.Section2dStyleParameter.UseObjectDisplayProperties
Use object display properties.