Autodesk.Aec.DatabaseServices.DBObject
Represents an AEC database object.

Autodesk.Aec.DatabaseServices.DBObject.#ctor
Initializes a new instance of the DBObject class.

Autodesk.Aec.DatabaseServices.DBObject.Overrides
Gets Overrides.

Autodesk.Aec.DatabaseServices.DBObject.DisplayName
Gets the display name.
Returns: Returns the display name.

Autodesk.Aec.DatabaseServices.DBObject.TypeIcon
Gets the type icon.
Returns: Returns the type icon.

Autodesk.Aec.DatabaseServices.DBObject.Description
Gets or sets the description.
Returns: Returns the description.

Autodesk.Aec.DatabaseServices.DBObject.GetMaterialComponents(Autodesk.AutoCAD.Geometry.IntegerCollection@,System.Collections.Specialized.StringCollection@,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection@)
Returns the component ids, component names, and material ids.
componentIds: The component ids.
componentNames: The component names.
materialIds: The material ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: The order of the items in the array must be the same as in SetMaterialComponents.

Autodesk.Aec.DatabaseServices.DBObject.SetMaterialComponents(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Sets the component ids and material ids.
componentIds: The component ids.
materialIds: The material ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DBObject.SubSetDatabaseDefaults(Autodesk.AutoCAD.DatabaseServices.Database)
Sets any uninitialized data before the object is closed.
db: The database.

Autodesk.Aec.DatabaseServices.DBObject.SetToStandard(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes data to realistic values after object construction.
db: The database.

Autodesk.Aec.DatabaseServices.DBObject.SwappingReferences
Gets or sets the value indicating that references are being swapped.