Autodesk.Aec.DatabaseServices.ImpObjectCollection
Represents a collection of implementation objects.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.ImpObjectCollection()
Default constructor for ImpObjectCollection.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.CopyTo(Autodesk.Aec.DatabaseServices.ImpObject[],System.Int32)
Copies the collection to the array.
array: The ImpObject array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.Item(System.Int32)
Gets or sets the ImpObject at the given index.
index: The index.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.Count
Returns the number of ImpObjects available on this collection.
Returns: Returns the number of ImpObjects available on this collection.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.Add(Autodesk.Aec.DatabaseServices.ImpObject)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.IndexOf(Autodesk.Aec.DatabaseServices.ImpObject)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.ImpObject)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.Remove(Autodesk.Aec.DatabaseServices.ImpObject)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.Contains(Autodesk.Aec.DatabaseServices.ImpObject)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.ImpObjectCollection.Clear
Removes all items from the collection.