Autodesk.Aec.BuiltInType
BuiltInType enumeration.

Autodesk.Aec.BuiltInType.Unitless
No units.

Autodesk.Aec.BuiltInType.Weight
Weight.

Autodesk.Aec.BuiltInType.Length
Length.

Autodesk.Aec.BuiltInType.Time
Time.

Autodesk.Aec.BuiltInType.Temperature
Temperature.

Autodesk.Aec.BuiltInType.ElectricalCurrent
Electrical current.

Autodesk.Aec.BuiltInType.Substance
Substance.

Autodesk.Aec.BuiltInType.LuminousIntensity
Luminous intensity.

Autodesk.Aec.BuiltInType.Angle
Angle.

Autodesk.Aec.BuiltInType.SolidAngle
Solid angle.

Autodesk.Aec.BuiltInType.ElectricalFrequency
Electrical frequency.

Autodesk.Aec.BuiltInType.Force
Force.

Autodesk.Aec.BuiltInType.Energy
Energy.

Autodesk.Aec.BuiltInType.Pressure
Pressure.

Autodesk.Aec.BuiltInType.Power
Power.

Autodesk.Aec.BuiltInType.ElectricalPotential
Electrical potential.

Autodesk.Aec.BuiltInType.Illuminance
Illuminance.

Autodesk.Aec.BuiltInType.Area
Area.

Autodesk.Aec.BuiltInType.Volume
Volume.

Autodesk.Aec.BuiltInType.Density
Density.

Autodesk.Aec.BuiltInType.Friction
Friction.

Autodesk.Aec.BuiltInType.LinearForce
Linear force.

Autodesk.Aec.BuiltInType.LinearWeight
Linear weight.

Autodesk.Aec.BuiltInType.PowerDensity
Power density.

Autodesk.Aec.BuiltInType.Velocity
Velocity.

Autodesk.Aec.BuiltInType.Flow
Flow.

Autodesk.Aec.BuiltInType.Moments
Moments.

Autodesk.Aec.BuiltInType.MomentOfForce
Moment of force.

Autodesk.Aec.BuiltInType.Stress
Stress.

Autodesk.Aec.BuiltInType.AreaForce
Area force.

Autodesk.Aec.BuiltInType.Acceleration
Acceleration.