Autodesk.Aec.Modeler.BooleanOperatorType
BooleanOperatorType enumeration.

Autodesk.Aec.Modeler.BooleanOperatorType.Unite
Boolean unite.

Autodesk.Aec.Modeler.BooleanOperatorType.Subtract
Boolean subtract.

Autodesk.Aec.Modeler.BooleanOperatorType.Intersect
Boolean intersection.