Autodesk.Aec.DatabaseServices.CommandStatus
Command status enumeration.

Autodesk.Aec.DatabaseServices.CommandStatus.CommandAllowedAlways
Command always allowed.

Autodesk.Aec.DatabaseServices.CommandStatus.CommandNotAllowed
Command not allowed.

Autodesk.Aec.DatabaseServices.CommandStatus.CommandAllowedOnlyOnPickFirstSet
Command only allowed on picking the first set.