Autodesk.Aec.DatabaseServices.EntityBodyModifierOperationType
Entity body modifier operation type.

Autodesk.Aec.DatabaseServices.EntityBodyModifierOperationType.Additive
Entity body modifier is an operation type of additive.

Autodesk.Aec.DatabaseServices.EntityBodyModifierOperationType.Subtractive
Entity body modifier is an operation type of subtractive.

Autodesk.Aec.DatabaseServices.EntityBodyModifierOperationType.Replace
Entity body modifier is an operation type of replace.