Autodesk.Aec.DatabaseServices.DisplayTheme
Represents a display theme base class.

Autodesk.Aec.DatabaseServices.DisplayTheme.#ctor
Initializes a new instance of the DisplayTheme class.

Autodesk.Aec.DatabaseServices.DisplayTheme.SupportsVisualStyle
Gets if it supports visual style.
Returns: True if it supports visual style, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayTheme.Scale
Gets or sets scale.
Returns: Scale.

Autodesk.Aec.DatabaseServices.DisplayTheme.ParticipatesInDynamicUCS
Gets if it Participates in dynamic UCS.
Returns: True if it Participates in dynamic UCS, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayTheme.GetTransformMatrix
Gets transform matrix.
Returns: Transform matrix.

Autodesk.Aec.DatabaseServices.DisplayTheme.GetExtentBoundBox()
Gets extent bound box.

Autodesk.Aec.DatabaseServices.DisplayTheme.GetDimensionWidth()
Gets dimensions width.
style: Style.

Autodesk.Aec.DatabaseServices.DisplayTheme.GetDimensionHeight()
Gets dimensions height.
style: Style.

Autodesk.Aec.DatabaseServices.DisplayTheme.GetDimensionRowHeight()
Gets dimensions row height.
style: Style.

Autodesk.Aec.DatabaseServices.DisplayTheme.IsActive
Gets whether this display theme is active.
Returns: True if it is active, or false otherwise.