Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition
Represents a multi view block display representation definition.
Remarks: This class is responsible for storing a collection of MultiViewBlockDefinition objects.  Each viewBlock points to an autocad block definition to be displayed in various viewing directions. All contained view blocks are associated only with the display representation object that this class points to.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition.#ctor
Initializes a new instance of the MultiViewBlockDisplayRepresentationDefinition class.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition.DisplayRepresentationId
Gets or sets the id of the display representation.
Returns: Returns the id of the display representation.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition.ViewDefinitions
Gets the collection of MultiViewBlockViewDefinitions.
Returns: Returns the collection of MultiViewBlockViewDefinitions.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition.SetAttributeGripsDisabled(System.Boolean)
Disables the grips of each attribute.
disable: The new value to be used for disabling or enabling the attribute grips.