Autodesk.Aec.DatabaseServices.DictionaryMaterialDefinition
Represents a material definition dictionary.

Autodesk.Aec.DatabaseServices.DictionaryMaterialDefinition.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMaterialDefinition class using the specified database.
db: The database.

Autodesk.Aec.DatabaseServices.DictionaryMaterialDefinition.GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard definition id.
db: The database.
Returns: Returns the standard definition id.