Autodesk.Aec.Modeler.SphereSurface
Represents a sphere surface.

Autodesk.Aec.Modeler.SphereSurface.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for SphereSurface.

Autodesk.Aec.Modeler.SphereSurface.#ctor
Initializes a new instance of the SphereSurface class.

Autodesk.Aec.Modeler.SphereSurface.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the SphereSurface class using the specified point, radius, approx and body.
origin: The origin point.
radius: The radius.
approx: The approx.
body: The body.

Autodesk.Aec.Modeler.SphereSurface.Center
Gets the center point.
Returns: The center point.

Autodesk.Aec.Modeler.SphereSurface.Radius
Gets the radius.
Returns: The radius.

Autodesk.Aec.Modeler.SphereSurface.Approx
Gets the approx.
Returns: Returns the approx.