Autodesk.Aec.Modeler.CurveCollection
Represents a collection of Curves.

Autodesk.Aec.Modeler.CurveCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.CurveCollection.Item(System.Int32)
Gets or sets the Curve at the given index.
index: The index.

Autodesk.Aec.Modeler.CurveCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.CurveCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.CurveCollection.Count
Returns the number of Curves available on this collection.
Returns: Returns the number of Curves available on this collection.

Autodesk.Aec.Modeler.CurveCollection.Add(Autodesk.Aec.Modeler.Curve)
Adds the specified item to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.CurveCollection.IndexOf(Autodesk.Aec.Modeler.Curve)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.CurveCollection.Insert(System.Int32,Autodesk.Aec.Modeler.Curve)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.Modeler.CurveCollection.Remove(Autodesk.Aec.Modeler.Curve)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.Modeler.CurveCollection.Contains(Autodesk.Aec.Modeler.Curve)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.CurveCollection.CopyTo(Autodesk.Aec.Modeler.Curve[],System.Int32)
Copies the collection to the array.
array: The Curve array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.