Autodesk.Aec.DatabaseServices.NestedGridCellAssignment
Represents a nested grid cell assignment.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.#ctor
Initializes a new instance of the NestedGridCellAssignment class.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.Name
Gets or sets the name of the nested grid cell assignment.
Returns: A string with the name of the nested grid cell assignment.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.InfillDefinitionId
Gets or sets the infill definition id.
Returns: The infill definition id.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.NestedGridDefinition
Gets or sets the nested grid definition associated with this cell.
Returns: The nested grid definition associated with this cell, or null if none was associated yet.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.CellSpecifier
Gets or sets the index specifier associated with this cell.
Returns: The index specifier associated with this cell, or null if none was associated yet.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.Id
Gets or sets the id of the nested grid cell assignment.
Returns: Returns the id of the nested grid cell assignment.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.IsVoid
Gets the memory state of the nested grid cell assignment.
Returns: true if its void, false if its allocated.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.SetVoid
Sets the memory state of the nested grid cell assignment to null.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Deletes the existing nested grid definition.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignment.ParentGrid
Gets the parent grid.
Returns: The parent grid, or null if not found.