Autodesk.Aec.DatabaseServices.NestedGridDivisionRepeat
Represents a nested grid division repeat.

Autodesk.Aec.DatabaseServices.NestedGridDivisionRepeat.#ctor
Initializes a new instance of the NestedGridDivisionRepeat class.

Autodesk.Aec.DatabaseServices.NestedGridDivisionRepeat.CellSize
Gets or sets the cell size.
Returns: The cell size.

Autodesk.Aec.DatabaseServices.NestedGridDivisionRepeat.DistributeSlack
Gets or sets the state of the distribution slack.
Returns: The state of the distribution slack.

Autodesk.Aec.DatabaseServices.NestedGridDivisionRepeat.DistributionFlags
Gets or sets the distribution flags.
Returns: The distribution flags.