Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit
Represents an index specifier location.

Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit.#ctor
Initializes a new instance of the IndexSpecifierExplicit class.

Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit.IndexArray
Gets the array of integer indexes.

Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit.AppendToIndexArray(System.Integer)
Appends a new index to the array.
index: Input index to append.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit.RemoveFromIndexArray(System.Integer)
Removes the specified index from the array.
index: Input index to remove.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.IndexSpecifierExplicit.ClearIndexArray()
Clears the index array.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.