Autodesk.Aec.DatabaseServices.GridCustomNode
Represents a grid custom node.

Autodesk.Aec.DatabaseServices.GridCustomNode.#ctor
Initializes a new instance of the GridCustomNode class.

Autodesk.Aec.DatabaseServices.GridCustomNode.NodeLocation
Returns the node location type.
Returns: Returns the node location type.

Autodesk.Aec.DatabaseServices.GridCustomNode.SegmentId
Returns the segment Id.
Returns: Returns the segment Id.

Autodesk.Aec.DatabaseServices.GridCustomNode.GetIntersectionIds(Autodesk.AutoCAD.Geometry.IntegerCollection@,Autodesk.AutoCAD.Geometry.DoubleCollection@)
Returns the intersection Ids and parameters for this instance.
ids: The segment ids.
parameters: The segment parameters.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.