Autodesk.Aec.DatabaseServices.Classification
Represents a classification.

Autodesk.Aec.DatabaseServices.Classification.OwningSystemId
Gets the owning system id.
Returns: Returns the owning system id.

Autodesk.Aec.DatabaseServices.Classification.NameAndDescription
Gets the formatted name and description.
Returns: Returns the formatted name and description.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Classification.OwningSystemName
Gets the owning system name.
Returns: Returns the owning system name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.