Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection
Represents a collection of nested grid division components.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.Count
Returns the number of NestedGridDivision available on this collection.
Returns: Returns the number of NestedGridDivision available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridDivision[],System.Int32)
Copies the collection to the array.
array: The NestedGridDivision array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.Item(System.Int32)
Gets or sets the nested grid division at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridDivision)
Adds a nested grid division to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridDivision)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridDivision)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridDivision)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the specified item from the collection.
id: The id of the item to remove.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridDivisionComponentCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.