Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection
Represents a collection of nested grid cell overrides.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.Count
Returns the number of NestedGridCellOverride available on this collection.
Returns: Returns the number of NestedGridCellOverride available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridCellOverride[],System.Int32)
Copies the collection to the array.
array: The NestedGridCellOverride array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.Item(System.Int32)
Gets or sets the nested grid cell override at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridCellOverride)
Adds a nested grid cell override to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridCellOverride)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridCellOverride)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridCellOverride)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.Remove(Autodesk.Aec.DatabaseServices.NestedGridCellOverride)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.RemoveEntity(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the item at the specified index.
index: The index.
Throws System.InvalidOperationException: System.InvalidOperationException.

Autodesk.Aec.DatabaseServices.NestedGridCellOverrideCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.