Autodesk.Aec.DatabaseServices.MassElementStyle
Represents a mass element style.

Autodesk.Aec.DatabaseServices.MassElementStyle.#ctor
Initializes a new instance of the MassElementStyle class.

Autodesk.Aec.DatabaseServices.MassElementStyle.MaterialId
Gets or sets the material id.
Returns: Returns the material id.