Autodesk.Aec.Modeler.ImpTreeCollection
Represents a collection of ImpTree.

Autodesk.Aec.Modeler.ImpTreeCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.ImpTreeCollection.Item(System.Int32)
Gets or sets the ImpTree at the given index.
index: The index.

Autodesk.Aec.Modeler.ImpTreeCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.ImpTreeCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.ImpTreeCollection.Count
Returns the number of ImpTrees available on this collection.
Returns: Returns the number of ImpTrees available on this collection.

Autodesk.Aec.Modeler.ImpTreeCollection.Add(Autodesk.Aec.Modeler.ImpTree)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.Modeler.ImpTreeCollection.IndexOf(Autodesk.Aec.Modeler.ImpTree)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.ImpTreeCollection.Insert(System.Int32,Autodesk.Aec.Modeler.ImpTree)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.Modeler.ImpTreeCollection.Remove(Autodesk.Aec.Modeler.ImpTree)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.Modeler.ImpTreeCollection.Contains(Autodesk.Aec.Modeler.ImpTree)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.ImpTreeCollection.CopyTo(Autodesk.Aec.Modeler.ImpTree[],System.Int32)
Copies the collection to the array.
array: The ImpTree array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.