Autodesk.Aec.Geometry.NestedGridEdgeOverride
Represents a nested grid edge override.

Autodesk.Aec.Geometry.NestedGridEdgeOverride.#ctor
Initializes a new instance of the NestedGridEdgeOverride class.

Autodesk.Aec.Geometry.NestedGridEdgeOverride.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies another override to this override.
other: Input the other override.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.Geometry.NestedGridEdgeOverride.EdgePath
Gets or sets the edge path.
Returns: The edge path.

Autodesk.Aec.Geometry.NestedGridEdgeOverride.EdgeDefinitionId
Gets or sets the edge definition id.
Returns: The edge definition id.

Autodesk.Aec.Geometry.NestedGridEdgeOverride.IsVoid
Gets whether this override is void.
Returns: True if this override is void, or false otherwise.

Autodesk.Aec.Geometry.NestedGridEdgeOverride.SetVoid
Sets this override as void.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.Geometry.NestedGridEdgeOverride.IsStyleBased
Gets or sets whether this override is style based.
Returns: True to indicate style based, or false otherwise.