Autodesk.Aec.DatabaseServices.LayerKeyDefinition
Represents a layer key definition.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.#ctor
Initializes a new instance of the LayerKeyDefinition class.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.Key
Gets or sets the key.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.LayerName
Gets or sets the layer name.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.Color
Gets or sets the color.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.Linetype
Gets or sets the line type.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.Lineweight
Gets or sets the line weight.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.Plotstyle
Gets or sets the plot style.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.IsPlottable
Gets or sets the value that determines if it is plottable.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.Removable
Determines if the definition is removable from the style.
Returns: Returns true if the definition is removable from the style.
Remarks: A key is not removeable if it is in the list of default layer keys.

Autodesk.Aec.DatabaseServices.LayerKeyDefinition.Overrides
Gets the overrides in the layer key definition.
Returns: The overrides.