Autodesk.Aec.ApplicationServices.DrawingSetupVariables
Represents the drawing setup variables.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.#ctor
Initializes a new instance of the DrawingSetupVariables class.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.UnitType
Gets the unit type.
Returns: Returns the unit type.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.ScaleOnInsert
Gets or sets the scale on insert setting.
Returns: Returns the scale on insert setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.LinearUnit
Gets or sets the linear unit.
Returns: Returns the linear unit.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.LinearDisplayFormat
Gets or sets the linear display format.
Returns: Returns the linear display format.
Remarks: 1:Scientific, 2:Decimal, 3:Engineering, 4:Architectural, 5:Fractional.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.LinearPrecision
Gets or sets the linear precision.
Returns: Returns the linear precision.
Remarks: Specifies the number of digits to the right of the decimal point.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AngularDisplayFormat
Gets or sets the angular display format.
Returns: Returns the angular display format.
Remarks: 0:Decimal degrees, 1:Degrees/minutes/seconds, 2:Gradians, 3:Radians, 4:Surveyor's units.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AngularAzimuth
Gets or sets the angular azimuth.
Returns: Returns the angular azimuth.
Remarks: 0:Use Bearings, 1:Use North Azimuths, 2:Use South Azimuths.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AngularPrecision
Gets or sets the angular precision.
Returns: Returns the angular precision.
Remarks: Specifies the number of digits to the right of the decimal point.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.ElevationPrecision
Gets or sets the elevation precision.
Returns: Returns the elevation precision.
Remarks: Specifies the number of digits to the right of the decimal point.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CoordinatePrecision
Gets or sets the coordinate precision.
Returns: Returns the coordinate precision.
Remarks: Specifies the number of digits to the right of the decimal point.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AecDwgBasePt
Gets or sets the drawing base point as XYZ in WCS.
Returns: Returns the drawing base point as XYZ in WCS.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AecBasePtNE
Gets or sets the base point as ENZ in WCS.
Returns: Returns the base point as ENZ in WCS.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AecNorthRotation
Gets or sets the north rotation as an angle in radians measured counter-clockwise from the X axis (East).
Returns: Returns the north rotation.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.DwgScale
Gets or sets the drawing scale.
Returns: Returns the drawing scale.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.VerticalScale
Gets or sets the vertical scale.
Returns: Returns the vertical scale.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.TextHeight
Gets or sets the text height.
Returns: Returns the text height.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AreaDisplayUnit
Gets or sets the area display unit.
Returns: Returns the area display unit.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.ConvertToCurrentAreaDisplay(System.Double)
Converts the value using the current area display unit.
area: The area.
Returns: Returns the value converted using the current area display unit.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AreaPrecision
Gets or sets the area precision.
Returns: Returns the area precision.
Remarks: Specifies the number of digits to the right of the decimal point.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AreaSuffix
Gets or sets the area suffix.
Returns: Returns the area suffix.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.VolumeDisplayUnit
Gets or sets the volume display unit.
Returns: Returns the volume display unit.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.ConvertToCurrentVolumeDisplay(System.Double)
Converts the value using the current volume display unit.
volume: The volume.
Returns: Returns the value converted using the current volume display unit.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.VolumePrecision
Gets or sets the volume precision.
Returns: Returns the volume precision.
Remarks: Specifies the number of digits to the right of the decimal point.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.VolumeSuffix
Gets or sets the volume suffix.
Returns: Returns the volume suffix.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilStateFlag1
Gets or sets the civil state flag 1.
Returns: Returns the civil state flag 1.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilStateFlag2
Gets or sets the civil state flag 2.
Returns: Returns the civil state flag 2.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilStateFlag3
Gets or sets the civil state flag 3.
Returns: Returns the civil state flag 3.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilDimaltd
Gets or sets the civil DIMALTD variable.
Returns: Returns the civil DIMALTD variable.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilTextStyle
Gets or sets the civil text style.
Returns: Returns the civil text style.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilDimpost
Gets or sets the civil DIMPOST variable.
Returns: Returns the civil DIMPOST variable.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilDimapost
Gets or sets the civil DIMAPOST variable.
Returns: Returns the civil DIMAPOST variable.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilDimexo
Gets or sets the civil DIMEXO variable.
Returns: Returns the civil DIMEXO variable.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilDimscale
Gets or sets the civil DIMSCALE variable.
Returns: Returns the civil DIMSCALE variable.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CivilDimaltf
Gets or sets the civil DIMALTF variable.
Returns: Returns the civil DIMALTF variable.
Remarks: This is a civil engineering variable.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.ProjectName
Gets or sets the project name.
Returns: Returns the project name.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.LayerStandard
Gets or sets the layer standard.
Returns: Returns the layer standard.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.LayerStandardLegacy
Gets the layer standard legacy.
Returns: Returns the layer standard legacy.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.IsMetric
Specifies if the drawing uses Metric units.
Returns: Returns true if the drawing uses Metric units.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.FacetDeviation
Gets or sets the facet deviation.
Returns: Returns the facet deviation.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.MaxFacetsOnCircle
Gets or sets the maximum facets on circle.
Returns: Returns the maximum facets on circle.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.LayerFile
Gets or sets the layer file. It is retrieved via the registry and therefore will not change via assignment until the SaveAsDefault function is called.
Returns: Returns the layer file.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.SuperScript
Gets or sets the super script.
Returns: Returns the super script.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.SuperScriptZeroSupression
Gets or sets the super script zero supression setting.
Returns: Returns the super script zero supression setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.ElevationLabelPlus
Gets or sets the elevation label plus setting.
Returns: Returns the elevation label plus setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.ElevationLabelPlusMinus
Gets or sets the elevation label plus minus setting.
Returns: Returns the elevation label plus minus setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CurrentDimUnit
Gets or sets the current dimension unit.
Returns: Returns the current dimension unit.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.LastLayerStyleUpdate
Gets the last layer style update setting.
Returns: Returns the last layer style update setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.AlwaysUpdateLayerKeyStyle
Gets or sets the always update layer key style.
Returns: Returns the always update layer key style.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.SaveAsDefault
Saves the drawing setup variables are the default.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.CreateDimOverride
Gets or sets the create dimension override setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.XrefOverlaysUseOwnDisplayConfig
Gets or sets the xref overlays use own display configuration setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.BlockBasedLayerOffBehavior
Gets or sets the block based layer off behavior setting.
Returns: Returns the block based layer off behavior setting.

Autodesk.Aec.ApplicationServices.DrawingSetupVariables.GetInstance(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
Gets the drawing setup variables for the specified database.
db: The database.
createIfNotFound: Determines if the drawing setup variables are created if not found.
Returns: Returns the drawing setup variables for the specified database.