Autodesk.Aec.DatabaseServices.DictionaryRecord
Represents a dictionary record.

Autodesk.Aec.DatabaseServices.DictionaryRecord.Name
Gets the dictionary name.
Returns: Returns the dictionary name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DictionaryRecord.LocalizedName
Gets the localized display name.
Returns: Returns the localized display name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DictionaryRecord.AlternateName
Gets or sets the alternate name.
Returns: Returns the alternate name.

Autodesk.Aec.DatabaseServices.DictionaryRecord.IsLocked
Gets or sets the value that determines if the dict record is locked.
Returns: true, if the dict record is locked.

Autodesk.Aec.DatabaseServices.DictionaryRecord.Keynote
Gets or sets the keynote.
Returns: Returns the keynote.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DictionaryRecord.KeynoteValue
Gets the keynote value.
Returns: Returns the keynote value.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DictionaryRecord.AutomaticallyBoundSpaces
Gets or sets whether this object acts as an automatic space boundary.
Returns: AutomaticSpaceBoundary.Yes indicates it will act as an automatic space boundary.  AutomaticSpaceBoundary.No indicates it will NOT act as an automatic space boundary.  AutomaticSpaceBoundary.NotApplicableToThisObject indicates it can not act as an automatic space boundary.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DictionaryRecord.Classifications
Gets the classification collection. Perform add/remove operations on the collection.
Returns: Returns the classification collection.
Remarks: When there are no classifications present, an empty collection is provided that classification definitions Ids can be added to.

Autodesk.Aec.DatabaseServices.DictionaryRecord.Translator
Gets or sets the name translator for this dictionary record.
Returns: The current translator.