Autodesk.Aec.Modeler.ColorType
Color enumeration.

Autodesk.Aec.Modeler.ColorType.Color1
Color1.

Autodesk.Aec.Modeler.ColorType.Color2
Color2.

Autodesk.Aec.Modeler.ColorType.Color3
Color3.

Autodesk.Aec.Modeler.ColorType.Color4
Color4.

Autodesk.Aec.Modeler.ColorType.ColorInvisible
ColorInvisible.