Autodesk.Aec.DatabaseServices.GraphicsStorageHatch.Vectors
Gets the vectors of the hatch.
Returns: The vectors of the hatch.

Autodesk.Aec.DatabaseServices.GraphicsStorageHatch.HatchType
Gets the hatch type.
Returns: The hatch type.

Autodesk.Aec.DatabaseServices.GraphicsStorageHatch
Represents a graphics storage that stores hatch data.