Autodesk.Aec.DatabaseServices.Section2d
Represents a section 2D.

Autodesk.Aec.DatabaseServices.Section2d.#ctor
Initializes a new instance of the Section2d class.

Autodesk.Aec.DatabaseServices.Section2d.IsSavedEdits
Determine if it is saved edits.
Returns: true if it is saved edits, false otherwise.

Autodesk.Aec.DatabaseServices.Section2d.IsSingleSegment
Determine if it is single segment.
Returns: true if it is single segment, false otherwise.

Autodesk.Aec.DatabaseServices.Section2d.SetIsSingleSegment(System.Boolean,System.UInt32)
Sets if it is single segment.
value: true if it is single segment, false otherwise.
segmentId: The segment ID.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2d.SingleSegment
Gets the section segment.
Returns: The section segment.

Autodesk.Aec.DatabaseServices.Section2d.SingleSegmentId
Gets the single segment ID.
Returns: The single segment ID.

Autodesk.Aec.DatabaseServices.Section2d.Vertices
Gets the vertices.
Returns: The section vertex collection.

Autodesk.Aec.DatabaseServices.Section2d.Segments
Gets the segments.
Returns: The section segment collection.

Autodesk.Aec.DatabaseServices.Section2d.SegmentGroups
Gets the segment groups.
Returns: The segment group collection.

Autodesk.Aec.DatabaseServices.Section2d.ShrinkWrapSegmentGroup
Gets the shrink wrap segment group.
Returns: The shrink wrap segment group.

Autodesk.Aec.DatabaseServices.Section2d.IntegrateLineWork(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.ComponentType,System.Int16,Autodesk.Aec.DatabaseServices.LineWorkType,System.Boolean,System.Boolean)
Integrate line work.
startPoint: The start point.
endPoint: The end point.
materialId: The material ID.
componentType: The component type.
userComponentId: The user component ID.
lineworkType: The line work type.
isManual: true if it is manual, false otherwise.
isEdit: true if it is edit, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2d.MergeLineWork(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,System.Int16,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.LineWorkType,System.Boolean)
Merge line work.
startPoint: The start point.
endPoint: The end point.
componentId: The component ID.
materialId: The material ID.
lineworkType: The line work type.
mergeExactOnly: true to merge exact only, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2d.MergeSection2d(Autodesk.Aec.DatabaseServices.Section2d,System.Boolean,System.Boolean,System.Boolean)
Merge section 2D.
section: The section.
doComponentEdits: true to do component edits, false otherwise.
doMergeEdits: true to do merge edits, false otherwise.
removeSegments: true to remove segments, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2d.ClipVolumeId
Gets or sets the clip volume ID.
Returns: The clip volume ID.

Autodesk.Aec.DatabaseServices.Section2d.MainSectionId
Gets or sets the main section ID.
Returns: The main section ID.

Autodesk.Aec.DatabaseServices.Section2d.RemoveAllLineWork
Remove all line work.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2d.ShrinkWrapProfile
Gets or sets the shrink wrap profile.
Returns: The shrink wrap profile.

Autodesk.Aec.DatabaseServices.Section2d.HatchRegions
Gets the hatch regions.
Returns: The hatchregions.

Autodesk.Aec.DatabaseServices.Section2d.HasUserEdits
Determine if it has user edits.
Returns: true if it has user edits, false otherwise.

Autodesk.Aec.DatabaseServices.Section2d.RemoveAllButUserEdits
Removes all but user edits.

Autodesk.Aec.DatabaseServices.Section2d.SaveEditInPlaceChanges
Save edit in place changes.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2d.HasAssociatedModelSpaceView(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determine if it has association with model space view.
viewTableRecordId: true if it has association with model space view, false otherwise.
Returns: true if it has association with model space view, false otherwise.

Autodesk.Aec.DatabaseServices.Section2d.SetAssociatedModelSpaceView(Autodesk.AutoCAD.DatabaseServices.ViewTableRecord)
Sets the association with model space view.
viewTableRecord: The view table record.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2d.RemoveObjectPropertyDependencies
Remove object property dependencies.

Autodesk.Aec.DatabaseServices.Section2d.HasObjectDisplayPropertyInformation
Determine if it has object display property information.
Returns: true if it has object display property information, false otherwise.

Autodesk.Aec.DatabaseServices.Section2d.HatchRegionsCount
Gets the number of hatch regions.
Returns: The number of hatch regions.