Autodesk.Aec.DatabaseServices.EntityCollectorFilter
Represents a entity collector filter.

Autodesk.Aec.DatabaseServices.EntityCollectorFilter.Create(System.IntPtr,System.Boolean)
Creates a new instance of the EntityCollectorFilter class.
unmanagedPointer: The native class pointer.
autoDelete: The boolean value if deletes the native pointer.

Autodesk.Aec.DatabaseServices.EntityCollectorFilter.#ctor
Initializes a new instance of the EntityCollectorFilter class.

Autodesk.Aec.DatabaseServices.EntityCollectorFilter.AllowEntity(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.Aec.DatabaseServices.EntityCollectorData&amp;)
Checks if the specified entity is allowed.
entity: The specified entity.
dataToAdd: The data to be added.
Returns: The boolean value if the specified entity is allowed.

Autodesk.Aec.DatabaseServices.EntityCollectorFilter.AllowEntity(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.Aec.DatabaseServices.EntityCollectorData&amp;)
Checks if the specified entity is allowed.
entity: The specified entity.
idArrayBlockReferencePath: The block reference path.
dataToAdd: The data to be added.
Returns: The boolean value if the specified entity is allowed.

Autodesk.Aec.DatabaseServices.EntityCollectorFilter.RecurseBlock(Autodesk.AutoCAD.DatabaseServices.BlockReference,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
TellS if the block reference should be recursively checked.  Default implementation is to return the same value as if allowEntity is called.
blockReference: The specified block reference.
idArrayBlockReferencePath: The block ref path of the block reference.
Returns: The boolean value if the specified block reference should be recursively checked.

Autodesk.Aec.DatabaseServices.EntityCollectorFilter.CheckRecurseBlock
Gets or sets the boolean value if recursively checks block.
Returns: The boolean value if recursively checks block.