Autodesk.Aec.DatabaseServices.EditInPlaceProfile
Represents an edit in place profile.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.#ctor
Initializes a new instance of the EditInPlaceProfile class.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.EcsInsertionPoint
Gets or sets the ecs insertion point.
Returns: The ecs insertion point.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.InsertionPoint
Gets or sets the insertion point.
Returns: The insertion point.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.BaseProfile
Gets or sets the base profile.
Returns: The base profile.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.InvalidProfile
Gets or sets the invalid profile.
Returns: The invalid profile.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.SetEcsVertices(Autodesk.AutoCAD.Geometry.Point2dCollection)
Sets the ecs vertices.
points: The specified vertices.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.SetVertices(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Plane)
Sets the vertices.
points: The specified vertices.
plane: The specified plane.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.AddEcsVertex(Autodesk.AutoCAD.Geometry.Point2d)
Adds ecs vertex.
ecsVertex: The specified ecs vertex.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.RemoveEcsVertex(Autodesk.AutoCAD.Geometry.Point2d)
Removes ecs vertex.
ecsVertex: The specified ecs vertex.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.AddVertex(Autodesk.AutoCAD.Geometry.Point3d)
Adds vertex.
ecsVertex: The specified vertex.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.RemoveVertex(Autodesk.AutoCAD.Geometry.Point3d)
Removes vertex.
vertex: The specified vertex.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.EditingConstraint
Gets or sets the editing constraint.
Returns: The current editing constraint.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.EditingContext
Gets or sets the editing context.
Returns: The current editing context.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.UsesInsertionPoint
Gets or sets whether the insertion point should be used.
Returns: Boolean value indicates whether the insertion point should be used.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.DrawDefaultGraphics
Gets or sets whether the default graphics should be drawn.
Returns: Boolean value indicates whether the default graphics should be drawn.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.UseDefaultGrips
Gets or sets whether the default grips should be used.
Returns: Boolean value indicates whether the default grips should be used.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.UseDefaultMenus
Gets or sets whether the default menus should be used.
Returns: Boolean value indicates whether the default menus should be used.

Autodesk.Aec.DatabaseServices.EditInPlaceProfile.UseMoveGrip
Gets or sets whether the move grip should be used.
Returns: Boolean value indicates whether the move grip should be used.