Autodesk.Aec.DatabaseServices.GraphicsStoragePolyline.Points
Gets the points of the polyline.
Returns: The points of the polyline.

Autodesk.Aec.DatabaseServices.GraphicsStoragePolyline
Represents a graphics storage that stores polyline data.