Autodesk.Aec.DatabaseServices.ReferenceDocument
Represents a reference document.

Autodesk.Aec.DatabaseServices.ReferenceDocument.#ctor
Initializes a new instance of the ReferenceDocument class.

Autodesk.Aec.DatabaseServices.ReferenceDocument.FilePath
Gets the file path.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ReferenceDocument.FileFullPath
Gets the file fullpath.
Returns: Returns the file full path.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: If the path is relative, the current database path is appended.

Autodesk.Aec.DatabaseServices.ReferenceDocument.ExtensionDictionaryName
Get the name of extension dictionary.
Returns: The name of extension dictionary.