Autodesk.Aec.DatabaseServices.NestedGridDivision
Represents a nested grid division.

Autodesk.Aec.DatabaseServices.NestedGridDivision.#ctor
Initializes a new instance of the NestedGridDivision class.

Autodesk.Aec.DatabaseServices.NestedGridDivision.DivisionDirection
Gets or sets the grid division direction.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridDivision.GetEdgePositions(System.Double,System.Double,Autodesk.AutoCAD.Geometry.DoubleCollection@,System.Double,Autodesk.Aec.DatabaseServices.GridAssembly)
Gets the edge positions.
startPosition: Start position.
endPosition: End position.
edgePositions: Returned collection of edge positions.
baseCurveRadius: Base curve radius.
gridAssembly: The grid assembly.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by derived classes.

Autodesk.Aec.DatabaseServices.NestedGridDivision.Id
Gets or sets the id of the nested grid division.
Returns: Returns the id of the nested grid division.

Autodesk.Aec.DatabaseServices.NestedGridDivision.Name
Gets or sets the name of the nested grid.
Returns: A string with the name of the nested grid.

Autodesk.Aec.DatabaseServices.NestedGridDivision.StartOffset
Gets or sets the start offset distance.
Returns: The start offset distance.

Autodesk.Aec.DatabaseServices.NestedGridDivision.EndOffset
Gets or sets the end offset distance.
Returns: The end offset distance.