Autodesk.Aec.DatabaseServices.LayoutNode
Represents a layout node.

Autodesk.Aec.DatabaseServices.LayoutNode.#ctor
Initializes a new instance of the LayoutNode class.

Autodesk.Aec.DatabaseServices.LayoutNode.NodeId
Gets or sets the node id.
Returns: The node id.