Autodesk.Aec.DatabaseServices.EntityCollectorData
Represents a Entity data collector.

Autodesk.Aec.DatabaseServices.EntityCollectorData.Create(System.IntPtr,System.Boolean)
Creates a new instance of the EntityCollectorData class.
unmanagedPointer: The native class pointer.
autoDelete: The boolean value if deletes the native pointer.

Autodesk.Aec.DatabaseServices.EntityCollectorData.#ctor
Initializes a new instance of the EntityCollectorData class.