Autodesk.Aec.Modeler.ListFlags
ListFlags enumeration.

Autodesk.Aec.Modeler.ListFlags.General
General.

Autodesk.Aec.Modeler.ListFlags.Surface
Surface.

Autodesk.Aec.Modeler.ListFlags.Vertex
Vertex.

Autodesk.Aec.Modeler.ListFlags.Face
Face.

Autodesk.Aec.Modeler.ListFlags.Edge
Edge.