Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection
Represents a NameObjectIdPair collection.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.#ctor
Initializes a new instance of the NameObjectIdPairCollection class.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.#ctor(System.Boolean)
Initializes a new instance of the NameObjectIdPairCollection class using the specified parameter.
caseSensitive: Flag that indicates whether the collection is case sensitive.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.CopyTo(Autodesk.Aec.DatabaseServices.NameObjectIdPair[],System.Int32)
Copies the collection to the array.
array: The NameObjectIdPair array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Item(System.Int32)
Gets or sets the NameObjectIdPair at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Count
Returns the number of items available on this collection.
Returns: Returns the number of items available on this collection.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Add(Autodesk.Aec.DatabaseServices.NameObjectIdPair)
Adds the specified item to the tail of the collection.
item: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.IndexOf(Autodesk.Aec.DatabaseServices.NameObjectIdPair)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NameObjectIdPair)
Inserts the specified item into the collection at the specified index. This operation is not supported.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Remove(Autodesk.Aec.DatabaseServices.NameObjectIdPair)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Contains(Autodesk.Aec.DatabaseServices.NameObjectIdPair)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Clear
Removes all items from the collection.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.AddAlpha(Autodesk.Aec.DatabaseServices.NameObjectIdPair)
Adds the specified item to the collection at the appropriate position in alphabetic order.
item: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.AddHead(Autodesk.Aec.DatabaseServices.NameObjectIdPair)
Adds the specified item to the head collection.
item: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.RemoveHead()
Removes the first item in the collection.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.RemoveTail()
Removes the last item in the collection.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.Rename(System.String,System.String)
Change the name of specific NameObjectIdPair existing in the collection.
oldName: The original name of the NameObjectIdPair.
newName: The new name of the NameObjectIdPair.
Returns: Flag indicates whether this operation succeeded.
Throws System.ArgumentNullException: System.ArgumentNullException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.IndexOf(System.String)
Determines the index of the item matching the specific name.
name: specific name.
Returns: Returns the index of the item.
Throws System.ArgumentNullException: System.ArgumentNullException.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.IndexOf(Autodesk.Aec.DatabaseServices.ObjectId)
Determines the index of the item matching the specific object id.
objectId: Specific object id.
Returns: Returns the index of the item.

Autodesk.Aec.DatabaseServices.NameObjectIdPairCollection.GetMatchFor(Autodesk.Aec.DatabaseServices.ObjectId)
Returns the name of the item matching the specific object id.
objectId: Specific object id.
Returns: Returns the name of the item. Returns null if no item matches the object id.