Autodesk.Aec.DatabaseServices.LineWorkComponent
Represents a line work component.

Autodesk.Aec.DatabaseServices.LineWorkComponent.#ctor
Initializes a new instance of the LineWorkComponent class.

Autodesk.Aec.DatabaseServices.LineWorkComponent.Id
Gets or sets the ID.
Returns: The component ID.

Autodesk.Aec.DatabaseServices.LineWorkComponent.Name
Gets or sets the name.
Returns: The name.

Autodesk.Aec.DatabaseServices.LineWorkComponent.Description
Gets or sets the description of line work component.
Returns: The discription of it.