Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat
Represents a display theme cell format.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.#ctor
Initializes a new instance of the DisplayThemeCellFormat class.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.ScaleBy(System.Double)
Scale by.
scale: Scale.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.TextStyleId
Gets or sets text style id.
Returns: Text style id.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.TextStyleIdString
Gets test style id string.
Returns: Text style id string.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.Height
Gets or sets height.
Returns: Height.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.Gap
Gets or sets gap.
Returns: Gap.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.RotationType
Gets or sets rotation type.
Returns: Rotation type.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.ThemeSymbolType
Gets or sets theme symbol type.
Returns: Theme symbol type.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.GetWidth(System.String)
Gets the extents width.
text: Text.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.GetHeight(System.String)
Gets the extents height.
text: Text.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.GetCellHeightWithFixedWidth(System.String,System.Double)
Gets cell height.
text: Text.
fixedWidth: Fixed width.
Returns: Cell height.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.GetActualTextHeight(System.String,System.Double)
Gets actual text height.
text: String text.
textHeightScale: Text height scale.
Returns: Actual text height.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.GetRotatedTextCellWidth(System.String,System.Double)
Gets rotated text cell width.
text: String.
fixedWidth: Fixed width.
Returns: Rotated text cell width.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.GetSymbolWidth(System.Int32)
Gets the symbol width.
count: Count.

Autodesk.Aec.DatabaseServices.DisplayThemeCellFormat.GetSymbolHeight(System.Int32)
Gets the symbol height.
count: Count.