Autodesk.Aec.DatabaseServices.GridAssemblyStyle
Represents a grid assembly style.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.#ctor
Initializes a new instance of the GridAssemblyStyle class.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.GridAssemblyDefinition
Gets or sets the grid assembly definition.
Returns: The grid assembly definition.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.ComponentSet
Gets or sets the grid assembly component set.
Returns: The grid assembly component set, or null if none was set.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.SetFromGridAssemblyEntity(Autodesk.Aec.DatabaseServices.GridAssembly@,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Sets the grid assembly style based on the data from the grid assembly given.
gridAssembly: The given grid assembly (will be modified)
copyMergers: The state to copy merge data.
copyCellOverrides: The state to copy merge data.
copyEdgeOverrides: The state to copy edge overrides.
copyProfileOverrides: The state to copy profile overrides.
copyDivisionOverrides: The state to copy division overrides.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: This method: copies the grid definition and components from the given grid assembly; and copies over former style based overrides and new instance overrides if any was specified (and removes them from the given grid assembly instance).  Throws exception if grid definition location of the given grid assembly is StyleBased, or if it was unable to get the grid assembly definition or components from the given grid assembly.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.IncrementCellAssignmentId
Increments the cell assignment id, and returns the new value.
Returns: The next cell assignment id.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.IncrementEdgeAssignmentId
Increments the edge assignment id, and returns the new value.
Returns: The next edge assignment id.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.NestedGridCellOverrides
Gets the nested grid cell overrides collection.
Returns: The grid nested grid cell overrides collection.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.NestedGridEdgeOverrides
Gets the nested grid edge overrides collection.
Returns: The grid nested grid edge overrides collection.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.NestedGridEdgeProfileOverrides
Gets the nested grid edge profile overrides collection.
Returns: The grid nested grid edge profile overrides collection.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.NestedGridDivisionOverrides
Gets the nested grid division overrides collection.
Returns: The grid nested grid division overrides collection.

Autodesk.Aec.DatabaseServices.GridAssemblyStyle.GetMaterialIds(Autodesk.Aec.DatabaseServices.GridAssemblyComponentType,Autodesk.AutoCAD.Geometry.IntegerCollection@,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection@)
Gets the component ids and collection of material ids for a given component type.
component: The component type.
componentIds: The returned collection of component ids.
materialIdsCollection: The returned collection of material ids.