Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection
Represents a collection of nested grid interior edge assignments.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Count
Returns the number of NestedGridEdgeAssignment available on this collection.
Returns: Returns the number of NestedGridEdgeAssignment available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment[],System.Int32)
Copies the collection to the array.
array: The NestedGridEdgeAssignment array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Item(System.Int32)
Gets or sets the nested grid interior edge at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment)
Adds a nested grid interior edge to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkAssembly)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Default
Gets or sets the default interior edge assignment.
Returns: The default interior edge assignment, or null if none was set.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeAssignmentCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.