Autodesk.Aec.DatabaseServices.EntityReference
Represents a entity reference.

Autodesk.Aec.DatabaseServices.EntityReference.#ctor
Initializes a new instance of the EntityReference class.

Autodesk.Aec.DatabaseServices.EntityReference.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Initializes a new instance of the EntityReference class using the specified referred entity.
refEnt: The object id of the referenced entity.

Autodesk.Aec.DatabaseServices.EntityReference.UseOffset
Gets or sets if use the specified insertion point offset.
Returns: Return true, if use the specified insertion point offset. Otherwise, return false.

Autodesk.Aec.DatabaseServices.EntityReference.InsertionPointOffset
Gets or sets the insertion point offset.
Returns: The insertion point offset.

Autodesk.Aec.DatabaseServices.EntityReference.InsertionPointOfReferredEntity
Gets or sets the insert point of the referred entity.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EntityReference.ReferredEntityEcs
Get the Ecs of the referred entity.
Returns: The Ecs of the referred entity.

Autodesk.Aec.DatabaseServices.EntityReference.ReferredEntityEcsInverse
Get the inverse of the referred entity Ecs.
Returns: The inverse of the referred entity Ecs.