Autodesk.Aec.DatabaseServices.OverrideMask
Represents a override mask.

Autodesk.Aec.DatabaseServices.OverrideMask.#ctor
Initializes a new instance of the OverrideMask class.

Autodesk.Aec.DatabaseServices.OverrideMask.MaskId
Gets or sets the ObjectId of the mask entity.
Returns: The ObjectId of the mask entity.

Autodesk.Aec.DatabaseServices.OverrideMask.ViewId
Gets or sets the ObjectId of the DisplayRep object that is being masked.
Returns: The ObjectId.