Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge
Represents an index specifier boundary edge.

Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge.#ctor
Initializes a new instance of the IndexSpecifierBoundaryEdge class.

Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge.OnTop
Returns true if boundary edge is on the top, false otherwise.
Returns: true if boundary edge is on the top, false otherwise.

Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge.OnLeft
Returns true if boundary edge is on the left, false otherwise.
Returns: true if boundary edge is on the left, false otherwise.

Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge.OnBottom
Returns true if boundary edge is on the bottom, false otherwise.
Returns: true if boundary edge is on the bottom, false otherwise.

Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge.OnRight
Returns true if boundary edge is on the right, false otherwise.
Returns: true if boundary edge is on the right, false otherwise.

Autodesk.Aec.DatabaseServices.IndexSpecifierBoundaryEdge.BoundaryFlags
Gets or sets the boundary location flags.
Returns: Returns the boundary location flags.