Autodesk.Aec.DatabaseServices.UVLayoutModeType
LayoutMode types for GridUv object.

Autodesk.Aec.DatabaseServices.UVLayoutModeType.Manual
Layout grid lines are specified manually.

Autodesk.Aec.DatabaseServices.UVLayoutModeType.Repeat
Layout grid lines are specified with equidistant spacing between lines. The number of lines is determined by the size of the grid. As the size of the grid changes, lines are added or subtracted accordingly. The distance between the lines remains fixed.

Autodesk.Aec.DatabaseServices.UVLayoutModeType.SpaceEvenly
The number of layout grid lines is specified. The space between the lines is determined by the size of the layout grid. As the size of the grid changes, the spacing between the lines is lengthened or shortened accordingly. The number of lines remains fixed.