Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference
Represents a multi view block attribute reference.
Remarks: This class is responsible for containment and maintenance of an in-memory AttributeReference and prompt. The attribute requires special handling to keep its justification updated.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.#ctor
Initializes a new instance of the MultiViewBlockAttributeReference class.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.#ctor(System.String,Autodesk.AutoCAD.DatabaseServices.AttributeReference)
Initializes a new instance of the MultiViewBlockAttributeReference class using the specified prompt and attribute.
prompt: The prompt.
attribute: The attribute.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.Prompt
Gets or sets the prompt string of the attribute.
Returns: Returns a string containing the attribute's prompt.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.Attribute
Gets or sets the AttributeReference.
Returns: Returns the AttributeReference.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.NeedsUpdate
Gets or sets the update status.
Returns: true if update is needed, false otherwise.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.MText
Gets the MText of the AttributeReference.
Returns: The MText of AttributeReference, or null if none was found.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.CopyToMText
Copies the properties and string from the in-memory AttributeReference onto the in-memory MText.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference.DeleteMText
Deletes the in-memory MText.