Autodesk.Aec.Modeler.MorphingMapElement
Represents a element of morphing map.

Autodesk.Aec.Modeler.MorphingMapElement.#ctor
Initializes a new instance of the MorphingMapElement class.

Autodesk.Aec.Modeler.MorphingMapElement.#ctor(System.Int32,System.Int32,System.Int32)
Initializes a new instance of the MorphingMapElement class.

Autodesk.Aec.Modeler.MorphingMapElement.op_Equality(Autodesk.Aec.Modeler.MorphingMapElement, Autodesk.Aec.Modeler.MorphingMapElement)
Compares equality of two objects of MorphingMapElement type.

Autodesk.Aec.Modeler.MorphingMapElement.op_Inequality(Autodesk.Aec.Modeler.MorphingMapElement, Autodesk.Aec.Modeler.MorphingMapElement)
Compares inequality of two objects of MorphingMapElement type.

Autodesk.Aec.Modeler.MorphingMapElement.FromIndex
The From Index.

Autodesk.Aec.Modeler.MorphingMapElement.ToIndex
The To Index.

Autodesk.Aec.Modeler.MorphingMapElement.Visibility
The Visibility.