Autodesk.Aec.DatabaseServices.AnchorLeaderToNode
Represents a leader to a node anchor.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNode.#ctor
Initializes a new instance of the AnchorLeaderToNode class.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNode.FirstExtension
Gets or sets the length of the first leader extension.
Returns: Returns the length of the first leader extension.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNode.SecondExtension
Gets or sets the length of the second leader extension.
Returns: Returns the length of the first leader extension.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNode.Angle
Gets or sets the angle of the leader.
Returns: Returns the angle of the leader.

Autodesk.Aec.DatabaseServices.AnchorLeaderToNode.Vectors
Gets the collection of vectors.
Returns: Returns the collection of vectors.