Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData
Represents a drawing data of Graphics System Entity.

Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData.#ctor
Initializes a new instance of the GraphicsSystemEntityDrawData class.

Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData.FreeDrawData
Frees the drawing data.

Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData.DbObject
Gets or sets the entity of the GraphicsSystemEntityDrawData object.
Returns: The specified entity.

Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData.GsMarkerInformationTree
Gets or sets the GsMarker information tree of the GraphicsSystemEntityDrawData object.
Returns: The GsMarker information tree of the GraphicsSystemEntityDrawData object.

Autodesk.Aec.DatabaseServices.GraphicsSystemEntityDrawData.IsBusy
Gets or sets the boolean value that indicates the busy status of the data.
Returns: Boolean value indicates the busy status of the data.