Autodesk.Aec.DatabaseServices.ListDefinition
Represents a list definition.

Autodesk.Aec.DatabaseServices.ListDefinition.#ctor
Initializes a new instance of the ListDefinition class.

Autodesk.Aec.DatabaseServices.ListDefinition.AllowToVary
Gets or sets if the list definition is allowed to vary.
Returns: Returns true if the list definition is allowed to vary. Otherwise, returns false.

Autodesk.Aec.DatabaseServices.ListDefinition.GetListItems
Gets the items of this list definition.
Returns: The ObjectId collection of all list items.

Autodesk.Aec.DatabaseServices.ListDefinition.AddListItem(System.String)
Adds a new item to the list definition.
name: The name of the new item to add.
Returns: The ObjectId of the new added list item.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ListDefinition.GetListItem(System.String)
Returns the ObjectId of the list item whose name is the specified name.
name: The name of the wanted list item.
Returns: The ObjectId of the list item with respect to the specified name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ListDefinition.DeleteListItem(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the list item whose ObjectId is the specified id.
id: The ObjectId of the list item to remove.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ListDefinition.RenameList(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Renames the list item name with respect to the ObjectId of the list definition to rename.
listId: The ObjectId of the list item to rename.
newName: The new name for the list item.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.