Autodesk.Aec.Modeler.ErrorCode
ErrorCode enumeration.

Autodesk.Aec.Modeler.ErrorCode.OK
Error message: OK.

Autodesk.Aec.Modeler.ErrorCode.Fail
Error message: Fail.

Autodesk.Aec.Modeler.ErrorCode.ViewPointLiesInsideScene
Error message: Viewpoint lies inside scene.