Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition
Represents a nested grid division manual edge definition.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition.#ctor
Initializes a new instance of the NestedGridDivisionManualEdgeDefinition class.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies NestedGridDivisionManualEdgeDefinition data from the specified NestedGridDivisionManualEdgeDefinition object.
other: The other NestedGridDivisionManualEdgeDefinition object.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition.AxisReference
Gets or sets the axis reference type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridDivisionManualEdgeDefinition.Offset
Gets or sets the offset distance.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.