Autodesk.Aec.Modeler.PolygonVertexDataType
PolygonVertexDataType enumeration.

Autodesk.Aec.Modeler.PolygonVertexDataType.Arc3d
Arc3d type.

Autodesk.Aec.Modeler.PolygonVertexDataType.ArcByRadius
Arc by radius type.

Autodesk.Aec.Modeler.PolygonVertexDataType.ArcByBulge
Arc by bulge type.

Autodesk.Aec.Modeler.PolygonVertexDataType.FilletByRadius
Fillet by radius type.

Autodesk.Aec.Modeler.PolygonVertexDataType.UnspecifiedCurve
Unspeicified curve type.