Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode
Represents a node of the GsMarker information related to the display represetation.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.#ctor
Initializes a new instance of the GsMarkerDisplayRepresentationInformationNode class.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.#ctor(Autodesk.Aec.DatabaseServices.GsMarkerInformationTree,Autodesk.Aec.DatabaseServices.GsMarkerInformationNode)
Initializes a new instance of the GsMarkerDisplayRepresentationInformationNode class using the specified display representation, parent tree and parent node.
displayRepresentationId: The object id of the specified display representation.
parentTree: The specified parent tree.
parentNode: The specified parent node.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.DisplayRepresentationId
Gets or sets the object id of the display representation.
Returns: The object id of the display representation.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.DisplayPropertiesId
Gets or sets the object id of the display properties.
Returns: The object id of the display properties.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.SetDisplayPropertiesInformation(Autodesk.Aec.DatabaseServices.DisplayProperties)
Sets the information of the display properties.
properties: The information of the display properties.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.ResetTransientDisplayPropertiesInformation
Resets the information of the transient display properties.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.GetDisplayComponentName(Autodesk.Aec.DatabaseServices.DisplayComponentEntity)
Gets the name of the spcified display component.
component: The specified component.
Returns: The name of the spcified display component.
Throws Autodesk.AutoCAD.Runtime.Exception: The exception is thrown if the name of the component is not found.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayRepresentationInformationNode.GetDisplayComponentId(Autodesk.Aec.DatabaseServices.DisplayComponentEntity)
Gets the id of the display component.
component: The specified component.
Returns: The id of the spcified display component.
Throws Autodesk.AutoCAD.Runtime.Exception: The exception is thrown if the id of the component is not found.