Autodesk.Aec.DatabaseServices.SectionSegmentCollection
Represents a collection of section vertex.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: This method is invalid for the SectionSegmentCollection got from Section2d.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.Count
Returns the number of SectionSegments available on this collection.
Returns: Returns the number of SectionSegments available on this collection.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.CopyTo(Autodesk.Aec.DatabaseServices.SectionSegment[],System.Int32)
Copies the collection to the array.
array: The SectionSegment array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: This method is invalid for the SectionSegmentCollection got from Section2d.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.Item(System.Int32)
Gets or sets the SectionSegment at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: This property is invalid for the SectionSegmentCollection got from Section2d.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.Add(Autodesk.Aec.DatabaseServices.SectionSegment)
Adds a SectionSegment to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.Contains(Autodesk.Aec.DatabaseServices.SectionSegment)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.IndexOf(Autodesk.Aec.DatabaseServices.SectionSegment)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.SectionSegment)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.Remove(Autodesk.Aec.DatabaseServices.SectionSegment)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.

Autodesk.Aec.DatabaseServices.SectionSegmentCollection.Clear
Removes all items from the collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.