Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData
Represents a grid assembly editable grid data.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for GridAssemblyEditableGridData.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.#ctor
Initializes a new instance of the GridAssemblyEditableGridData class.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.GridAssembly
Sets the grid assembly.
Remarks: This method transfers ownership of the object wrapped by the GridAssembly to the GridAssemblyEditableGridData.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.GridDivisionId
Gets or sets the grid division id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.AssignmentId
Gets or sets the assignment id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.CellExtents
Gets or sets the cell extents.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.Recalculate
Calculates all the data -- from the entity.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.CalculateNewEdgePositions
Calculates the edge position distances from the grid start point when the grid is being edited.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.CellId
Gets the cell id.
Returns: The cell id.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.XAxis
Gets the X axis.
Returns: The X axis.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.YAxis
Gets the Y axis.
Returns: The Y axis.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.XAxisLength
Gets the X axis length.
Returns: The X axis length.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.YAxisLength
Gets the Y axis length.
Returns: The Y axis length.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.HeightDirection
Gets the height direction.
Returns: The height direction.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.HalfHeightDirection
Gets the half height direction.
Returns: The half height direction.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.Height
Gets the height.
Returns: The height.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.HalfHeight
Gets the half height.
Returns: The half height.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.StartPoint
Gets the start point.
Returns: The start point.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.EndPoint
Gets the end point.
Returns: The end point.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.MidPoint
Gets the midpoint.
Returns: The midpoint.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.CenterPoint
Gets the center point.
Returns: The center point.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.GridAngle
Gets the grid angle.
Returns: The grid angle.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.GridRadius
Gets the grid radius.
Returns: The grid radius.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.IsReverse
Gets the reversed state.
Returns: true if reversed, false otherwise.
Remarks: On arc grids false means clockwise, true is counter-clockwise.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.StartOffset
Gets or sets the start offset.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.EndOffset
Gets or sets the end offset.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.EdgePositions
Gets the collection of edge positions.
Returns: The collection of edge positions.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.NewEdgePositions
Gets the collection of new edge positions.
Returns: The collection of new edge positions.
Remarks: A collection of new edge positions may be set by a call to CalculateNewEdgePositions(), SetEdgePositionAt(), or Recalculate().

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.EdgePositionAt(System.Int16)
Gets the edge position at the given index.
index: The index.
Returns: The edge position at the given index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if no positions were set.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.NewEdgePositionAt(System.Int16)
Gets the new edge position at the given index.
index: The index.
Returns: The new edge position at the given index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if no new positions were set.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.EdgePositionFromReferenceAtEdgeIndex(System.Int16)
Gets the edge position from reference at edge with given index.
index: The index.
Returns: The edge position from reference at edge with given index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.GridDivisionDirection
Gets the grid division direction.
Returns: The grid division direction.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.DivideByCount
Gets or sets the number of divisions of the grid.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if grid doesn't have fixed number of bays, or if numberDivisions less than or equal to zero.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.BaySize
Gets or sets the bay size.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if grid doesn't have fixed bay sizes, or if size less than or equal to zero.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.DistributionFlags
Gets or sets the distribution flags.
Returns: The distribution flags.
Remarks: For grids with fixed bay size.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.EdgeCount
Gets the edge count.
Returns: The edge count.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.NewEdgeCount
Gets the new edge count.
Returns: The new edge count.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.GetManualEdgeIndexAt(System.Int32)
Gets the manual edge index at the given index.
index: The given index.
Returns: The manual edge index at the given index. Returns -1 if given index is invalid.
Remarks: For manual grids.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.SetEdgePositionAt(System.Int16,System.Double)
Sets the position of the edge at the given index.
index: The index.
positionFromStart: The new position to be used.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Also sets the same position for the new positions collection. Throws exception if index is invalid.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.SetEdgePositionFromReferenceAtEdgeIndex(System.Int16,System.Double)
Sets the edge position from reference at edge with given index.
index: The index.
positionFromReference: The new position to be used.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: For manual grids. Also sets the same position for the new positions collection.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.Clone
Clones the wrapped object.

Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData.Dispose(System.Boolean)
Deletes the unmanaged object.
disposing: unused.
Returns: void.