Autodesk.Aec.DatabaseServices.OverrideCollection
Represents a collection of Override.

Autodesk.Aec.DatabaseServices.OverrideCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.OverrideCollection.Item(System.Int32)
Gets or sets the Override at the given index.
index: The index.

Autodesk.Aec.DatabaseServices.OverrideCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.OverrideCollection.Clear
Removes all items from the collection.

Autodesk.Aec.DatabaseServices.OverrideCollection.Count
Returns the number of Overrides available on this collection.
Returns: Returns the number of Overrides available on this collection.

Autodesk.Aec.DatabaseServices.OverrideCollection.Add(Autodesk.Aec.DatabaseServices.Override)
Adds the specified item to the collection.
value: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.DatabaseServices.OverrideCollection.#ctor(Autodesk.Aec.DatabaseServices.IOverrideOperation)
Initializes a new instance of the OverrideCollection class.