Autodesk.Aec.DatabaseServices.GridUv
Represents a grid UV, a bidimensional grid with nodes and cells.

Autodesk.Aec.DatabaseServices.GridUv.#ctor
Initializes a new instance of the GridUv class.

Autodesk.Aec.DatabaseServices.GridUv.GridType
Gets the grid type.
Returns: Returns the grid type.

Autodesk.Aec.DatabaseServices.GridUv.GetLayoutNodeLocation(System.Int32)
Gets layout node location for the node with given id.
nodeId: The node id.
Returns: Returns the layout node location.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.GetLayoutNodeCoordinateSystem(System.Int32)
Gets the layout node coordinate system for the given node id.
nodeId: The node id.
Returns: Returns the layout node coordinate system.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.GetLayoutCellProfile(System.Int32,Autodesk.AutoCAD.Geometry.Matrix3d@)
Gets profile at cell id.
cellId: The cell id.
toWcs: The coordinate system of the layout cell (if found).
Returns: The layout cell profile.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by the derived classes only.

Autodesk.Aec.DatabaseServices.GridUv.NodeCount
Gets the node count of the grid.
Returns: Returns the node count of the grid.

Autodesk.Aec.DatabaseServices.GridUv.GetLayoutGrid2dNodeAt(System.Int32)
Gets node at the index given.
index: The index.
Returns: Returns the LayoutGrid2dNode at the index given.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridUv.GetLayoutGrid2dNode(System.Int32)
Gets node that has the given id.
id: The node id.
Returns: Returns the node that has the given id, or null if not found.

Autodesk.Aec.DatabaseServices.GridUv.LayoutNodeIds
Gets a collection of node Ids - A node at each grid intersection exists.
Returns: Returns a collection of node Ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.CellCount
Gets the number of cells.
Returns: Returns the number of cells.

Autodesk.Aec.DatabaseServices.GridUv.GetLayoutGrid2dCellAt(System.Int32)
Gets the cell at the given index.
index: The index.
Returns: Returns the cell at the given index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridUv.GetLayoutGrid2dCell(System.Int32)
Gets the cell that has the given id.
id: The cell id.
Returns: Returns the cell that has the given id, or null if not found.

Autodesk.Aec.DatabaseServices.GridUv.LayoutCellIds
Gets a collection of layout cell ids. A layout cell exists in each closed region of the grid.
Returns: Returns a collection of layout cell ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.UAxisLength
Gets or sets the length of U Axis.
Returns: Returns the length of U Axis.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.VAxisLength
Gets or sets the length of V Axis.
Returns: Returns the length of V Axis.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.USpacing
Gets or sets the spacing along U Axis if mode is Repeat.
Returns: Returns the spacing along U Axis.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.VSpacing
Gets or sets the spacing along V Axis if mode is Repeat.
Returns: Returns the spacing along V Axis.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.UStartOffset
Gets or sets the offset from the U Axis to the start of the grid .
Returns: The offset distance.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.VStartOffset
Gets or sets the offset from V Axis to the start of the grid .
Returns: The offset distance.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.UEndOffset
Gets or sets the offset from end of U Axis to end grid.
Returns: The offset distance.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.VEndOffset
Gets or sets the offset from end of V Axis to end grid.
Returns: The offset distance.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.ULayoutMode
Gets or sets the layout mode of the U axis.
Returns: The layout mode.

Autodesk.Aec.DatabaseServices.GridUv.VLayoutMode
Gets or sets the layout mode of the V axis.
Returns: The layout mode.

Autodesk.Aec.DatabaseServices.GridUv.AppendGridColumn(System.Double)
Adds a node at every intersection of V param with passed in U param.
parameterU: The node.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.AppendGridRow(System.Double)
Adds a node at every intersection of U param with passed in V param.
parameterV: The node.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.MoveGridRow(System.Double,System.Double)
Moves all nodes at old V position to new V position.
oldParameter: Old V position.
newParameter: New V position.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.MoveGridColumn(System.Double,System.Double)
Moves all nodes at old U position to new U position.
oldParameter: Old U position.
newParameter: New U position.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.RemoveGridColumn(System.Double)
Remove all nodes that exist with u parameter.
parameterU: The u parameter.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.RemoveGridRow(System.Double)
Remove all nodes that exist with v parameter.
parameterV: The v parameter.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.AddNode(System.Double,System.Double)
Adds a single node at U and V position.
parameterU: U position.
parameterV: V position.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUv.UpdateParameters
Updates grid lines based on mode of each axis.
Remarks: Manual: Any manual nodes that do not fit on the grid are removed; SpaceEvenly: Node positions are spaced to fit new size of the grid; Repeat: Nodes are added or removed to fit inside current grid size.

Autodesk.Aec.DatabaseServices.GridUv.UParameters
Get parameters of grid lines along U Axis.
Returns: Collection of U parameters.

Autodesk.Aec.DatabaseServices.GridUv.VParameters
Get parameters of grid lines along V Axis.
Returns: Collection of V parameters.