Autodesk.Aec.Modeler.TorusSurface
Represents a tours surface.

Autodesk.Aec.Modeler.TorusSurface.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for Vertex.

Autodesk.Aec.Modeler.TorusSurface.#ctor
Initializes a new instance of the TorusSurface class.

Autodesk.Aec.Modeler.TorusSurface.#ctor(Autodesk.AutoCAD.Geometry.LineSegment3d,System.Double,System.Double,System.Int32,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the TorusSurface class using the specified line, radius, approx and body.
axis: The axis.
majRadius: The major radius.
minRadius: The minor radius.
majApprox: The major major approx.
minApprox: The minor approx.
body: The body.

Autodesk.Aec.Modeler.TorusSurface.Center
Gets the center point.
Returns: The center point.

Autodesk.Aec.Modeler.TorusSurface.MajorRadius
Gets the major radius.
Returns: The major radius.

Autodesk.Aec.Modeler.TorusSurface.MinorRadius
Gets the minor radius.
Returns: The minor radius.

Autodesk.Aec.Modeler.TorusSurface.MajorApprox
Gets the major approx.
Returns: The major approx.

Autodesk.Aec.Modeler.TorusSurface.MinorApprox
Gets the minor approx.
Returns: The minor approx.