Autodesk.Aec.DatabaseServices.CurveXMeasureToType
Defines identifiers that indicate measure to types.

Autodesk.Aec.DatabaseServices.CurveXMeasureToType.ToCenter
Measure to the center of the anchored object.

Autodesk.Aec.DatabaseServices.CurveXMeasureToType.ToStartEdge
Measure to the start edge of the anchored object.

Autodesk.Aec.DatabaseServices.CurveXMeasureToType.ToEndEdge
Measure to the end edge of the anchored object.