Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection
Represents a collection of MultiViewBlockViewDefinitions.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.Count
Returns the number of MultiViewBlockViewDefinitions available on this collection.
Returns: Returns the number of MultiViewBlockViewDefinitions available on this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.CopyTo(Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinition[],System.Int32)
Copies the collection to the array.
array: The MultiViewBlockViewDefinition array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.Item(System.Int32)
Gets or sets the MultiViewBlockViewDefinition at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.Add(Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinition)
Adds a MultiViewBlockViewDefinition to the collection.
item: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.Contains(Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinition)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.IndexOf(Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinition)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinition)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.Remove(Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinition)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewDefinitionCollection.Clear
Removes all items from the collection.