Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection
Represents a collection of custom grid segments.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.Count
Returns the number of GridCustomSegment available on this collection.
Returns: Returns the number of GridCustomSegment available on this collection.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.CopyTo(Autodesk.Aec.DatabaseServices.GridCustomSegment[],System.Int32)
Copies the collection to the array.
array: The GridCustomSegment array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.Item(System.Int32)
Gets or sets the interference at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.Add(Autodesk.Aec.DatabaseServices.GridCustomSegment)
Adds an interference to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.Contains(Autodesk.Aec.DatabaseServices.GridCustomSegment)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.IndexOf(Autodesk.Aec.DatabaseServices.GridCustomSegment)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.GridCustomSegment)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.Remove(Autodesk.Aec.DatabaseServices.GridCustomSegment)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridCustomSegmentCollection.FindById
Find a segment by its ID if it exists in the colelction. If not, it will throw an exception.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.