Autodesk.Aec.Geometry.CompoundCurve2dVertex
Represents a compound curve 2d vertex.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for AecGeCompCurve2dVertex.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.#ctor
Initializes a new instance of the CompoundCurve2dVertex class.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.CompoundCurve
Returns the CompoundCurve2d.
Returns: Returns the CompoundCurve2d.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.PreviousSegment
Returns the segment before this vertex.
Returns: Returns the segment before this vertex.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.NextSegment
Returns the segment after this vertex.
Returns: Returns the segment after this vertex.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.Point
Returns the location of the vertex.
Returns: Returns the location of the vertex.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.Clone
Clones the wrapped object.

Autodesk.Aec.Geometry.CompoundCurve2dVertex.DeleteUnmanagedObject()
Cleans up the wrapped object.