Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection
Represents a collection of nested grid interior edge components.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Count
Returns the number of NestedGridEdgeDefinition available on this collection.
Returns: Returns the number of NestedGridEdgeDefinition available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition[],System.Int32)
Copies the collection to the array.
array: The NestedGridEdgeDefinition array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Item(System.Int32)
Gets or sets the nested grid interior edge at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition)
Adds a nested grid interior edge to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkComponent)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Remove(System.Int16)
Removes the specified item from the collection.
id: The id of the item to remove.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInteriorEdgeComponentCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.