Autodesk.Aec.DatabaseServices.DictionarySection2dStyle
Represents a section 2D style.

Autodesk.Aec.DatabaseServices.DictionarySection2dStyle.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionarySection2dStyle class using the specified database.
database: The database.

Autodesk.Aec.DatabaseServices.DictionarySection2dStyle.GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets standard section 2D style.
database: The database.
Returns: The standard section 2D style.