Autodesk.Aec.Modeler.TransfType
TransfType enumeration.

Autodesk.Aec.Modeler.TransfType.RigidMotionTransf
RigidMotionTransf.

Autodesk.Aec.Modeler.TransfType.EqualScalingOrthoTransf
EqualScalingOrthoTransf.

Autodesk.Aec.Modeler.TransfType.NonOrthoTransf
NonOrthoTransf.

Autodesk.Aec.Modeler.TransfType.ProjectionTransf
ProjectionTransf.

Autodesk.Aec.Modeler.TransfType.UnknownTransf
UnknownTransf.