Autodesk.Aec.DatabaseServices.DictionaryMaskBlockDefinition
Represents a mask block definition dictionary.

Autodesk.Aec.DatabaseServices.DictionaryMaskBlockDefinition.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMaskBlockDefinition class using the specified database.
db: The drawing database.

Autodesk.Aec.DatabaseServices.DictionaryMaskBlockDefinition.GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the id of the standard mask block definition, which is always available, for the specified drawing database.
db: The drawing database.
Returns: Returns the object id of the standard mask block definition.