Autodesk.Aec.DatabaseServices.XReferenceSubCommandType
Represents x ref sub-command type.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.Attach
Attach.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.Bind
Bind.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.Path
Path.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.Detach
Detach.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.Overlay
Overlay.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.Reload
Reload.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.Unload
Unload.

Autodesk.Aec.DatabaseServices.XReferenceSubCommandType.NoSubCommand
NoSubCommand.