Autodesk.Aec.DatabaseServices.LayoutVolume
Represents a layout volume.

Autodesk.Aec.DatabaseServices.LayoutVolume.#ctor
Initializes a new instance of the LayoutVolume class.

Autodesk.Aec.DatabaseServices.LayoutVolume.VolumeId
Gets or sets the volume id.
Returns: Returns the volume id.