Autodesk.Aec.DatabaseServices.ClassificationTree
Represents a classification tree.

Autodesk.Aec.DatabaseServices.ClassificationTree.#ctor
Initializes a new instance of the ClassificationTree class.

Autodesk.Aec.DatabaseServices.ClassificationTree.SetClass(Autodesk.AutoCAD.Runtime.RXClass)
Set the RXClass for the tree.
rxClass: The RXClass.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.Id
Gets or sets the classification id.
Returns: Returns the classification id.

Autodesk.Aec.DatabaseServices.ClassificationTree.AddNode(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds a node by id.
idClassification: The classification id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.AddNode(System.String)
Adds a node by name.
name: The classification name.
Returns: Returns the classification id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.AddBranch(Autodesk.Aec.DatabaseServices.ClassificationTree)
Adds a branch.
branch: The branch.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.GetIdAt(System.Int32)
Gets the id at the specified index.
index: The index.
Returns: Returns the id at the specified index.

Autodesk.Aec.DatabaseServices.ClassificationTree.IsInDictionary(Autodesk.AutoCAD.DatabaseServices.DBObject)
Determines if the object is in the dictionary.
obj: The object.
Returns: Returns true if the object is in the dictionary.

Autodesk.Aec.DatabaseServices.ClassificationTree.IsInDictionary(Autodesk.AutoCAD.DatabaseServices.DBDictionary)
Determines if the dictionary is in the dictionary.
dbDictionary: The dictionary.
Returns: Returns true if the dictionary is in the dictionary.

Autodesk.Aec.DatabaseServices.ClassificationTree.SynchDictionary
Synchronizes the dictionary.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.RemoveFromDictionary
Removes this classification tree from the extension dictionary.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.AddNodeToParent(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Adds a node the specified parent.
idParent: The parent node.
name: The name of the classification.
Returns: Returns the id of the newly created classification.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: The name will be incremented if necessary to be unique in the tree.

Autodesk.Aec.DatabaseServices.ClassificationTree.AddBranch(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.ClassificationTree)
Adds the branch to the specified parent node.
idParent: The id of the parent node.
branch: The branch.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: All names will be incremented if necessary to be unique in the tree.

Autodesk.Aec.DatabaseServices.ClassificationTree.GetBranch(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the branch starting at the specified node.
idClassification: The classification id.
Returns: Returns the branch starting at the specified node.

Autodesk.Aec.DatabaseServices.ClassificationTree.GetBranch(System.String)
Gets the branch starting at the specified node.
name: The classification name.
Returns: Returns the branch starting at the specified node.

Autodesk.Aec.DatabaseServices.ClassificationTree.DeleteBranch(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Deletes the branch starting at the specified node.
idClassification: The classification id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.RemoveBranch(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the branch starting at the specified node.
idClassification: The classificaton id.
Returns: Returns the branch starting at the specified node.

Autodesk.Aec.DatabaseServices.ClassificationTree.MoveBranch(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Moves the branch from one parent to another.
from: The node to remove the branch from.
to: The node to add the branch to.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.CopyBranch(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Copies the branch from one parent to another.
from: The node to remove the branch from.
to: The node to add the branch to.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationTree.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determines if the tree contains the specified classification.
idClassification: The classification id.
Returns: Returns true if the tree contains the specified classification.

Autodesk.Aec.DatabaseServices.ClassificationTree.Rename(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Renames the specified classification.
idClassification: The classification id.
newName: The new name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.