Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection
Represents a collection of section vertex.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.Count
Returns the number of Section2dSegmentGroups available on this collection.
Returns: Returns the number of Section2dSegmentGroups available on this collection.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.CopyTo(Autodesk.Aec.DatabaseServices.Section2dSegmentGroup[],System.Int32)
Copies the collection to the array.
array: The Section2dSegmentGroup array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.Item(System.Int32)
Gets or sets the Section2dSegmentGroup at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.Add(Autodesk.Aec.DatabaseServices.Section2dSegmentGroup)
Adds a Section2dSegmentGroup to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.Contains(Autodesk.Aec.DatabaseServices.Section2dSegmentGroup)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.IndexOf(Autodesk.Aec.DatabaseServices.Section2dSegmentGroup)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.Section2dSegmentGroup)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.Remove(Autodesk.Aec.DatabaseServices.Section2dSegmentGroup)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroupCollection.Clear
Removes all items from the collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.