Autodesk.Aec.DatabaseServices.BaseCurveType
Base curve types for the GridAssemblyEditableGridData object.

Autodesk.Aec.DatabaseServices.BaseCurveType.Linear
Base curve is Linear.

Autodesk.Aec.DatabaseServices.BaseCurveType.Arc
Base curve is an Arc.

Autodesk.Aec.DatabaseServices.BaseCurveType.Referenced
Base curve is Referenced.