Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection
Represents a collection of DisplayThemeRuleBase.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.Item(System.Int32)
Gets or sets the DisplayThemeRuleBase at the given index.
index: The index.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.Clear
Removes all items from the collection.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.Count
Returns the number of DisplayThemeRules available on this collection.
Returns: Returns the number of DisplayThemeRules available on this collection.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.Add(Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.IndexOf(Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.Remove(Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.Contains(Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.DisplayThemeRuleCollection.CopyTo(Autodesk.Aec.DatabaseServices.DisplayThemeRuleBase[],System.Int32)
Copies the collection to the array.
array: The DisplayThemeRuleBase array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.