Autodesk.Aec.DatabaseServices.DistributionFlags
DistributionFlags enumeration.

Autodesk.Aec.DatabaseServices.DistributionFlags.DistributeEvenlyToAll
Distribution is evenly to all.

Autodesk.Aec.DatabaseServices.DistributionFlags.DistributeToFirst
Distributes from first.

Autodesk.Aec.DatabaseServices.DistributionFlags.DistributeToLast
Distributes from last.

Autodesk.Aec.DatabaseServices.DistributionFlags.DistributeToMiddle
Distributes from middle.

Autodesk.Aec.DatabaseServices.DistributionFlags.NeverExceedCellSize
Distribution never exceeds cell size.

Autodesk.Aec.DatabaseServices.DistributionFlags.MaintainAtLeastHalfCellSize
Distribution maintains at least half of the cell size.