Autodesk.Aec.DatabaseServices.NodeLoopType
NodeLoopType enumeration.

Autodesk.Aec.DatabaseServices.NodeLoopType.Void
Void node loop.

Autodesk.Aec.DatabaseServices.NodeLoopType.NonVoid
NonVoid node loop.