Autodesk.Aec.DatabaseServices.MaterialInformationLocation
DisplayRepresentationTypeName enumeration.

Autodesk.Aec.DatabaseServices.MaterialInformationLocation.MaterialFromObject
Material from object.

Autodesk.Aec.DatabaseServices.MaterialInformationLocation.MaterialFromStyle
Material from style.

Autodesk.Aec.DatabaseServices.MaterialInformationLocation.MaterialFromObjectOverride
Material from object override.