Autodesk.Aec.Geometry.NestedGridDivisionOverride
Represents a nested grid division override.

Autodesk.Aec.Geometry.NestedGridDivisionOverride.#ctor
Initializes a new instance of the NestedGridDivisionOverride class.

Autodesk.Aec.Geometry.NestedGridDivisionOverride.GridAssignmentId
Gets or sets the grid assignment id.
Returns: The grid assignment id.

Autodesk.Aec.Geometry.NestedGridDivisionOverride.DivisionDefinitionId
Gets or sets the division definition id.
Returns: The division definition id.

Autodesk.Aec.Geometry.NestedGridDivisionOverride.IsStyleBased
Gets or sets whether this override is style based.
Returns: True to indicate style based, or false otherwise.