Autodesk.Aec.DatabaseServices.DatabaseDataAecBase
Represents a Database Data of AecBase.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.#ctor
Initializes a new instance of the DatabaseDataAecBase class.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ObjectRelationGraph
Gets the object relation graph.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DisplayRepresentationManager
Gets the display representation manager.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.CachedVariableId
Gets or sets the cached variable id.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.CachedLayerZeroId
Gets the cached layer zero id.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.AppendCopiedObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Append copied object6.
sourceId: The source object id.
destinationId: The destination object id.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DeepClonedSet
Gets the deep cloned set.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.LongTransactionSet
Gets the long transaction set.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.GetNestedWblockCloneDictionary(System.String)
Get nested wblock clone dictionary.
mainLevelDictionary: Main level dictionary.
Returns: The nested wblock clone dictionary.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.AddNestedWblockCloneDictionary(System.String,Autodesk.AutoCAD.DatabaseServices.DBDictionary)
Add nested wblock clone dictionary.
mainLevelDictionary: Main level dictionary.
destinationDictionary: Destination dictionary.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.RemoveNestedWblockCloneDictionary(System.String)
Remove nested wblock clone dictionary.
mainLevelDictionary: Main level dictionary.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ReferenceEditPostUpdateEcsSet
Gets the reference edit post update set.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.LayoutCopyHandPurgeDictionaryIds
Gets the layout copy hand purge dictionary ids.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.LayoutCopyDoPostPurge
Layout copy do post purge.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DeepCloneIsActive
Gets if deep clone is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DxfInIsActive
Gets if dxf in is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DxfOutIsActive
Gets if dxf out is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.WblockIsActive
Gets if wblock is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.FastWblockIsActive
Gets if fast wblock is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.InsertIsActive
Gets if insert is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.LayoutCopyIsActive
Gets if layout copy is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.CloneToSameDatabaseActive
Gets if clone to same database is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.CloningMixedVersionOfObjects
Gets if cloning mixed version of objects.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DwgSaveIsActive
Gets if dwg save is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DwgReadIsActive
Gets if dwg read is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DidDictionaryAuditPass1
Get if did dictionary audit pass 1.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DidDictionaryAuditPass2
Gets if did dictionary autit pass 2.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.RecoverActive
Gets if recover is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ResetAuditFlags
Reset audit flags.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DoDictionaryAuditHack(Autodesk.AutoCAD.DatabaseServices.AuditInfo)
Do dictionary audit hack.
info: The audit info.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DetectedMunichStairDisplayProperties
The stair calculator was overloaded in the Munich product and had a different rule for calculating the stair values. To successfully upgrade R2 drawings we need to determine from a drawing if it has been created by Munich or Mannheim.  The way we do this is to check if we could find a display property from the Munich Product within this database, this is probably as close as we can get to determine this.
Returns: Specify whether detect any display properties.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.PartialOpenVetoed
Checks whether partial open vetoed.
Returns: Specify whether partial open vetoed.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DxfInFieldsTriggered
Checks whether Dxf In fields triggered.
Returns: Specify whether Dxf In fields triggered.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DwgInFieldsTriggered
Checks whether Dwg In fields triggered.
Returns: Specify whether Dwg In fields triggered.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.InitDwgCalled
Checks whether initializing Dwg is called.
Returns: Specify whether initializing Dwg is called.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.PostProcessDictionaryMergeInfo
Gets post process dictionary merge information.
Returns: Post process dictionary merge information.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ResetPostProcessDictionaryMergeInfo
Resets post process dictionary merge information.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.StyleManagerCloningActive
Checks whether style manager cloning is active.
Returns: Specify whether style manager cloning is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.InplaceEditorMap
Gets inplace editor map.
Returns: The output inplace editor map.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.AddToEndDeepCloneMvBlockProcessingArray(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds to end deep clone MvBlock processing array.
idMvBlockReference: The given id MvBlock reference id.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ResetEndDeepCloneMvBlockProcessingArray
Resets end deep clone MvBlock processing array.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.AddToEndDeepCloneUpdateViewBlockArray(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds to end deep clone update view block array.
idMvBlockReference: The given MvBlock reference id.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ResetEndDeepCloneUpdateViewBlockArray
Resets end deep clone update view block array.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.LastXrefSubcommandActivity
Gets or sets last Xref subcommand activity.
Returns: Last Xref subcommand activity.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.XrefSubcommandType
Gets or sets Xref subcommand type.
Returns: Xref subcommand type.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.XreferenceIds
Gets Xreference Ids.
Returns: Gets Xreference Ids.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.RestoreInsUnitsOnBTRAfterInsert
Gets or sets restore ins units on BTR after inserting.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.InsertedBlockName
Gets or sets inserted block name.
Returns: Gets inserted block name.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.AppendPreKyotoSectionElevationLinesRequiringUpdate(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Appends pre kyoto section elevation lines requiring update.
id: The given object id.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.PreKyotoSectionElevationLinesRequiringUpdate
Gets pre Kyoto section elevation lines requiring update.
Returns: The objects.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.RemoveAllKyotoSectionElevationLinesRequiringUpdate
Removes all Kyoto section elevation lines requiring update.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.RemoveFromKyotoSectionElevationLinesRequiringUpdate(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes from Kyoto section elevation lines requiring update.
id: The given object id.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.IsGsMarkerHighlightingEnabled
Checks whether GsMarker highlighting is enabled.
Returns: Specify whether GsMarker highlighting is enabled.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.IsGsMarkerUnhighlightingEnabled
Checks whether GsMarker Unhighlighting is enabled.
Returns: Specify whether GsMarker Unhighlighting is enabled.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.IsGsMarkerComponentSelectionActive
Checks whether GsMarker component selection is active.
Returns: Specify whether GsMarker component selection is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.SetGsMarkerHighlightingEnabled(System.Boolean)
Sets whether GsMarker highlighting is enabled.
enableHighlighting: Sets whether GsMarker highlighting is enabled.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.SetGsMarkerUnhighlightingEnabled(System.Boolean)
Sets whether GsMarker unhighlighting is enabled.
enableHighlighting: Sets whether GsMarker unhighlighting is enabled.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.SetGsMarkerComponentSelectionActive(System.Boolean)
Sets whether GsMarker component selection is active.
componentSelectionActive: Sets whether GsMarker component selection is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.HidingObjectsIsActive
Gets or sets whether hiding objects is active.
Returns: Gets whether hiding objects is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.UnhidingObjectsIsActive
Gets or sets whether unhiding objects is active.
Returns: Gets whether unhiding objects is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.PopAnnotationScaleFromStream
Pop annotation scale from stream.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.NotifySpatialTreeMessageObject
Notify spatial tree message object.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ReferenceEditCommandActive
Gets or sets whether reference edit command is active.
Returns: Gets whether reference edit command is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.ReferenceCloseCommandActive
Gets or sets whether reference close command is active.
Returns: Gets whether reference close command is active.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DisableObjectUpdateDuringModify
Gets or sets whether disable object update during modify.
Returns: Gets whether disable object update during modify.

Autodesk.Aec.DatabaseServices.DatabaseDataAecBase.DelaySpaceUpdateEnabled
Gets or sets whether delay space update is enabled.
Returns: Gets whether delay space update is enabled.