Autodesk.Aec.ProductInformation
The Product Information module contains miscellaneous constants.

Autodesk.Aec.ProductInformation.VersionId
Version Id of the product.

Autodesk.Aec.ProductInformation.VersionIdAsDouble
Version Id of the product (double format).  Note that the data here is stored as a double, so a version of 6.0 would be stored as the value 6 (not always correct, since it may really be 6.0). If you want to true version (ie. for the registry, consider the VersionIdAsString API.

Autodesk.Aec.ProductInformation.VersionIdAsString
Version Id of the product (string format). This version is useful for registry versioning since you may want "6.0" instead of just 6 as VersionIdAsDouble provides.

Autodesk.Aec.ProductInformation.ObjectMajor
Major version number for objects.

Autodesk.Aec.ProductInformation.ObjectMinor
Minor version number for objects.

Autodesk.Aec.ProductInformation.AutoCADVersion
AutoCAD version number for this release.