Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection
Represents a collection of display representation object id.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.Item(System.Int32)
Gets or sets the object id at the given index.
index: The index.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.Clear
Removes all items from the collection.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.Count
Returns the number of display representation ids available on this collection.
Returns: Returns the number of display representation ids available on this collection.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.Add(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determines the index of the specified item.
item: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
item: The item to insert.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the specified item from the collection.
item: The item to remove.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determines if the collection contains the specified item.
item: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.DisplayRepresentationIdCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.ObjectId[],System.Int32)
Copies the collection to the array.
array: The object id array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.