Autodesk.Aec.DatabaseServices.ADTDwgVersion
Represents ADT dwg version.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.NoADTObjects
NoADTObjects.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.R1
R1.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.R2
R2.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.R3
R3.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.R4
R4.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.R5
R5.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.R6
R6.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.Current
Current.

Autodesk.Aec.DatabaseServices.ADTDwgVersion.Future
Future.