Autodesk.Aec.DatabaseServices.LayoutGrid3dCell
Represents a layout grid 3d cell.

Autodesk.Aec.DatabaseServices.LayoutGrid3dCell.#ctor
Initializes a new instance of the LayoutGrid3dCell class.

Autodesk.Aec.DatabaseServices.LayoutGrid3dCell.WIndex
Gets or sets the index on the W axis.
Returns: Returns the index on the W axis.

Autodesk.Aec.DatabaseServices.LayoutGrid3dCell.Plane
Gets or sets the plane type.
Returns: Returns the plane type.