Autodesk.Aec.DatabaseServices.LayoutCell
Represents a layout cell.

Autodesk.Aec.DatabaseServices.LayoutCell.#ctor
Initializes a new instance of the LayoutCell class.

Autodesk.Aec.DatabaseServices.LayoutCell.CellId
Gets or sets the cell id.
Returns: Returns the cell id.