Autodesk.Aec.DatabaseServices.DictionaryPolygonStyle
Represents a polygon style dictionary.

Autodesk.Aec.DatabaseServices.DictionaryPolygonStyle.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryPolygonStyle class using the specified database.
db: The database.

Autodesk.Aec.DatabaseServices.DictionaryPolygonStyle.GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard style id.
db: The database.
Returns: Returns the standard style id.