Autodesk.Aec.Modeler.FaceCollection
Represents a collection of faces.

Autodesk.Aec.Modeler.FaceCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.FaceCollection.Item(System.Int32)
Gets or sets the Face at the given index.
index: The index.

Autodesk.Aec.Modeler.FaceCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.FaceCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.FaceCollection.Count
Returns the number of Faces available on this collection.
Returns: Returns the number of Faces available on this collection.

Autodesk.Aec.Modeler.FaceCollection.Add(Autodesk.Aec.Modeler.Face)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.FaceCollection.IndexOf(Autodesk.Aec.Modeler.Face)
Determines the index of the specified item.
item: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.FaceCollection.Insert(System.Int32,Autodesk.Aec.Modeler.Face)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
item: The item to insert.

Autodesk.Aec.Modeler.FaceCollection.Remove(Autodesk.Aec.Modeler.Face)
Removes the specified item from the collection.
item: The item to remove.

Autodesk.Aec.Modeler.FaceCollection.Contains(Autodesk.Aec.Modeler.Face)
Determines if the collection contains the specified item.
item: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.FaceCollection.CopyTo(Autodesk.Aec.Modeler.Face[],System.Int32)
Copies the collection to the array.
array: The Face array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.