Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection
Represents a collection of section vertex.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.Count
Returns the number of Section2dHatchRegions available on this collection.
Returns: Returns the number of Section2dHatchRegions available on this collection.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.CopyTo(Autodesk.Aec.DatabaseServices.Section2dHatchRegion[],System.Int32)
Copies the collection to the array.
array: The Section2dHatchRegion array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.Item(System.Int32)
Gets or sets the Section2dHatchRegion at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.Add(Autodesk.Aec.DatabaseServices.Section2dHatchRegion)
Adds a Section2dHatchRegion to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.Contains(Autodesk.Aec.DatabaseServices.Section2dHatchRegion)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.IndexOf(Autodesk.Aec.DatabaseServices.Section2dHatchRegion)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.Section2dHatchRegion)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.Remove(Autodesk.Aec.DatabaseServices.Section2dHatchRegion)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implmented.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2dHatchRegionCollection.Clear
Removes all items from the collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.