Autodesk.Aec.DatabaseServices.Geo
Represents a geo.

Autodesk.Aec.DatabaseServices.Geo.Location
Gets or sets the location.
Returns: Returns the location.

Autodesk.Aec.DatabaseServices.Geo.Direction
Gets or sets the direction.
Returns: Returns the direction.

Autodesk.Aec.DatabaseServices.Geo.Rotation
Gets or sets the rotation.
Returns: Returns the rotation.

Autodesk.Aec.DatabaseServices.Geo.Normal
Gets or sets the normal.
Returns: Returns the normal.

Autodesk.Aec.DatabaseServices.Geo.XDir
Gets the X direction.
Returns: Returns the X direction.

Autodesk.Aec.DatabaseServices.Geo.YDir
Gets the Y direction.
Returns: Returns the Y direction.

Autodesk.Aec.DatabaseServices.Geo.ZDir
Gets the Z direction.
Returns: Returns the Z direction.

Autodesk.Aec.DatabaseServices.Geo.GeoEcs
Gets or sets the ECS of the Geo.
Returns: Returns the ECS of the Geo.

Autodesk.Aec.DatabaseServices.Geo.UpdateGeoEcs(System.Boolean)
Updates the ECS of the geo.
forceUpdate: false to update only if the dirty flag is set.

Autodesk.Aec.DatabaseServices.Geo.GeoEcsIsDirty
Gets or sets the dirty value for the ECS of the Geo.
Returns: Returns the dirty value for the ECS of the Geo.

Autodesk.Aec.DatabaseServices.Geo.TranslateBy(Autodesk.AutoCAD.Geometry.Vector3d)
Translates the geo by the specified offset.
offset: The offset.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Geo.MoveInXY(Autodesk.AutoCAD.Geometry.Vector3d)
Moves the geo in X and Y.
offset: The offset.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Geo.MoveInZ(System.Double)
Moves the geo in Z.
distance: The distance.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Geo.OnGeoEcsModified(Autodesk.AutoCAD.Geometry.Matrix3d)
Called when the ECS of the geo is modified.
previousEcs: The previous ECS.

Autodesk.Aec.DatabaseServices.Geo.CanBeAnchored
Gets the value that determines if the geo can be anchored.
Returns: Returns the value that determines if the geo can be anchored.

Autodesk.Aec.DatabaseServices.Geo.AnchorId
Gets the AnchorId.
Returns: Returns the AnchorId.

Autodesk.Aec.DatabaseServices.Geo.SetAnchor(Autodesk.Aec.DatabaseServices.Anchor)
Takes ownership of a new Anchor object and adds it to the database.
newAnchor: The anchor.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Geo.UpdateFromAnchor(Autodesk.Aec.DatabaseServices.Anchor)
Updates the geo position from the specified anchor.
anchor: The anchor.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Geo.ReleaseAnchor
Releases the anchor.

Autodesk.Aec.DatabaseServices.Geo.IsAnchored
Gets whther the geo derived object is anchored.
Returns: Returns the value that determines if the geo is anchored.