Autodesk.Aec.Geometry.ProfileExtrusionDirection
ProfileExtrusionDirection enumeration.

Autodesk.Aec.Geometry.ProfileExtrusionDirection.ExtrudeInXDir
Extrude in the X direction.

Autodesk.Aec.Geometry.ProfileExtrusionDirection.ExtrudeInYDir
Extrude in the Y direction.

Autodesk.Aec.Geometry.ProfileExtrusionDirection.ExtrudeInZDir
Extrude in the Z direction.