Autodesk.Aec.DatabaseServices.StreamEntityType
Stream entity type enumeration.

Autodesk.Aec.DatabaseServices.StreamEntityType.Pline
Pline entity type.

Autodesk.Aec.DatabaseServices.StreamEntityType.Line
Line entity type.

Autodesk.Aec.DatabaseServices.StreamEntityType.CircularArc
CircularArc entity type.

Autodesk.Aec.DatabaseServices.StreamEntityType.EllipticalArc
EllipticalArc entity type.

Autodesk.Aec.DatabaseServices.StreamEntityType.Face
Face entity type.