Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride
Represents a nested grid edge profile override.

Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride.#ctor
Initializes a new instance of the NestedGridEdgeProfileOverride class.

Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride.CopyFrom(Autodesk.AutoCAD.Runtime.RXObject)
Copies another override to this override.
other: Input the other override.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride.EdgePath
Gets or sets the edge path.
Returns: The edge path.

Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride.ProfileId
Gets or sets the edge profile id.
Returns: The edge profile id.

Autodesk.Aec.Geometry.NestedGridEdgeProfileOverride.IsStyleBased
Gets or sets whether this override is style based.
Returns: True to indicate style based, or false otherwise.