Autodesk.Aec.DatabaseServices.TextNote
Represents a test note.

Autodesk.Aec.DatabaseServices.TextNote.#ctor
Initializes a new instance of the TextNote class.

Autodesk.Aec.DatabaseServices.TextNote.Note
Gets or sets the note.
Returns: Returns the note.

Autodesk.Aec.DatabaseServices.TextNote.GetStandardNote(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the standard note.
instance: The object instance.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.TextNote.SetStandardNote(Autodesk.AutoCAD.DatabaseServices.DBObject,System.String)
Sets the standard note.
instance: The object instance.
note: The note.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.TextNote.ExtensionDictionaryName
Get the name of extension dictionary.
Returns: The name of extension dictionary.