Autodesk.Aec.DatabaseServices.GridAssemblyInterference
Represents a grid assembly interference.

Autodesk.Aec.DatabaseServices.GridAssemblyInterference.#ctor
Initializes a new instance of the GridAssemblyinterference class.

Autodesk.Aec.DatabaseServices.GridAssemblyInterference.EntityId
Gets or sets the object Id of the interference entity.
Returns: Return the object Id of the interference entity.

Autodesk.Aec.DatabaseServices.GridAssemblyInterference.AppliesToFlags
Gets or sets the interference flags.
Returns: Returns the interference flags.