Autodesk.Aec.DatabaseServices.GridType
Grid types.

Autodesk.Aec.DatabaseServices.GridType.UVRectangular
Bidimensional rectangular grid with grid lines along U and V axis.

Autodesk.Aec.DatabaseServices.GridType.UVRadial
Bidimensional radial grid with grid lines along U and V axis.

Autodesk.Aec.DatabaseServices.GridType.UVWRectangular
Tridimensional rectangular grid with gridlines along U, V, and W axis.

Autodesk.Aec.DatabaseServices.GridType.UVCustom
Bidimensional custom grid with grid lines along U and V axis.