Autodesk.Aec.DatabaseServices.ViewDirection
ViewDirection enumeration.

Autodesk.Aec.DatabaseServices.ViewDirection.Top
Plan view.

Autodesk.Aec.DatabaseServices.ViewDirection.Bottom
Bottom view.

Autodesk.Aec.DatabaseServices.ViewDirection.Front
Front view.

Autodesk.Aec.DatabaseServices.ViewDirection.Back
Back view.

Autodesk.Aec.DatabaseServices.ViewDirection.Left
Left view.

Autodesk.Aec.DatabaseServices.ViewDirection.Right
Right view.

Autodesk.Aec.DatabaseServices.ViewDirection.Other
Isometric view.