Autodesk.Aec.Modeler.BodyCollection
Represents a collection of Body objects.

Autodesk.Aec.Modeler.BodyCollection.#ctor
Initializes a new instance of the bodycollection class.

Autodesk.Aec.Modeler.BodyCollection.CopyTo(Autodesk.Aec.Modeler.Body[],System.Int32)
Copies the collection to the array.
array: The Body array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.BodyCollection.Item(System.Int32)
Gets or sets the Body at the given index.
index: The index.

Autodesk.Aec.Modeler.BodyCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.BodyCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.BodyCollection.Count
Returns the number of Bodies available on this collection.
Returns: Returns the number of Bodies available on this collection.

Autodesk.Aec.Modeler.BodyCollection.Add(Autodesk.Aec.Modeler.Body)
Adds the specified item to the collection.
value: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.Modeler.BodyCollection.IndexOf(Autodesk.Aec.Modeler.Body)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.BodyCollection.Insert(System.Int32,Autodesk.Aec.Modeler.Body)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.Modeler.BodyCollection.Remove(Autodesk.Aec.Modeler.Body)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.Modeler.BodyCollection.Contains(Autodesk.Aec.Modeler.Body)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.BodyCollection.Clear
Removes all items from the collection.