Autodesk.Aec.DatabaseServices.ClipVolumeResult
Represents a result of clip volume..

Autodesk.Aec.DatabaseServices.ClipVolumeResult.#ctor
Initializes a new instance of the ClipVolumeResult class.

Autodesk.Aec.DatabaseServices.ClipVolumeResult.ClipVolumeId
Gets or sets the ObjectId of the ClipVolume of this clip volume result.
Returns: The ObjectId of the ClipVolume of this clip volume result.