Autodesk.Aec.DatabaseServices.GridAssemblyComponentSet
Represents a grid assembly component set.

Autodesk.Aec.DatabaseServices.GridAssemblyComponentSet.#ctor
Initializes a new instance of the GridAssemblyComponentSet class.

Autodesk.Aec.DatabaseServices.GridAssemblyComponentSet.IncrementComponentDefinitionId
Increments the component definition id, and returns the new value.
Returns: The next component definition id.