Autodesk.Aec.DatabaseServices.ConstraintUtility.EdgeVertexType
Edge vertex type.

Autodesk.Aec.DatabaseServices.ConstraintUtility.EdgeVertexType.StartVertex
Start vertex.

Autodesk.Aec.DatabaseServices.ConstraintUtility.EdgeVertexType.EndVertex
End vertex.

Autodesk.Aec.DatabaseServices.ConstraintUtility.EdgeVertexType.MidVertex
Middle vertex.

Autodesk.Aec.DatabaseServices.ConstraintUtility.EdgeVertexType.CenterVertex
Center vertex.