Autodesk.Aec.DatabaseServices.MaskBlockReference
Represents a mask block reference.

Autodesk.Aec.DatabaseServices.MaskBlockReference.#ctor
Initializes a new instance of the MaskBlockReference class.

Autodesk.Aec.DatabaseServices.MaskBlockReference.CutProfile
Get the cut profile of this mask block reference.
Returns: The cut profile of this mask block reference.