Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstanceCollection
Represents a collection of multiview block view instances.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstanceCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstanceCollection.Count
Returns the number of MultiViewBlockViewInstances available on this collection.
Returns: Returns the number of MultiViewBlockViewInstances available on this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstanceCollection.CopyTo(Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance[],System.Int32)
Copies the collection to the array.
array: The MultiViewBlockViewInstance array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstanceCollection.Item(System.Int32)
Returns the MultiViewBlockViewInstance at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.