Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection
Represents a collection of nested grid cell assignments.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Count
Returns the number of NestedGridCellAssignment available on this collection.
Returns: Returns the number of NestedGridCellAssignment available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridCellAssignment[],System.Int32)
Copies the collection to the array.
array: The NestedGridCellAssignment array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Item(System.Int32)
Gets or sets the nested grid cell assignment at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridCellAssignment)
Adds a nested grid cell assignment to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridCellAssignment)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridCellAssignment)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridCellAssignment)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkAssembly)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Default
Gets or sets the default cell assignment.
Returns: The default cell assignment, or null if none was set.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridCellAssignmentCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.