Autodesk.Aec.UnitStatus
Status codes for the Unit classes.

Autodesk.Aec.UnitStatus.Ok
Ok.

Autodesk.Aec.UnitStatus.TypesNotCompatible
Types not compatible.

Autodesk.Aec.UnitStatus.InvalidUnit
Invalid unit.

Autodesk.Aec.UnitStatus.Overflow
Overflow.

Autodesk.Aec.UnitStatus.Underflow
Underflow.

Autodesk.Aec.UnitStatus.CustomConversion
Custom conversion.