Autodesk.Aec.DatabaseServices.GraphicsStorageFace.Points
Gets the points of the face in this storage.
Returns: The points of the face.

Autodesk.Aec.DatabaseServices.GraphicsStorageFace.EdgeVisibility
Gets the visibility of the edges of the face.
Returns: The visibility of the edges.

Autodesk.Aec.DatabaseServices.GraphicsStorageFace
Represents a graphics storage that stores face data.