Autodesk.Aec.DatabaseServices.LayoutTool
Represents a layout tool.

Autodesk.Aec.DatabaseServices.LayoutTool.#ctor
Initializes a new instance of the LayoutTool class.

Autodesk.Aec.DatabaseServices.LayoutTool.LayoutNodeIds
Gets a collection of node ids associated with this LayoutTool.
Returns: Returns a collection of node ids associated with this LayoutTool.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by the derived classes only.

Autodesk.Aec.DatabaseServices.LayoutTool.GetClosestLayoutNode(Autodesk.AutoCAD.Geometry.Point3d)
Gets the closest layout node to the location given.
location: The location.
Returns: Returns the closest layout node.

Autodesk.Aec.DatabaseServices.LayoutTool.GetLayoutNodeLocation(System.Int32)
Gets layout node location for the node with given id.
nodeId: The node id.
Returns: Returns the layout node location.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by the derived classes only.

Autodesk.Aec.DatabaseServices.LayoutTool.GetLayoutNodeCoordinateSystem(System.Int32)
Gets the layout node coordinate system for the given node id.
nodeId: The node id.
Returns: Returns the layout node coordinate system.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Should be handled by the derived classes only.