Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment
Represents a nested grid edge assignment.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.#ctor
Initializes a new instance of the NestedGridEdgeAssignment class.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.Name
Gets or sets the name of the nested grid edge assignment.
Returns: A string with the name of the nested grid edge assignment.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.EdgeSpecifier
Gets or sets the edge specifier.
Returns: The edge specifier or null if not found.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.Id
Gets or sets the id of the nested grid edge assignment.
Returns: Returns the id of the nested grid edge assignment.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.IsVoid
Gets the memory state of the nested grid edge assignment.
Returns: true if it allocated, false otherwise.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.SetVoid
Sets the memory state of the nested grid edge assignment to null.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.EdgeDefinitionId
Gets or sets the edge definition id.
Returns: The edge definition id.

Autodesk.Aec.DatabaseServices.NestedGridEdgeAssignment.ParentGrid
Gets the parent grid.
Returns: The parent grid, or null if not found.