Autodesk.Aec.DatabaseServices.DisplayComponent
Represents a display component base class.

Autodesk.Aec.DatabaseServices.DisplayComponent.#ctor
Initializes a new instance of the DisplayComponent class.

Autodesk.Aec.DatabaseServices.DisplayComponent.IsApplicable
Check if it is applicable.
Returns: True if it is applicable, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayComponent.IsInherited
Gets or sets if it is inherited.
Returns: True if it is inherited, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayComponent.Reset
Resets.