Autodesk.Aec.Modeler.HiddenLinesDisplay
HiddenLinesDisplay enumeration.

Autodesk.Aec.Modeler.HiddenLinesDisplay.HiddenLinesInvisible
HiddenLinesInvisible.

Autodesk.Aec.Modeler.HiddenLinesDisplay.HiddenLinesDashed
HiddenLinesDashed.

Autodesk.Aec.Modeler.HiddenLinesDisplay.HiddenLinesVisible
HiddenLinesVisible.