Autodesk.Aec.Modeler.SurfaceCollection
Represents a collection of surfaces.

Autodesk.Aec.Modeler.SurfaceCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.SurfaceCollection.Item(System.Int32)
Gets or sets the Surface at the given index.
index: The index.

Autodesk.Aec.Modeler.SurfaceCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.SurfaceCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.SurfaceCollection.Count
Returns the number of Surfaces available on this collection.
Returns: Returns the number of Surfaces available on this collection.

Autodesk.Aec.Modeler.SurfaceCollection.Add(Autodesk.Aec.Modeler.Surface)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.SurfaceCollection.IndexOf(Autodesk.Aec.Modeler.Surface)
Determines the index of the specified item.
item: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.SurfaceCollection.Insert(System.Int32,Autodesk.Aec.Modeler.Surface)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
item: The item to insert.

Autodesk.Aec.Modeler.SurfaceCollection.Remove(Autodesk.Aec.Modeler.Surface)
Removes the specified item from the collection.
item: The item to remove.

Autodesk.Aec.Modeler.SurfaceCollection.Contains(Autodesk.Aec.Modeler.Surface)
Determines if the collection contains the specified item.
item: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.SurfaceCollection.CopyTo(Autodesk.Aec.Modeler.Surface[],System.Int32)
Copies the collection to the array.
array: The Surface array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.