Autodesk.Aec.DatabaseServices.AnchorEntityToEntity
Represents an entity to a entity anchor.

Autodesk.Aec.DatabaseServices.AnchorEntityToEntity.#ctor
Initializes a new instance of the AnchorEntityToEntity class.

Autodesk.Aec.DatabaseServices.AnchorEntityToEntity.ReferencedEntityId
Gets or sets the Id of the referenced entity.
Returns: Returns the Id of the referenced entity.

Autodesk.Aec.DatabaseServices.AnchorEntityToEntity.SetReferencedEntity(Autodesk.Aec.DatabaseServices.Geo)
Sets the referenced entity.
geo: The referenced entity.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorEntityToEntity.SetReferencedEntityOldEcs(Autodesk.AutoCAD.Geometry.Matrix3d)
Sets the Ecs for the referenced entity.
mat: The Ecs matrix.