Autodesk.Aec.Modeler.VertexSurfaceData
Represents a vertex surface data.

Autodesk.Aec.Modeler.VertexSurfaceData.#ctor
Initializes a new instance of the VertexSurfaceData class.

Autodesk.Aec.Modeler.VertexSurfaceData.#ctor(Autodesk.Aec.Modeler.Edge)
Initializes a new instance of the VertexSurfaceData class using the specified edge.
edge: The edge.

Autodesk.Aec.Modeler.VertexSurfaceData.Surface
Gets or sets the surface.
Returns: The surface.

Autodesk.Aec.Modeler.VertexSurfaceData.Normal
Gets the normal vector.
Returns: The normal vector.

Autodesk.Aec.Modeler.VertexSurfaceData.Transform(Autodesk.AutoCAD.Geometry.Matrix3d)
Transfer from a matrix.
matrix: The matrix.