Autodesk.Aec.DatabaseServices.ShapeType
Shape types for the Mass Element object.

Autodesk.Aec.DatabaseServices.ShapeType.Unknown
Unknown.

Autodesk.Aec.DatabaseServices.ShapeType.Error
Error.

Autodesk.Aec.DatabaseServices.ShapeType.Box
Box.

Autodesk.Aec.DatabaseServices.ShapeType.Arch
Arch.

Autodesk.Aec.DatabaseServices.ShapeType.BarrelVault
Barrel vault.

Autodesk.Aec.DatabaseServices.ShapeType.Doric
Doric column.

Autodesk.Aec.DatabaseServices.ShapeType.Cone
Cone.

Autodesk.Aec.DatabaseServices.ShapeType.Cylinder
Cylinder.

Autodesk.Aec.DatabaseServices.ShapeType.Dome
Dome.

Autodesk.Aec.DatabaseServices.ShapeType.Gable
Gable.

Autodesk.Aec.DatabaseServices.ShapeType.IsoscelesTriangle
Isosceles triangle.

Autodesk.Aec.DatabaseServices.ShapeType.RightTriangle
Right triangle.

Autodesk.Aec.DatabaseServices.ShapeType.Pyramid
Pyramid.

Autodesk.Aec.DatabaseServices.ShapeType.Sphere
Sphere.

Autodesk.Aec.DatabaseServices.ShapeType.Extrusion
Extrusion of a profile.

Autodesk.Aec.DatabaseServices.ShapeType.Revolution
Revolution of a profile.

Autodesk.Aec.DatabaseServices.ShapeType.BoundaryRepresentation
Boundary representation.