Autodesk.Aec.DatabaseServices.YAlignment
Alignment type for Nested Grid Infill Definition.

Autodesk.Aec.DatabaseServices.YAlignment.Centered
Align centered.

Autodesk.Aec.DatabaseServices.YAlignment.FrontFlush
Align front.

Autodesk.Aec.DatabaseServices.YAlignment.BackFlush
Align back.