Autodesk.Aec.DatabaseServices.Section2dHatchRegion
Represents a section 2d hatch region.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.#ctor
Initializes a new instance of the Section2dHatchRegion class.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.HatchProfile
Gets or sets the hatch profile.
Returns: The hatch profile.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.HasMaterialFilter
Gets whether the hatch has material filter.
Returns: true the hatch has material filter, or false otherwise.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.MaterialFilter
Sets the material filter.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.Id
Gets the hatch region id.
Returns: The id.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.AppliesToSurfaceHatch
Gets or sets whether this applies to surface hatch.
Returns: true if this applies to surface hatch, or false otherwise.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.AppliesToSectionHatch
Gets or sets whether this applies to section hatch.
Returns: true if this applies to section hatch, or false otherwise.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.AppliesToMaterialLineWork
Gets or sets whether this applies to material line work.
Returns: true if this applies to material line work, or false otherwise.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.AppliesToShrinkWrapLineWork
Gets or sets whether this applies to shrink wrap line work.
Returns: true if this applies to shrink wrap line work, or false otherwise.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.AppliesToShrinkWrapHatch
Gets or sets whether this applies to shrink wrap hatch.
Returns: true if this applies to shrink wrap hatch, or false otherwise.

Autodesk.Aec.DatabaseServices.Section2dHatchRegion.IsSubtractive
Gets or sets whether this is subtractive.
Returns: true if this is subtractive, or false otherwise.