Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection
Represents a collection of LayerKeyDefinition.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.Item(System.Int32)
Gets or sets the LayerKeyDefinition at the given index.
index: The index.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.Clear
Removes all items from the collection.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.Count
Returns the number of LayerKeyDefinitions available on this collection.
Returns: Returns the number of LayerKeyDefinitions available on this collection.
Throws System.InvalidOperationException: System.InvalidOperationException.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.Add(Autodesk.Aec.DatabaseServices.LayerKeyDefinition)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.
Throws System.InvalidOperationException: System.InvalidOperationException.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.IndexOf(Autodesk.Aec.DatabaseServices.LayerKeyDefinition)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.LayerKeyDefinition)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.Remove(Autodesk.Aec.DatabaseServices.LayerKeyDefinition)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.Contains(Autodesk.Aec.DatabaseServices.LayerKeyDefinition)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.LayerKeyDefinitionCollection.CopyTo(Autodesk.Aec.DatabaseServices.LayerKeyDefinition[],System.Int32)
Copies the collection to the array.
array: The LayerKeyDefinition array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.