Autodesk.Aec.DatabaseServices.ClipVolume
Represents a clip volume.

Autodesk.Aec.DatabaseServices.ClipVolume.#ctor
Initializes a new instance of the ClipVolume class.

Autodesk.Aec.DatabaseServices.ClipVolume.Vertices
Get the vertices of the clip volume.
Returns: The vertices of the clip volume.

Autodesk.Aec.DatabaseServices.ClipVolume.EcsVertices
Gets or sets the Ecs vertices of the clip volume.
Returns: The Ecs vertices of the clip volume.

Autodesk.Aec.DatabaseServices.ClipVolume.GetBody(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Get the body generated by the clip volume and the Object specified by the ObejctId.
id: The Id of the Object that is used for Body generation.
Returns: The generated Body.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.SetVertices(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.Geometry.Plane)
Set the vertices of the clip volume.
points: The vertices of this clip volume.
sectionPlane: The section plane of this clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.Reverse
Reverse the clip volume.

Autodesk.Aec.DatabaseServices.ClipVolume.ViewSetId
Gets or sets the view set of this clip volume via ObjectId.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.AngleA
Gets or sets the value of angle A of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.AngleB
Gets or sets the value of angle B of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.LengthA
Gets or sets the length A of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.LengthB
Gets or sets the length B of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.Height
Gets or sets the height of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.LowerExtension
Gets or sets the lower extension of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.UseModelExtentsForHeight
Gets or sets if use model extension for height.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.IncludedEntities
Gets or sets the included entities of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.Subdivisions
Gets or sets the subdivision of the clip volume.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClipVolume.Name
Gets or sets the name of this component.
Returns: The name of this component.