Autodesk.Aec.DatabaseServices.IndexSpecifier
Represents an index specifier.

Autodesk.Aec.DatabaseServices.IndexSpecifier.#ctor
Initializes a new instance of the IndexSpecifier class.

Autodesk.Aec.DatabaseServices.IndexSpecifier.AppliesToIndex(System.Int32,System.Int32,System.Int32)
Determines if the given index applies.
index: The index.
startIndex: The start index.
endIndex: The end index.
Returns: Returns true if the given index applies.
Remarks: Must be handled by the derived classes.