Autodesk.Aec.DatabaseServices.DisplayThemeNextNodeOperator
DisplayThemeNextNodeOperator enumeration.

Autodesk.Aec.DatabaseServices.DisplayThemeNextNodeOperator.NextNodeOperatorAnd
NextNodeOperatorAnd.

Autodesk.Aec.DatabaseServices.DisplayThemeNextNodeOperator.NextNodeOperatorOr
NextNodeOperatorOr.