Autodesk.Aec.ApplicationServices.Preferences
Represents a class that contains static methods to access preferences of AEC Editor.

Autodesk.Aec.ApplicationServices.Preferences.GetObjectRelationshipGraphDiagnostics(System.Boolean)
Gets whether the object relationship graph diagnostics is enabled.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether object relationship graph diagnostics is enabled.

Autodesk.Aec.ApplicationServices.Preferences.SetObjectRelationshipGraphDiagnostics(System.Boolean,System.Boolean,System.Boolean)
Sets whether the object relationship graph diagnostics is enabled.
enabled: Boolean value indicates whether object relationship graph diagnostics is enabled.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ObjectRelationshipGraphDiagnostics
Gets or sets whether the object relationship graph diagnostics is enabled.
Returns: Boolean value indicates whether object relationship graph diagnostics is enabled.

Autodesk.Aec.ApplicationServices.Preferences.GetDisplayEnhancedReferenceObjectRelationshipGraphMessages(System.Boolean)
Gets whether the enhanced reference object relationship graph messages are displayed.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the enhanced reference object relationship graph messages are displayed.

Autodesk.Aec.ApplicationServices.Preferences.SetDisplayEnhancedReferenceObjectRelationshipGraphMessages(System.Boolean,System.Boolean,System.Boolean)
Sets whether the enhanced reference object relationship graph messages are displayed.
enabled: Boolean value indicates whether the enhanced reference object relationship graph messages are displayed.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.DisplayEnhancedReferenceObjectRelationshipGraphMessages
Gets or sets whether the enhanced reference object relationship graph messages are displayed.
Returns: Boolean value indicates whether the enhanced reference object relationship graph messages are displayed.

Autodesk.Aec.ApplicationServices.Preferences.GetQuickOsnapMode(System.Boolean)
Gets whether the quick osnap mode is enabled.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the quick osnap mode is enabled.

Autodesk.Aec.ApplicationServices.Preferences.SetQuickOsnapMode(System.Boolean,System.Boolean,System.Boolean)
Sets whether the quick osnap mode is enabled.
enabled: Boolean value indicates whether the quick osnap mode is enabled.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.QuickOsnapMode
Gets or sets whether the quick osnap mode is enabled.
Returns: Boolean value indicates whether the quick osnap mode is enabled.

Autodesk.Aec.ApplicationServices.Preferences.GetApplyCommonProperties(System.Boolean)
Gets whether the common properties are applied.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the common properties are applied.

Autodesk.Aec.ApplicationServices.Preferences.SetApplyCommonProperties(System.Boolean,System.Boolean,System.Boolean)
Sets whether the common properties are applied.
enabled: Boolean value indicates whether the common properties are applied.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ApplyCommonProperties
Gets or sets whether the common properties are applied.
Returns: Boolean value indicates whether the common properties are applied.

Autodesk.Aec.ApplicationServices.Preferences.GetViewManagementSystemDiagnostics(System.Boolean)
Gets whether the view management system diagnostics is enabled.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the view management system diagnostics is enabled.

Autodesk.Aec.ApplicationServices.Preferences.SetViewManagementSystemDiagnostics(System.Boolean,System.Boolean,System.Boolean)
Sets whether the view management system diagnostics is enabled.
enabled: Boolean value indicates whether the view management system diagnostics is enabled.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ViewManagementSystemDiagnostics
Gets or sets whether the view management system diagnostics is enabled.
Returns: Boolean value indicates whether the view management system diagnostics is enabled.

Autodesk.Aec.ApplicationServices.Preferences.GetGeometryDiagnostics(System.Boolean)
Gets whether the geometry diagnostics is enabled.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the geometry diagnostics is enabled.

Autodesk.Aec.ApplicationServices.Preferences.SetGeometryDiagnostics(System.Boolean,System.Boolean,System.Boolean)
Sets whether the geometry diagnostics is enabled.
enabled: Boolean value indicates whether the geometry diagnostics is enabled.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.GeometryDiagnostics
Gets or sets whether the geometry diagnostics is enabled.
Returns: Boolean value indicates whether the geometry diagnostics is enabled.

Autodesk.Aec.ApplicationServices.Preferences.GetMaintainExplodedObjectBlockProperties(System.Boolean)
Gets whether the exploded object block properties are maintained.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the exploded object block properties are maintained.

Autodesk.Aec.ApplicationServices.Preferences.SetMaintainExplodedObjectBlockProperties(System.Boolean,System.Boolean,System.Boolean)
Sets whether the exploded object block properties are maintained.
enabled: Boolean value indicates whether the exploded object block properties are maintained.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.MaintainExplodedObjectBlockProperties
Gets or sets whether the exploded object block properties are maintained.
Returns: Boolean value indicates whether the exploded object block properties are maintained.

Autodesk.Aec.ApplicationServices.Preferences.GetLegacyDrawingUnitMode(System.Boolean)
Gets the legacy drawing unit mode.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: The legacy drawing unit mode.

Autodesk.Aec.ApplicationServices.Preferences.SetLegacyDrawingUnitMode(Autodesk.Aec.ApplicationServices.LegacyDrawingUnitMode,System.Boolean,System.Boolean)
Sets the legacy drawing unit mode.
mode: The legacy drawing unit mode.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.LegacyDrawingUnitMode
Gets the legacy drawing unit mode.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: The legacy drawing unit mode.

Autodesk.Aec.ApplicationServices.Preferences.GetDraftWarningSymbol(System.Boolean)
Gets whether the draft warning symbol is enabled. Draft warning symbol is now defect marker in AutoCAD Architecture and disconnect marker in AutoCAD MEP.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the draft warning symbol is enabled.

Autodesk.Aec.ApplicationServices.Preferences.SetDraftWarningSymbol(System.Boolean,System.Boolean,System.Boolean)
Sets whether the draft warning symbol is enabled. Draft warning symbol is now defect marker in AutoCAD Architecture and disconnect marker in AutoCAD MEP.
enabled: Boolean value indicates whether the draft warning symbol is enabled.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.DraftWarningSymbol
Gets or sets whether the draft warning symbol is enabled.
Returns: Boolean value indicates whether the draft warning symbol is enabled.

Autodesk.Aec.ApplicationServices.Preferences.GetPlotOrPublishWarningSymbol(System.Boolean)
Gets whether the plot or publish warning symbol is enabled.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the plot or publish warning symbol is enabled.

Autodesk.Aec.ApplicationServices.Preferences.SetPlotOrPublishWarningSymbol(System.Boolean,System.Boolean,System.Boolean)
Sets whether the plot or publish warning symbol is enabled.
enabled: Boolean value indicates whether the plot or publish warning symbol is enabled.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.PlotOrPublishWarningSymbol
Gets or sets whether the plot or publish warning symbol is enabled.
Returns: Boolean value indicates whether the plot or publish warning symbol is enabled.

Autodesk.Aec.ApplicationServices.Preferences.GetExportExplodedToAcadFilePrefix(System.Boolean)
Gets the filename prefix which is used when exporting exploded entities to AutoCAD.
prefix: The filename prefix which is used when exporting exploded entities to AutoCAD.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.

Autodesk.Aec.ApplicationServices.Preferences.SetExportExplodedToAcadFilePrefix(System.String,System.Boolean,System.Boolean)
Sets the filename prefix which is used when exporting exploded entities to AutoCAD.
prefix: The filename prefix which is used when exporting exploded entities to AutoCAD.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ExportExplodedToAcadFilePrefix
Gets or sets the filename prefix which is used when exporting exploded entities to AutoCAD.

Autodesk.Aec.ApplicationServices.Preferences.GetExportExplodedToAcadFileSuffix(System.Boolean)
Gets the filename suffix which is used when exporting exploded entities to AutoCAD.
suffix: The filename suffix which is used when exporting exploded entities to AutoCAD.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.

Autodesk.Aec.ApplicationServices.Preferences.SetExportExplodedToAcadFileSuffix(System.String,System.Boolean,System.Boolean)
Sets the filename suffix which is used when exporting exploded entities to AutoCAD.
suffix: The filename suffix which is used when exporting exploded entities to AutoCAD.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ExportExplodedToAcadFileSuffix
Gets the filename suffix which is used when exporting exploded entities to AutoCAD.
suffix: The filename suffix which is used when exporting exploded entities to AutoCAD.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.

Autodesk.Aec.ApplicationServices.Preferences.GetExportExplodedToAcadBindXrefs(System.Boolean)
Gets whether the external references are binded when exporting exploded entities to AutoCAD.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the external references are binded when exporting exploded entities to AutoCAD.

Autodesk.Aec.ApplicationServices.Preferences.SetExportExplodedToAcadBindXrefs(System.Boolean,System.Boolean,System.Boolean)
Sets whether the external references are binded when exporting exploded entities to AutoCAD.
enabled: Boolean value indicates whether the external references are binded when exporting exploded entities to AutoCAD.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ExportExplodedToAcadBindXrefs
Gets or sets whether the external references are binded when exporting exploded entities to AutoCAD.
Returns: Boolean value indicates whether the external references are binded when exporting exploded entities to AutoCAD.

Autodesk.Aec.ApplicationServices.Preferences.GetExportExplodedToAcadInsertWhenBinding(System.Boolean)
Gets whether the Insert method is used to bind the external references when exporting exploded entities to AutoCAD.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: Boolean value indicates whether the Insert method is used to bind the external references when exporting exploded entities to AutoCAD.

Autodesk.Aec.ApplicationServices.Preferences.SetExportExplodedToAcadInsertWhenBinding(System.Boolean,System.Boolean,System.Boolean)
Sets whether the Insert method is used to bind the external references when exporting exploded entities to AutoCAD.
enabled: Boolean value indicates whether the Insert method is used to bind the external references when exporting exploded entities to AutoCAD.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ExportExplodedToAcadInsertWhenBinding
Gets or sets whether the Insert method is used to bind the external references when exporting exploded entities to AutoCAD.
Returns: Boolean value indicates whether the Insert method is used to bind the external references when exporting exploded entities to AutoCAD.

Autodesk.Aec.ApplicationServices.Preferences.GetExportExplodedToAcadExportFormat(System.Boolean)
Gets the drawing version which is used when exporting exploded entities to AutoCAD.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: The drawing version which is used when exporting exploded entities to AutoCAD.

Autodesk.Aec.ApplicationServices.Preferences.SetExportExplodedToAcadExportFormat(Autodesk.AutoCAD.DatabaseServices.DwgVersion,System.Boolean,System.Boolean)
Sets the drawing version which is used when exporting exploded entities to AutoCAD.
dwgFormat: The drawing version which is used when exporting exploded entities to AutoCAD.
updateVariable: Boolean value indicates whether to update the runtime variable.
updateRegistry: Boolean value indicates whether to update the registry.

Autodesk.Aec.ApplicationServices.Preferences.ExportExplodedToAcadExportFormat
Gets the drawing version which is used when exporting exploded entities to AutoCAD.
fromRegistry: Boolean value indicates whether to get the value from registry or the runtime variable.
Returns: The drawing version which is used when exporting exploded entities to AutoCAD.

Autodesk.Aec.ApplicationServices.Preferences.AllowSnapToSurfaceHatch
Gets or sets whether snapping to surface hatch is allowed.
Returns: Boolean value indicates whether snapping to surface hatch is allowed.

Autodesk.Aec.ApplicationServices.Preferences.DisableOsnapGsMarkerOptimization
Gets or sets whether the osnap gs marker optmization is disabled.
Returns: Boolean value indicates whether the osnap gs marker optmization is disabled.