Autodesk.Aec.DatabaseServices.MultiViewBlockDefinition
Represents a multi view block definition.
Remarks: A multi view block definition contains information about which blocks to display for a given display rep and a given viewing direction.

Autodesk.Aec.DatabaseServices.MultiViewBlockDefinition.#ctor
Initializes a new instance of the MultiViewBlockDefinition class.

Autodesk.Aec.DatabaseServices.MultiViewBlockDefinition.DisplayRepresentationDefinitions
Gets the collection of MultiViewBlockDisplayRepresentationDefinitions.
Returns: Returns the collection of MultiViewBlockDisplayRepresentationDefinitions.

Autodesk.Aec.DatabaseServices.MultiViewBlockDefinition.GetAllBlocksReferenced
Walks through the MultiViewBlockDefinition and gets all blocks that are referenced.
Returns: A collection of block ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockDefinition.InterferenceBlockId
Gets or sets the id of the interference block.
Returns: Returns the id of the interference block.

Autodesk.Aec.DatabaseServices.MultiViewBlockDefinition.SetAttributeGripsDisabled(System.Boolean)
Sets the state for the grips of each attribute.
disable: true disables the attribute grips; false enables them.