Autodesk.Aec.DatabaseServices.Override
Represents an override.

Autodesk.Aec.DatabaseServices.Override.#ctor
Initializes a new instance of the Override class.

Autodesk.Aec.DatabaseServices.Override.ExtensionDictionaryName
Get the name of extension dictionary.
Returns: The name of extension dictionary.

Autodesk.Aec.DatabaseServices.Override.AddToOverrideExtionDicttionaryAndClose
Add one object to another object's extension dictionary.
objectToSetOn: The object to set on.
newObjectToAdd: The new object to add.
Returns: The object id that is added into extention dictionary.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.