Autodesk.Aec.DatabaseServices.GridCustomSegment
Represents a grid custom segment.

Autodesk.Aec.DatabaseServices.GridCustomSegment.#ctor
Initializes a new instance of the GridCustomSegment class.

Autodesk.Aec.DatabaseServices.GridCustomSegment.#ctor(Autodesk.AutoCAD.Geometry.Curve2d)
Initializes a new instance of the GridCustomSegment class using the specified curve.
curve: A Curve2d.

Autodesk.Aec.DatabaseServices.GridCustomSegment.Id
Gets or sets the Id for this custom grid segment.
Returns: Returns the Id for this custom grid segment.