Autodesk.Aec.DatabaseServices.AxisReference
AxisReference enumeration.

Autodesk.Aec.DatabaseServices.AxisReference.Start
Axis reference at start.

Autodesk.Aec.DatabaseServices.AxisReference.Mid
Axis reference at middle.

Autodesk.Aec.DatabaseServices.AxisReference.End
Axis reference at end.