Autodesk.Aec.Modeler.DirectionType
DirectionType enumeration.

Autodesk.Aec.Modeler.DirectionType.Forward
Forward direction of the edge loop wrt the input data.

Autodesk.Aec.Modeler.DirectionType.Reverse
Reverse direction of the edge loop wrt the input data.

Autodesk.Aec.Modeler.DirectionType.Both
Both forward and reverse direction of the edge loop wrt the input data.