Autodesk.Aec.DatabaseServices.OverrideMaterialAssignment
Represents a override material assignment class.

Autodesk.Aec.DatabaseServices.OverrideMaterialAssignment.#ctor
Initializes a new instance of the OverrideMaterialAssignment class.

Autodesk.Aec.DatabaseServices.OverrideMaterialAssignment.MaterialId
Gets or sets material id.
Returns: Material id.

Autodesk.Aec.DatabaseServices.OverrideMaterialAssignment.ComponentId
Gets or sets component id.
Returns: Component id.

Autodesk.Aec.DatabaseServices.OverrideMaterialAssignment.LocationId
Gets or sets location id.
Returns: Location id.