Autodesk.Aec.DatabaseServices.Operation
Operation enumeration.

Autodesk.Aec.DatabaseServices.Operation.Unknown
Invalid.

Autodesk.Aec.DatabaseServices.Operation.Additive
Boolean addition.

Autodesk.Aec.DatabaseServices.Operation.Subtractive
Boolean subtraction.

Autodesk.Aec.DatabaseServices.Operation.Intersect
Boolean intersection.

Autodesk.Aec.DatabaseServices.Operation.Combine
Boolean combine.