Autodesk.Aec.DatabaseServices.BoundaryFlags
Boundary Edge position.

Autodesk.Aec.DatabaseServices.BoundaryFlags.Top
Boundary edge on Top.

Autodesk.Aec.DatabaseServices.BoundaryFlags.Left
Boundary edge on Left.

Autodesk.Aec.DatabaseServices.BoundaryFlags.Bottom
Boundary edge on Bottom.

Autodesk.Aec.DatabaseServices.BoundaryFlags.Right
Boundary edge on Right.