Autodesk.Aec.DatabaseServices.CurveYOffsetType
Defines identifiers that indicate offset types.

Autodesk.Aec.DatabaseServices.CurveYOffsetType.FromCenterCurve
Measure from the center of the base curve.

Autodesk.Aec.DatabaseServices.CurveYOffsetType.FromLeftEdge
Measure from the left edge of the base curve.

Autodesk.Aec.DatabaseServices.CurveYOffsetType.FromRightEdge
Measure from the right edge of the base curve.