Autodesk.Aec.DatabaseServices.ConstraintUtility
Represents a utility group of constraint.

Autodesk.Aec.DatabaseServices.ConstraintUtility.#ctor
Initializes a new instance of the ConstraintUtility class.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetAssocPersSubentityIdPE(Autodesk.AutoCAD.Runtime.RXObject)
Gets AssocPersSubentityIdPE from object.
object: The given object.
Returns: The output AssocPersSubentityIdPE.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetCurrentSpaceNetwork(System.Boolean)
Gets associate network for current model space.
createIfNotExist: Determine whether create if it is not existing.
Returns: The object Id.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetSpaceModelConstraintGroup(Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean,Autodesk.AutoCAD.Geometry.Plane)
Gets 2d constraint group.
database: The input database.
createIfDoesNotExist: Determine whether create if it is not existing.
plane: The plane.
Returns: The 2d constraint group id.

Autodesk.Aec.DatabaseServices.ConstraintUtility.IsActionEvaluationInProgress
Is action evaluation in progress.
Returns: Determine whether action evaluation is in progress.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetEdgeVertexSubentType(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets edge vertex subentity's vertex type.
vertexSubentityId: The vertex Subentity Id.
Returns: The vertext type.

Autodesk.Aec.DatabaseServices.ConstraintUtility.CreateEdgeVertexSubentId(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.Aec.DatabaseServices.ConstraintUtility+EdgeVertexType)
Gets edge vertex subentity from edge subentity.
edgeSubentityId: The edge subEntityId.
vertexType: The vertex type.
Returns: The subEntityId.

Autodesk.Aec.DatabaseServices.ConstraintUtility.CreateAllEdgeVerticesSubentIds(Autodesk.AutoCAD.DatabaseServices.Entity)
Creates all edge vertices of an input entity.
entity: The entity.
Returns: The subEntityId.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetEdgeSubentIdFromEdgeVertexSubentId(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets edge subentity from vertex subentity (vertex subentity is created based on edge subentity).
vertexSubentity: The vertex subentity Id.
Returns: The edge subentity Id.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetEdgeBasedSubentity(Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets edge subentity from vertex subentity, or just the edge subentity if input is an edge subentity.
subEntityId: The vertex subentity.
Returns: The edge subentity.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetEdgeBasedFullSubentityPath(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Gets an edge subentity path from a input vertex subentity path.
path: The input vertex subentity path.
Returns: The edge subentity path.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetEdgeVertexSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;)
Gets vertex subentity for given edge subentity.
entity: The input entity.
edgeSubentityId: The input edge subentity.
startVertexSubentityId: The output start vertext subentity id.
endVertexSubentityId: The output end vertext subentity id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetEdgeVertexSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;)
Gets vertex subentity for given edge subentity.
entity: The input entity.
edgeSubentityId: The input edge subentity.
startVertexSubentityId: The output start vertext subentity id.
endVertexSubentityId: The output end vertext subentity id.
middleSubentityId: The output middle vertext subentity id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetEdgeVertexSubentities(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;)
Gets vertex subentity for given edge subentity.
entity: The input entity.
edgeSubentityId: The input edge subentity.
startVertexSubentityId: The output start vertext subentity id.
endVertexSubentityId: The output end vertext subentity id.
middleSubentityId: The output middle vertext subentity id.
centerSubentityId: The output center vertext subentity id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetAllSubEntitiesInEntity(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Get subenttities, the vertex subentities will not be returned if any edge subentity found.
entityId: The input entity.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.IsEntityHasEdgeSubent(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Check whether an entity has edge subentity or not.
entityId: The input entity.
Returns: Specify whether an entity has edge subentity.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddGeomConstraintToSubents(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint+ConstraintType,System.Boolean)
Adds geometrical constraint to one subentity, for example fix/vertical/horizontal.
entity: The input entity.
subEntityId: The subentity.
constraintType: The geometrical constraint type.
setToImplied: Determine whether set to implied.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddGeomConstraintToSubents(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint+ConstraintType,System.Boolean)
Adds geometrical constraint between two subentities.
entity: The input entity.
subEntityId1: The first subentity.
subEntityId2: The second subentity.
constraintType: The geometrical constraint type.
setToImplied: Determine whether set to implied.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddDistanceConstraint(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds distance constraint on one subentity.
subentity: The subentity.
valueDependencyId: The value dependency id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddDistanceConstraint(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds distance constraint between two subentities.
subentity1: The first subentity.
subentity2: The second subentity.
valueDependencyId: The value dependency id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddDistanceConstraint(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds distance constraint on one subentity.
entity: The input entity.
subEntityId: The subentity id.
valueDependencyId: The value dependency id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddDistanceConstraint(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds distance constraint between two subentities.
entity: The input entity.
subEntityId1: The first subentity id.
subEntityId2: The second subentity id.
valueDependencyId: The value dependency id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.Get2dConstraintsOnObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&amp;,System.Boolean)
Gets 2d constraints on object.
entityId: The input entity.
constraints: The output contraints.
includeExplicitConstraints: Determine whether include explicit constraints.
Returns: Specify whether successfully get 2d constraints.

Autodesk.Aec.DatabaseServices.ConstraintUtility.Get2dConstraintsOnObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&amp;)
Gets 2d constraints on object.
entityId: The input entity.
constraints: The output contraints.
Returns: Specify whether successfully get 2d constraints.

Autodesk.Aec.DatabaseServices.ConstraintUtility.Get2dConstraintsOnSubent(System.ValueType,Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&amp;,System.Boolean)
Gets 2d constraints on subentity.
subentityPath: The input subentity path.
constraints: The output contraints.
includeExplicitConstraints: Determine whether include explicit constraints.
Returns: Specify whether successfully get 2d constraints.

Autodesk.Aec.DatabaseServices.ConstraintUtility.Get2dConstraintsOnConstrainedGeometry(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry,Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&amp;,System.Boolean)
Gets Constraints On constraint geometry.  Note that if the input constraintGeometry is an implicit point( NAMESPACE_ACDB::ConstrainedImplicitPoint ), then this function will not return any constraint, so please use Get2dConstraintsOnImplicitPoints() for NAMESPACE_ACDB::ConstrainedImplicitPoint.
constraintGeometry: The input constraint geometry.
constraints: The output constraints.
includeExplicitConstraints: Determine whether include explicit constraints.
Returns: Specify whether successfully get 2d constraints.

Autodesk.Aec.DatabaseServices.ConstraintUtility.Get2dConstraintsOnImplicitPoint(Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint,Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&amp;,System.Boolean)
Gets constraints on implicit point.
implicitPoint: The input implicit point.
constraints: The output constraints.
includeExplicitConstraints: Determine whether include explicit constraints.
Returns: Specify whether successfully get 2d constraints.

Autodesk.Aec.DatabaseServices.ConstraintUtility.Get2dConstraintsOnImplicitPoints(Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint[],Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint[]&amp;,System.Boolean)
Gets constraints on implicit points.
points: The input implicit points.
constraints: The output constraints.
includeExplicitConstraints: Determine whether include explicit constraints.
Returns: Specify whether successfully get 2d constraints.

Autodesk.Aec.DatabaseServices.ConstraintUtility.ObjectHasConstraint(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Checks whether an object has constraint or not.
entityId: The input entity id.
Returns: Specify whether an object has constraint or not.

Autodesk.Aec.DatabaseServices.ConstraintUtility.ObjectHasFixConstraint(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Checks whether an object has fix constraint or not.
entityId: The input entity id.
Returns: Specify whether an object has fix constraint or not.

Autodesk.Aec.DatabaseServices.ConstraintUtility.SubentityHasConstraint(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Checks if a subentity has constraint or not.
entity: The input entity.
subEntityId: The input subentity id.
Returns: Specify whether a subentity has constraint or not.

Autodesk.Aec.DatabaseServices.ConstraintUtility.DeleteConstraint(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint)
Removes Constraint.
constraint: The input constraint.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.RemoveGeometryConstraintsOnObjects(Autodesk.AutoCAD.DatabaseServices.DBObject)
Remove all geom constraint on an object.
object: The given object.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetConstraintedGeometryOnSubent(System.ValueType)
Gets constrained geometry (node) from subentity path.
subentityPath: The given subentity path.
Returns: The constrained geometry.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetAllConstraintedGeometryOnEntity(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry[]&amp;)
Gets all constrained geometries from object.
entity: The given entity.
geometries: The output constrained geometries.
Returns: Specify whether successfully get all constrainted geometries.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddConstraintGeometry(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Adds constraint geometry node into the 2d constraint group based on the input subentity path.
subentityPath: The input subentity path.
Returns: The constraint geometry.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetGeometryDependencyIdsOnEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
Gets geometry dependencies in an entity.
entity: The given entity.
Returns: The geometry dependence ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetSubentGeomDependency(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Gets geometry dependence id for given subentity in an entity.
entity: The given entity.
subEntityId: The given subentity id.
Returns: The geometry dependence id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.ObjectHasGeomDependency(Autodesk.AutoCAD.DatabaseServices.Entity)
Checks whether an object has constraint geometry or not.  this is an quicker way to check if an object has constraint or not than the function of ObjectHasConstraint.
entity: The given entity.
Returns: Specify whether an object has constraint geometry or not.

Autodesk.Aec.DatabaseServices.ConstraintUtility.ObjectHasGeomDependency(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Checks whether an object has constraint geometry or not this is an quicker way to check if an object has constraint or not than the function of ObjectHasConstraint.
id: The given object id.
Returns: Specify whether an object has constraint geometry or not.

Autodesk.Aec.DatabaseServices.ConstraintUtility.SubentHasGeomDependency(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Checks whether subentity has geomDependency.
entity: The given entity.
subEntityId: The given subentity id.
Returns: Specify whether subentity has geomDependency.

Autodesk.Aec.DatabaseServices.ConstraintUtility.DeleteGeometryNodeInConstraintGroup(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Deletes geometry dependency in constraint group.
geometryDependencyId: The given geometry dependency id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.DeleteGeometryNodeInConstraintGroup(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Deletes geometry dependency in constraint group.
ids: The given constraint group.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.DeleteGeometryNodeInConstraintGroup(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry[])
Deletes geometry dependency in constraint group.
constrainedGeometries: The given constrained geometries.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.DeleteGeometryNodeInConstraintGroup(Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry)
Deletes geometry dependency in constraint group.
constrainedGeometry: The given constrained geometry.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.DeleteGeometryDependencyOnSubentity(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Deletes geometry dependency in constraint group.
entity: The given entity.
subEntityId: The given subentity id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetValueDependencyByName(Autodesk.AutoCAD.DatabaseServices.Entity,System.String)
Gets value dependency id by value name.
entity: The given entity.
valueName: The value name.
Returns: The value dependency id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetAcDbAssocValueDependencyIds(Autodesk.AutoCAD.DatabaseServices.Entity)
Gets value dependencies.
entity: The given entity.
Returns: The value dependencies.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetAllImplicitPointsOnObject(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint[]&amp;)
Gets all implicit points from object.
entity: The given entity.
implicitPoints: The output implicit points.
Returns: Specify whether successfully get all implicit points.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetAllStartEndImplicitPointsOnObject(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint[]&amp;)
Gets all start/end implicit points on db curve.
entity: The given entity.
implicitPoints: The output implicit points.
Returns: Specify whether successfully get all implicit points.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetVertexSubentityFullPathOfImplicitPoint(Autodesk.AutoCAD.DatabaseServices.ConstrainedImplicitPoint)
Gets vertext subentity full path of implicit point.
implicitPoint: The given implicit point.
Returns: The output vertext subentity path.

Autodesk.Aec.DatabaseServices.ConstraintUtility.RelaxConstraintEvaluation
Relax constraint evaluation ( modify action to fulfill the object modifications )

Autodesk.Aec.DatabaseServices.ConstraintUtility.RestoreConstraintEvaluation
Restore constraint evaluation.

Autodesk.Aec.DatabaseServices.ConstraintUtility.IsConstraintEvaluationRelaxed
Checks wether the constraint already relaxed.
Returns: Specify wether the constraint already relaxed.

Autodesk.Aec.DatabaseServices.ConstraintUtility.ProjectToXYPlanCurve(Autodesk.AutoCAD.Geometry.Curve3d)
Projects curve3d to XY plane (Z = 0), and return the value after projected.
curve3d: The curve.
Returns: The value after projected to XY plane.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.HideInternalConstraint
Gets or sets the flag of constrolling display of internal constraint bar (the small constrol bar icon in AutoCAD)

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddInternalConstraint(Autodesk.Aec.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Adds internal constraint on subentity.
entity: The given entity.
subEntityId: The given subentity id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.OnAcDbAssocGeometryDependencyAppended(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Updates internal constraints while geometry dependency attached.
dependencyObjectId: The dependency object id.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetClosestEdgeSubentity(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.SubentityType)
Gets closest edge subentity.
entity: The given entity.
fullPathObjectIds: The give full path object ids.
inputPoint: The input point.
subentityType: The subentity type.
Returns: The closest edge subentity.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetClosetVertexSubentityId(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.SubentityId&amp;)
Gets closet vertex subEntityId.
entity: The given entity.
objectIds: The given object ids.
pickPoint: The given pick point.
edgeSubentityId: The given edge subentity id.
closestVertexSubentityId: The output closest vertext subentity id.
Returns: Determine whether successfully get closet vertex subentity id.

Autodesk.Aec.DatabaseServices.ConstraintUtility.GetSubentGeometryXform(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Gets subentity geometry X form.
objectIds: The given object ids.
Returns: The subentity geometry X form.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.IsValidSubentity(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId)
Checks a subentity is valid or not.
entity: The given entity.
subEntityId: The given subentity id.
Returns: Specify a subentity is valid or not.

Autodesk.Aec.DatabaseServices.ConstraintUtility.RecordForDelayRegen(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Some objects' update while evaluating constraint may break constraint system, so invent this function (and function DelayRegenCachedObjects) to delay regen these objects in command-end.
id: The given object id.

Autodesk.Aec.DatabaseServices.ConstraintUtility.RecordForDelayRegen2ndRound(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Records object for 2nd round of delay regen.
id: The given object id.

Autodesk.Aec.DatabaseServices.ConstraintUtility.RemoveEntityRedundantInternalConstraints(Autodesk.Aec.DatabaseServices.Entity)
Remove entity redundant internal constraints.
entity: The given entity.

Autodesk.Aec.DatabaseServices.ConstraintUtility.IsSubentityFixed(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Checks whether the subentity is fixed.
path: The given subentity path.
Returns: Specify whether the subentity is fixed.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AddFixConstraintOnSubent(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry[]&amp;)
Adds fix constraint on subentity.
path: The given full subentity path.
newlyAddedConstraintGeometry: The output newly added constraint geometries.
Returns: The newly added fix constraints.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.IsDragging
Checks whether currently is dragging.
Returns: Specify whether currently is dragging.

Autodesk.Aec.DatabaseServices.ConstraintUtility.DraggingState
Gets dragging state.
Returns: The dragging state.

Autodesk.Aec.DatabaseServices.ConstraintUtility.AutoCoincidentConstraint(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],Autodesk.AutoCAD.DatabaseServices.ConstrainedGeometry[]&amp;)
Automatically adds coincident constraint to given subentities.
fullSubentityPaths: The full sub-entity path.
newlyAddedGeometries: The output newly added geometries.
Returns: The geometrical constraints.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ConstraintUtility.SetDelayUpdateSpaceEnabledForCurDwg(System.Boolean)
Set the flag of "delayConstraintUpdateEnabled"
value: Specify the flag of "delayConstraintUpdateEnabled".

Autodesk.Aec.DatabaseServices.ConstraintUtility.IsAecDbEntityConstrBarVisible(Autodesk.AutoCAD.DatabaseServices.GeometricalConstraint)
Gets constraint bar visibility.
geometricalConstraint: The given geometrical constraint.
Returns: Specify the constraint bar visbility.