Autodesk.Aec.DatabaseServices.DictionaryProfileDefinition
Represents a profile definition dictionary.

Autodesk.Aec.DatabaseServices.DictionaryProfileDefinition.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryProfileDefinition class using the specified database.
db: The database.

Autodesk.Aec.DatabaseServices.DictionaryProfileDefinition.GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard definition id.
db: The database.
Returns: Returns the standard definition id.