Autodesk.Aec.DatabaseServices.GsMarkerInformationTree
Represents a tree contains the GsMakerInformation nodes.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.#ctor
Initializes a new instance of the GsMarkerInformationTree class.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.#ctor(Autodesk.Aec.DatabaseServices.ObjectId)
Initializes a new instance of the GsMarkerInformationTree class.
id: The specified object id.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Initializes a new instance of the GsMarkerInformationTree class using the specified refernce path of the database.and the specified object id.
id: The specified object id.
dbReferencePath: The specified refernce path of the database.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.StartGsMarker
Gets or sets the specified start GsMarker of the tree.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.NextGsMarker
Gets the next GsMarker of the tree.
Returns: The next GsMarker of the tree.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CurrentGsMarker
Gets the current GsMarker of the tree.
Returns: The current GsMarker of the tree.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.ObjectId
Gets the object id of the tree.
Returns: The object id of the tree.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.HasDatabaseReferencePath(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Gets the boolean value to indicate if the node has the specified database reference path.
path: The specified path.
Returns: The boolean value indicates if the node has the specified database reference path.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddGsMarkerInformationNode(Autodesk.Aec.DatabaseServices.GsMarkerInformationNode,System.Boolean)
Add the specified GsMarker information node to the tree.
node: The specified node.
pushIntoCurrentNodeStack: The boolean value indicates if the specified node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.PopViewportInformationNode
Pops the last viewport information node off the viewport information node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddDisplayRepresentationInformationNode(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Adds the specified display representation information node to the tree.
id: The specified object id of the display representation information node.
pushIntoCurrentNodeStack: The boolean value indicates if the the specified node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddDisplayComponentInformationNode(Autodesk.Aec.DatabaseServices.DisplayComponentEntity,System.Boolean)
Adds the specified display component information node to the tree.
componentEntity: The specified display component information node.
pushIntoCurrentNodeStack: The boolean value indicates if the specified node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddDisplayComponentInformationNode(System.String,System.Boolean)
Adds the specified display component information node to the tree.
componentName: The name of the specified display component information node.
pushIntoCurrentNodeStack: The boolean value indicates if the specified node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddDisplayThemeInformationNode(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,System.Boolean)
Adds the node of the the display theme information to the tree.
id: The specified object id of the display theme information.
componentIndex: The specified component index of the display theme.information.
pushIntoCurrentNodeStack: The boolean value indicates if the node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddCustomInformationNode(System.Int32,System.Boolean)
Adds the custom information node specified by the GsMarker to the tree.
value: The specified GsMarker.
pushIntoCurrentNodeStack: The boolean value indicates if the node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddBranchInformationNode(System.Boolean)
Adds the branch information node to the tree.
pushIntoCurrentNodeStack: The boolean value indicates if the node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddCustomBlockInformationNode(System.Boolean)
Adds the custom block information node to the tree.
pushIntoCurrentNodeStack: The boolean value indicates if the node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddUnsupportedGraphicsInformationNode(System.Boolean)
Adds the unsupported graphics information node to the tree.
pushIntoCurrentNodeStack: The boolean value indicates if the node should be pushed into the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.PushCurrentGsMarkerInformationNode(Autodesk.Aec.DatabaseServices.GsMarkerInformationNode)
Pushes the specified GsMarker information node to the current GsMarker information node stack.
node: The specified GsMarker information node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.PopCurrentGsMarkerInformationNode
Pops the last GsMarker information node off the current GsMarker information node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.PopCurrentGsMarkerInformationNode(Autodesk.AutoCAD.Runtime.RXClass,System.Boolean)
Pops the last GsMarker information node specified by the class type off the current GsMarker information node stack.
nodeInformationClass: The specified class type of the nodes.
checkForDerivedTypes: The boolean value indicates if the node should be checked for the derived types.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.SetDisplayPropertiesForCurrentDisplayInformationNode(Autodesk.Aec.DatabaseServices.DisplayProperties)
Sets the specified display properties for the current display information node.
properties: The specified display properties.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.ResetTransientDisplayPropertiesInformationForCurrentDisplayInformationNode
Resets the transient display properties information for current display information node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CurrentGsMarkerInformationNode
Gets the current GsMarker information node.
Returns: The current GsMarker information node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.InformationNodeForGsMarkerAndInformationType(System.Int32,Autodesk.AutoCAD.Runtime.RXClass,System.Boolean)
Gets the information node specified by the GsMarker and the information type.
value: The specified GsMarker value.
nodeType: The specified class type.
doIsKindOfTest: The boolean value indicates if the test on the type should be done.
Returns: The specified information node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.PopulateTree
Gets or sets the specified boolean value to indicate if the tree should be poplulated.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.PushCustomOverrideNode
Gets or sets the specified boolean value to indicate if the custom overrided node should be pushed into the stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.ResetCurrentNodeStack
Resets the current node stack.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.SetParentCustomBlockOwnerInformation(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Sets the parent of the custom block owner information.
id: The specified object id of the parent.
customBlockGsMarker: The GsMarker of the custom block.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.EntityIsFromCustomBlock
Gets the boolean value to indicate if the entity is from the custom block.
Returns: The boolean value indicates if the entity is from the custom block.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CustomBlockOwnerEntityId
Gets the object id of the custom block owner entity.
Returns: The object id of the custom block owner entity.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CustomBlockGsMarker
Gets the GsMarker of the custom block.
Returns: The GsMarker of the custom block.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CustomBlockInformationToString
Convert the custom block informations to strings.
Returns: The string collection contains the custom block informations.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.IsDrawingCustomBlock
Gets or sets the boolean value to indicate if the custom block should be drawn.
Returns: The boolean value indicates if the custom block should be drawn.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetDisplayComponentNodesInCurrentViewport(Autodesk.AutoCAD.Geometry.IntPtrCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Gets all information nodes for display components in the current viewport.
gsMarkers: The specified GsMarkers for display components.
id: The object id of specified viewport.
viewportNumber: The index of the specified viewport.
Returns: All information nodes for display components in the current viewport.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AreComponentsSelected
Gets the boolean value to indicate if the components are selected.
Returns: The boolean value indicates if the components are selected.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetSelectedComponentsInformation
Gets all components information of selected entities.
Returns: All components information of selected entities.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddSelectedComponentInformation(Autodesk.AutoCAD.Geometry.IntPtrCollection)
Adds all selected component informations to the tree.
gsMarkers: The specified GsMarkers of all selected component informations.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.AddSelectedComponentInformation(Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation)
Adds the specified component information of the selected entity to the GsMarker information tree.
information: The specified component information of the selected entity.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.UpdateSelectedComponentInformation(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Updates the information of the selected component.
id: The specified object id of the selected component.
index: The specified index.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.ClearSelectedComponentsGsMarkers
Clear all GsMarkers of the selected components.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetSelectedComponentGsMarkersForHighligting
Gets the GsMarkers of the selected components for high lighting.
Returns: The GsMarkers of the selected components for high lighting.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetSelectedComponentGsMarkersOnByMaterialChange(Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation)
Gets the GsMarkers of the selected components on ByMaterial change.
information: The specified component information of the selected entity.
Returns: The GsMarkers of the selected components on ByMaterial change.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.HasGsMarkersForHoverHighlighting
Gets the boolean value to indicate if the tree has GsMarkers for hover high lighting.
Returns: The boolean value indicates if the tree has GsMarkers for hover high lighting.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GsMarkersForHoverHighlighting
Gets the GsMarker for hover high lighting.
Returns: The GsMarker for hover high lighting.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CleanupGsMarkersForHoverHighliting
Cleans up all GsMarkers for hover high lighting.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GsMarkersForHoverHighliting
Sets the GsMarker for hover high lighting.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.SetSelectedObjectDisplayRepresentaionId
Sets the specified display representation of the selected object.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.SelectedObjectDisplayRepresentationId
Gets the display representation of the selected object.
Returns: The object id of the display reprensentation for the specified object.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.ClearSelectedObjectDisplayRepresentationInformation
Clears the display representation informations of the selected object.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CollectNonViewportInformationNodesInViewport(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,Autodesk.AutoCAD.Runtime.RXClass,System.Boolean)
Gets the information nodes only in the specified viewport.
viewportId: The specified object id.of the viewport.
viewportIndex: The specified index of the viewport.
nodeClass: The specified class type.
recursive: The boolean value indicates if the children nodes should be collected.
Returns: The information nodes only in the specified viewport.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.CollectNonViewportInformationNodesInViewport(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
Gets the information nodes only in the specified viewport.
viewportId: The specified object id.of the viewport.
viewportIndex: The specified index of the viewport.
Returns: The information nodes only in the specified viewport.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetViewportIdFromViewportNode(System.Int32)
Gets the object id of the specified viewport.
gsMarker: The specified GsMarker.
Returns: The object id of the specified viewport.
Throws Autodesk.AutoCAD.Runtime.Exception: The exception is thrown if the specified viewport is not found.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.GetViewportNumberFromViewportNode(System.Int32)
Gets the view port number from the viewport node.
gsMarker: The specified GsMarker.
Returns: The view port number.
Throws Autodesk.AutoCAD.Runtime.Exception: The exception is thrown if the specified viewport is not found.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.IsDrawingWithDisplayTheme
Gets the boolean value to indicate if the tree is drawing with the display theme.
Returns: The boolean value indicates if the tree is drawing with the display theme.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.IsEntity2dSectionType
Gets the boolean value to indicate if the entity is the 2d secion.
Returns: The boolean value indicates if the entity is the 2d secion.

Autodesk.Aec.DatabaseServices.GsMarkerInformationTree.Entity2dSectionType
Sets the specified boolean value to indicate if the entity is the 2d secion.