Autodesk.Aec.DatabaseServices.ProfileDefinition
Represents a profile definition.

Autodesk.Aec.DatabaseServices.ProfileDefinition.#ctor
Initializes a new instance of the ProfileDefinition class.

Autodesk.Aec.DatabaseServices.ProfileDefinition.Profile
Gets a copy of the profile.
Returns: Returns a copy of the profile.

Autodesk.Aec.DatabaseServices.ProfileDefinition.SetProfile(Autodesk.Aec.Geometry.Profile,System.Boolean,Autodesk.AutoCAD.Geometry.Point2d)
Sets the profile.
profileToCopy: The profile to copy.
translateInsertion: If true, translate the insertion point by the vector defined by from the top left to bottom right of the extents.
insertionPoint: The insertion point.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ProfileDefinition.InsertionPoint
Gets or sets the insertion point.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ProfileDefinition.ExtrusionDirection
Gets or sets the extrusion direction.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ProfileDefinition.CalculateSegmentPositions(Autodesk.Aec.Geometry.ProfileExtrusionDirection)
Calculates the segment positions.
direction: The extrusion direction.

Autodesk.Aec.DatabaseServices.ProfileDefinition.ModifySegmentPositions(Autodesk.Aec.Geometry.SegmentPosition,Autodesk.Aec.Geometry.SegmentPosition)
Modifies the segments positions.
oldPosition: The old segment position.
newPosition: The new segment position.

Autodesk.Aec.DatabaseServices.ProfileDefinition.ModifySegmentPositions(Autodesk.Aec.Geometry.ProfileExtrusionDirection,Autodesk.Aec.Geometry.ProfileExtrusionDirection)
Modifies the segments positions.
oldDirection: The old extrusion direction.
newDirection: The new extrusion direction.