Autodesk.Aec.Modeler.EdgeCollection
Represents a collection of Edge.

Autodesk.Aec.Modeler.EdgeCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.EdgeCollection.Item(System.Int32)
Gets or sets the Edge at the given index.
index: The index.

Autodesk.Aec.Modeler.EdgeCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.EdgeCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.EdgeCollection.Count
Returns the number of Edges available on this collection.
Returns: Returns the number of Edges available on this collection.

Autodesk.Aec.Modeler.EdgeCollection.Add(Autodesk.Aec.Modeler.Edge)
Adds the specified item to the collection.
value: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.Modeler.EdgeCollection.IndexOf(Autodesk.Aec.Modeler.Edge)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.EdgeCollection.Insert(System.Int32,Autodesk.Aec.Modeler.Edge)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.Modeler.EdgeCollection.Remove(Autodesk.Aec.Modeler.Edge)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.Modeler.EdgeCollection.Contains(Autodesk.Aec.Modeler.Edge)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.EdgeCollection.CopyTo(Autodesk.Aec.Modeler.Edge[],System.Int32)
Copies the collection to the array.
array: The Edge array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.EdgeCollection.#ctor(Autodesk.Aec.Modeler.IEdgeOperation)
Initializes a new instance of the Edge class.