Autodesk.Aec.DatabaseServices.Dictionary
Represents a dictionary.

Autodesk.Aec.DatabaseServices.Dictionary.#ctor(System.String,Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Runtime.RXClass,System.Boolean,Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the Dictionary class using the specified record type, object type, standard entries and database.
dictionaryName: The dictionary name.
recordType: The record type.
objectType: The object type.
hasStandardEntries: true, if the dictionary will have standard entries.
db: The database.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.HasStandardEntries
Gets the value that indicates if the dictionary has standard entries.
Returns: true, if the dictionary has standard entries.

Autodesk.Aec.DatabaseServices.Dictionary.GetAt(System.String)
Gets a dictionary record by name.
name: The name.
Returns: Returns a dictionary record id by name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.NameAt(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the name of a dictionary record specified by the id.
id: The id.
Returns: Returns the name of a dictionary record specified by the id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.GetAlternateAt(System.String)
Gets a dictionary record by alternate name.
name: The alternate name.
Returns: Returns a dictionary record id by alternate name.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: An exception is thrown if the alternate name is empty.

Autodesk.Aec.DatabaseServices.Dictionary.NameAlternateAt(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the alternate name of a dictionary record specified by the id.
id: The id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: An exception is thrown if the alternate name is empty.

Autodesk.Aec.DatabaseServices.Dictionary.Records
Gets the collection of record ids.
Returns: Returns the collection of record ids.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.NamesInUse
Gets the record names in use.
Returns: Returns the record names in use.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.AddNewRecord(System.String,Autodesk.Aec.DatabaseServices.DictionaryRecord)
Adds a new record.
name: The name.
newRecord: The dictionary record.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.Has(System.String,Autodesk.AutoCAD.DatabaseServices.Transaction)
Determines if the record exists.
name: The name.
trans: The transaction.
Returns: Returns true if the record exists.

Autodesk.Aec.DatabaseServices.Dictionary.Rename(System.String,System.String,Autodesk.AutoCAD.DatabaseServices.Transaction)
Renames a record.
oldName: The old name.
newName: The new name.
trans: The transaction.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.NewEntry
Creates a new dictionary record.
Returns: Returns a new dictionary record.
Remarks: SetToStandard and SubSetDatabaseDefaults are automatically called on the returned DictionaryRecord.

Autodesk.Aec.DatabaseServices.Dictionary.CloneEntry(Autodesk.Aec.DatabaseServices.DictionaryRecord,System.String)
Clones a dictionary record.
copyFromRec: The existing record.
newName: The new name.
Returns: Returns a cloned a dictionary record.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.Dictionary.DisplayName
Gets the display name.
Returns: Returns the display name.

Autodesk.Aec.DatabaseServices.Dictionary.DictionaryId
Gets the id.
Returns: Returns the id.

Autodesk.Aec.DatabaseServices.Dictionary.RecordType
Gets the record type.
Returns: Returns the record type.

Autodesk.Aec.DatabaseServices.Dictionary.ObjectType
Gets the object type.
Returns: Returns the object type.

Autodesk.Aec.DatabaseServices.Dictionary.Database
Gets the database.
Returns: Returns the database.

Autodesk.Aec.DatabaseServices.Dictionary.InternalName
Gets the internal name.
Returns: Returns the internal name.

Autodesk.Aec.DatabaseServices.Dictionary.ExtraPurgeCheck(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Checks records that could be purged.
idsToPurge: The record ids to check.