Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection
Represents a collection of DisplayThemeComponentBase.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.Item(System.Int32)
Gets or sets the DisplayThemeComponentBase at the given index.
index: The index.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.Clear
Removes all items from the collection.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.Count
Returns the number of DisplayThemeComponents available on this collection.
Returns: Returns the number of DisplayThemeComponents available on this collection.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.Add(Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.IndexOf(Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.Remove(Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.Contains(Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.DisplayThemeComponentCollection.CopyTo(Autodesk.Aec.DatabaseServices.DisplayThemeComponentBase[],System.Int32)
Copies the collection to the array.
array: The DisplayThemeComponentBase array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.