Autodesk.Aec.DatabaseServices.LineWorkRule
Represents a line work rule.

Autodesk.Aec.DatabaseServices.LineWorkRule.#ctor
Initializes a new instance of the LineWorkRule class.

Autodesk.Aec.DatabaseServices.LineWorkRule.Color
Gets or sets the color.
Returns: The color.

Autodesk.Aec.DatabaseServices.LineWorkRule.FilterFlags
Gets or sets the filter flags.
Returns: The filter flags.

Autodesk.Aec.DatabaseServices.LineWorkRule.ComponentId
Gets or sets the component ID.
Returns: The component ID.

Autodesk.Aec.DatabaseServices.LineWorkRule.Description
Gets or sets the description of it.
Returns: The description of it.