Autodesk.Aec.DatabaseServices.Section2dStyle
Represents a section 2D style.

Autodesk.Aec.DatabaseServices.Section2dStyle.#ctor
Initializes a new instance of the Section2dStyle class.

Autodesk.Aec.DatabaseServices.Section2dStyle.LineWorkComponents
Gets line work components.
Returns: The line work components.

Autodesk.Aec.DatabaseServices.Section2dStyle.LineWorkRules
Gets the line work rules.
Returns: The line work rules.

Autodesk.Aec.DatabaseServices.Section2dStyle.KeepAllHiddenLineWork
Determine if it keeps all hidden line work.
Returns: true if it keeps all hidden line work, false otherwise.

Autodesk.Aec.DatabaseServices.Section2dStyle.UseObjectDisplayProperty
Gets or sets to know if it uses object display properties or not.
Returns: True if it uses object display properties, otherwise false.