Autodesk.Aec.DatabaseServices.Section2dSegmentGroup
Represents a section 2D segment group.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroup.#ctor
Initializes a new instance of the Section2dSegmentGroup class.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroup.MaterialId
Gets or sets the material ID.
Returns: The material ID.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroup.SurfaceHatchingSegments
Gets the surface hatching segments.
Returns: The surface hatching segments.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroup.SectionHatchingSegments
Gets the section hatching segments.
Returns: The section hatching segments.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroup.LineWorkSegments
Gets the line work segments.
Returns: The line work segments.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroup.HasUserEdits
Determine if it has user edits.
Returns: true if it has user edits, false otherwise.

Autodesk.Aec.DatabaseServices.Section2dSegmentGroup.RemoveAllButUserEdits
Remove all but user edits.