Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition
Represents a nested grid edge definition.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.#ctor
Initializes a new instance of the NestedGridEdgeDefinition class.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.Id
Gets or sets the id of the nested grid edge.
Returns: Returns the id of the nested grid edge.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.Name
Gets or sets the name of the nested grid edge.
Returns: A string with the name of the nested grid edge.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.EdgeWidth
Gets or sets the width of the edge.
Returns: The width of the edge.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.EdgeDepth
Gets or sets the depth of the edge.
Returns: The depth of the edge.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.EdgeOffset
Gets or sets the edge offset.
Returns: The edge offset.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.DepthOffset
Gets or sets the depth offset.
Returns: The depth offset.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.StartOffset
Gets or sets the start offset distance.
Returns: The start offset distance.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.EndOffset
Gets or sets the end offset distance.
Returns: The end offset distance.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.ProfileId
Gets or sets the profile id.
Returns: The profile id.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.ScaleProfileX
Gets or sets the state of the X scale of the profile.
Returns: true if profile is scaled in X, false otherwise.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.ScaleProfileY
Gets or sets the state of the Y scale of the profile.
Returns: true if profile is scaled in Y, false otherwise.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.CleanupInternalEdges
Gets or sets the state of the Cleanup Internal Edges flag.
Returns: The state.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.MirrorProfileX
Gets or sets the state of the mirroring in X of the profile.
Returns: true if profile is mirrored in X, false otherwise.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.MirrorProfileY
Gets or sets the state of the mirroring in Y of the profile.
Returns: true if profile is mirrored in Y, false otherwise.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.ProfileRotation
Gets or sets the rotation angle of the profile.
Returns: The rotation angle.

Autodesk.Aec.DatabaseServices.NestedGridEdgeDefinition.MaterialId
Gets or sets the material id for this grid edge definition.
Returns: The material id.