Autodesk.Aec.Modeler.VertexCollection
Represents a collection of Vertexs.

Autodesk.Aec.Modeler.VertexCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.VertexCollection.Item(System.Int32)
Gets or sets the Vertex at the given index.
index: The index.

Autodesk.Aec.Modeler.VertexCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.VertexCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.VertexCollection.Count
Returns the number of Vertexs available on this collection.
Returns: Returns the number of Vertexs available on this collection.

Autodesk.Aec.Modeler.VertexCollection.Add(Autodesk.Aec.Modeler.Vertex)
Adds the specified item to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.VertexCollection.IndexOf(Autodesk.Aec.Modeler.Vertex)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.VertexCollection.Insert(System.Int32,Autodesk.Aec.Modeler.Vertex)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.

Autodesk.Aec.Modeler.VertexCollection.Remove(Autodesk.Aec.Modeler.Vertex)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.Modeler.VertexCollection.Contains(Autodesk.Aec.Modeler.Vertex)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.VertexCollection.CopyTo(Autodesk.Aec.Modeler.Vertex[],System.Int32)
Copies the collection to the array.
array: The Vertex array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.