Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance
Represents a multi view block view instance.
Remarks: This class is responsible for storing and synchronizing attribute instances with the block definition they came from. It also maintains an offset that may be applied to this particular block.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.#ctor
Initializes a new instance of the MultiViewBlockViewInstance class.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.BlockId
Gets or sets the block id.
Returns: Returns the block id.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.Offset
Gets or sets the block offset.
Returns: Returns the block offset.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.NeedsAttributeUpdate
Gets the upcoming update status of the attributes.
Returns: true if attributes will need updating, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Looks ahead and sees if the attributes need to be updated. Try to save unnecessary updates so we don't force a massive chain of events just to make sure we are in sync with other data.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.EnsureConsistentAttributes
Ensures that the attributes are consistent.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Ensures that any missing attributes are added to our block definition, and removes all attributes from our view block that are not actually in the block definition.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.ResetAttributes(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Resets all non-constant attributes definitions.
blockId: The block table record id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.NeedsAttributeUpdateFullCheck(System.Boolean)
Does a detailed checking of all attributes and their properties to see if an update is needed. Attribute width is ignored.
includeTextStyle: true to include checking of text style, false otherwise.
Returns: true if update is needed, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.NeedsAttributeUpdateFullCheckIncludeWidth(System.Boolean)
Does a detailed checking of all attributes and their properties to see if an update is needed. Includes attribute width.
includeTextStyle: true to include checking of text style, false otherwise.
Returns: true if update is needed, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.EnsureConsistentAttributesAndUpdateExisting(System.Boolean)
Ensures that the attributes are consistent, and updates them if they are not.
includeTextStyle: true to include checking of text style, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.EnsureConsistentAttributesAndUpdateExistingIncludeWidth(System.Boolean)
Ensures that the attributes are consistent, and updates them if they are not. Includes attribute width.
includeTextStyle: true to include checking of text style, false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockViewInstance.AttributeReferences
Gets the collection of MultiViewBlockAttributeReferences contained on this MultiViewBlockViewInstance.
Returns: Returns the collection of MultiViewBlockAttributeReferences contained on this MultiViewBlockViewInstance.