Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.#ctor
Initializes a new instance of the DBObjectRelationshipManager class.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DBObjectRelationshipManager class.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetObjectsOfType(Autodesk.AutoCAD.Runtime.RXClass,System.Boolean)
Gets all AEC objects in the database of the specified class type.
type: Inputs class type.
verifyObject: Inputs true if verifying objects are valid or not.
Returns: Returns all AEC objects in the database of the specified class type.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetObjectsOfTypeIncludingErased(Autodesk.AutoCAD.Runtime.RXClass,System.Boolean)
Gets all AEC objects in the database of the specified class type, including erased.
type: Inputs class type.
verifyObject: Inputs true if verifying objects are valid or not.
Returns: Returns all AEC objects in the database of the specified class type, including erased.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.ObjectsWithEnhancedReferences
Gets all AEC objects in the database that currently contain enhanced references.
Returns: Returns all AEC objects in the database that currently contain enhanced references.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.ObjectsWithEnhancedReferencesIncludingErased
Gets all AEC objects in the database that currently contain enhanced references, including erased.
Returns: Returns all AEC objects in the database that currently contain enhanced references, including erased.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.ObjectContainsEnhancedReferences(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets to know whether this DBObject contains enhanced references or not.
id: Inputs the object id.
Returns: Returns to true if this DBObject contains enhanced references, otherwise false.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetAllReferences(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets all references from and to the specified object.
object: Inputs the DBObject.
Returns: Returns all references from and to the specified object.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetAllReferencesIncludingErased(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets all references, including erased, from and to the specified object.
object: Inputs the DBObject.
Returns: Returns all references, including erased, from and to the specified object.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetReferencesToThisObject(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the ids of all objects referencing the specified object.
object: Inputs the referenced DBObject.
Returns: Returns the ids of all objects referencing the specified object.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetReferencesToThisObjectIncludeErased(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets the ids of all objects, including erased, referencing the specified object.
object: Inputs the referenced DBObject.
Returns: Returns the ids of all objects, include erased, referencing the specified object.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetReferencesToThisObjectRecursive(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Int32,System.Boolean)
Gets all objects referencing this object plus all other objects referencing those objects, plus all objects referencing those objects, etc. recursively.
object: Inputs the referenced DBObject.
relationshipTypeFilter: Inputs the relationship type to filter objects.
includeFilter: Inputs true or false to allow user to specify a relationship type or not.
Returns: Returns all objects referencing this object plus all other objects referencing those objects, plus all objects referencing those objects, etc. recursively.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetReferencesToThisObjectRecursiveIncludeErased(Autodesk.AutoCAD.DatabaseServices.DBObject,System.Int32,System.Boolean)
Gets all objects, including erased, referencing this object plus all other objects referencing those objects, plus all objects referencing those objects, etc. recursively.
object: Inputs the referenced DBObject.
relationshipTypeFilter: Inputs the relationship type to filter objects.
includeFilter: Inputs true or false to allow user to specify a relationship type or not.
Returns: Returns all objects, including erased, referencing this object plus all other objects referencing those objects, plus all objects referencing those objects, etc. recursively.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetReferencesFromThisObject(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets all objects that the specified object is referencing.
object: Inputs the referencing DBObject.
Returns: Returns all objects that the specified object is referencing.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetReferencesFromThisObjectIncludeErased(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets all objects that the specified object is referencing, including erased.
object: Inputs the referencing DBObject.
Returns: Returns all objects that the specified object is referencing, including erased.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetClassReferencesToThisObject(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets all class references to this object.
object: Inputs the referenced DBObject.
Returns: Returns all class references to this object.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.GetClassReferencesToThisObjectIncludErased(Autodesk.AutoCAD.DatabaseServices.DBObject)
Gets all class references, including erased,  to this object.
object: Inputs the referenced DBObject.
Returns: Returns all class references, including erased, to this object.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.IsNotificationSuppressed
Indicates whether or not notification is currently suppressed.
Returns: Returns true if notification is currently suppressed, otherwise false.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.SupressNotificationOn
Supress the notification on.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.SupressNotificationOff
Supress the notification off.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.Database
Gets the database that owned by this DBObjectRelationshipManager.
Returns: Returns the database that owned by this DBObjectRelationshipManager.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.ForceUpdate
Walks through all AEC derived entities and tells them to update themselves in the graph.
Throws System.Exception: System.Exception.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager.ForceUpdate(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Walks through all AEC derived entities contained in ObjectIdCollection and tells them to update themselves in the graph.
updateIds: Inputs the ObjectIdCollection for update.
Throws System.Exception: System.Exception.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.DBObjectRelationshipManager
Represents a class of manager of relationships.