Autodesk.Aec.DatabaseServices.CurveZOffsetToType
Defines identifiers that indicate offset to types.

Autodesk.Aec.DatabaseServices.CurveZOffsetToType.ToTop
Measure to the top of the anchored object.

Autodesk.Aec.DatabaseServices.CurveZOffsetToType.ToCenter
Measure to the center of the anchored object.

Autodesk.Aec.DatabaseServices.CurveZOffsetToType.ToBottom
Measure to the bottom of the anchored object.