Autodesk.Aec.DatabaseServices.LayoutGrid2dNode
Represents a layout grid 2d node.

Autodesk.Aec.DatabaseServices.LayoutGrid2dNode.#ctor
Initializes a new instance of the LayoutGrid2dNode class.

Autodesk.Aec.DatabaseServices.LayoutGrid2dNode.VPosition
Gets or sets the node position on the V axis.
Returns: Returns the node position on the V axis.