Autodesk.Aec.DatabaseServices.GridAssemblyCustomDefinition
Represents a grid assembly custom definition.

Autodesk.Aec.DatabaseServices.GridAssemblyCustomDefinition.#ctor
Initializes a new instance of the GridAssemblyCustomDefinition class.

Autodesk.Aec.DatabaseServices.GridAssemblyCustomDefinition.CustomGridDefinition
Gets or sets the custom grid.
Returns: Returns the custom grid, or null if none was set.