Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection
Represents a collection of grid assembly interferences.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.Count
Returns the number of GridAssemblyInterference available on this collection.
Returns: Returns the number of GridAssemblyInterference available on this collection.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.CopyTo(Autodesk.Aec.DatabaseServices.GridAssemblyInterference[],System.Int32)
Copies the collection to the array.
array: The GridAssemblyInterference array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.Item(System.Int32)
Gets or sets the interference at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.Add(Autodesk.Aec.DatabaseServices.GridAssemblyInterference)
Adds an interference to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.Contains(Autodesk.Aec.DatabaseServices.GridAssemblyInterference)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.IndexOf(Autodesk.Aec.DatabaseServices.GridAssemblyInterference)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.GridAssemblyInterference)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.Remove(Autodesk.Aec.DatabaseServices.GridAssemblyInterference)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.RemoveId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the specified item (via object id) from the collection.
id: The object id of the item to remove.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridAssemblyInterferenceCollection.Clear
Removes all items from the collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.