Autodesk.Aec.DatabaseServices.DivisionDirection
Grid division direction.

Autodesk.Aec.DatabaseServices.DivisionDirection.AlongXAxis
Direction is along X axis.

Autodesk.Aec.DatabaseServices.DivisionDirection.AlongYAxis
Direction is along Y axis.