Autodesk.Aec.DatabaseServices.DictionaryListDefinition
Represents a list definition dictionary.

Autodesk.Aec.DatabaseServices.DictionaryListDefinition.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryListDefinition class using the specified database.
db: The database where the list definition dictionary is created from.

Autodesk.Aec.DatabaseServices.DictionaryListDefinition.GetStandardDefinition(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard definition of the list definition dictionary.
database: The database from where to get the standard definition.
Returns: The standard definition of the list definition dictionary.