Autodesk.Aec.Modeler.Face
Represents a Face.

Autodesk.Aec.Modeler.Face.#ctor
Initializes a new instance of the Face class.

Autodesk.Aec.Modeler.Face.#ctor(Autodesk.Aec.Modeler.Body)
Initializes a new instance of the Face class using the specified body.
body: Input the body.

Autodesk.Aec.Modeler.Face.#ctor(Autodesk.Aec.Modeler.Surface,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the Face class using the specified surface and body.
surface: Input the surface.
body: Input the body.

Autodesk.Aec.Modeler.Face.#ctor(Autodesk.Aec.Modeler.Edge,Autodesk.Aec.Modeler.Surface,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the Face class using the specified edge, surface, and body.
edge: Input the edge.
surface: Input the surface.
body: Input the body.

Autodesk.Aec.Modeler.Face.#ctor(Autodesk.AutoCAD.Geometry.CircularArc3d,Autodesk.Aec.Modeler.DirectionType,System.Int32,Autodesk.Aec.Modeler.Body)
Creates a circular face.
circle: Input the circle.
type: Input the direction type.
approximation: Input the approximation of the approximation of the whole 2*pi angle.
body: Input the body.

Autodesk.Aec.Modeler.Face.Modified
Modifies the face in some ways.

Autodesk.Aec.Modeler.Face.Surface
Gets or sets the surface of the face.
Returns: Returns the surface of the face.

Autodesk.Aec.Modeler.Face.FaceColor
Gets or sets the color of this face.
Returns: Returns the color of the face.

Autodesk.Aec.Modeler.Face.Attribute
Gets or sets the customized attribute of the face.
Returns: Returns the customized attribute of the face.

Autodesk.Aec.Modeler.Face.SetSpecifiedColor(Autodesk.Aec.Modeler.ColorType,System.Boolean,System.Boolean)
Sets the specified color of the face.
value: Input the color type of the face.
edgesAlso: True if sets the color of the edges.
partnerEdgesAlso: True if sets the color of the bridge edges.

Autodesk.Aec.Modeler.Face.SetSpecifiedColor(Autodesk.Aec.Modeler.ColorType,System.Boolean)
Sets the specified color of the face.
value: Input the color type of the face.
edgesAlso: True if sets the color of the edges.

Autodesk.Aec.Modeler.Face.Negate
Sets the face to be nagative.

Autodesk.Aec.Modeler.Face.Paint(Autodesk.Aec.Modeler.Body,Autodesk.Aec.Modeler.ColorType,System.Boolean,System.Boolean)
Paints the face with specified color.
body: Input the owning body.
color: Input the color type.

Autodesk.Aec.Modeler.Face.Paint(Autodesk.Aec.Modeler.Body,Autodesk.Aec.Modeler.ColorType,System.Boolean)
Paints the face with specified color.
body: Input the owning body.
color: Input the color type.

Autodesk.Aec.Modeler.Face.Paint(Autodesk.Aec.Modeler.Body,Autodesk.Aec.Modeler.ColorType)
Paints the face with specified color.
body: Input the owning body.
color: Input the color type.

Autodesk.Aec.Modeler.Face.PerimeterOfMass(Autodesk.Aec.Modeler.Body,System.Boolean,System.Boolean)
Gets the perimeter of the mass.
body: Input the body of the mass.
Returns: Returns the perimeter of the mass.

Autodesk.Aec.Modeler.Face.AreaOfMass(Autodesk.Aec.Modeler.Body,System.Boolean,System.Boolean)
Gets the area of the mass.
body: Input the body of the mass.
Returns: Returns the area of the mass.

Autodesk.Aec.Modeler.Face.CentroidOfMass(Autodesk.Aec.Modeler.Body,System.Boolean,System.Boolean)
Gets the centroid of the mass.
body: Input the body of the mass.
Returns: Returns the centroid of the mass.

Autodesk.Aec.Modeler.Face.Area
Gets the area of the face.
Returns: Returns the area of the face.

Autodesk.Aec.Modeler.Face.Lift(Autodesk.AutoCAD.Geometry.Matrix3d,System.Boolean,Autodesk.Aec.Modeler.Body)
Lifts the face from its current location to a new location.
transform: Input the transformation matrix.
checkPlanarity: True if checking the planarity of the lifted face.
owningBody: Input the owning body.

Autodesk.Aec.Modeler.Face.ExtractAllLoops
Extracts all edge loops of the face, skipping the bridge edges.
Returns: Returns the extracted edge loops of the face.

Autodesk.Aec.Modeler.Face.Split(Autodesk.Aec.Modeler.Edge,Autodesk.Aec.Modeler.Edge,Autodesk.Aec.Modeler.Body)
Splits the face at the vertice of two supplied edges.
edgeA: Input the first edge on the face to get vertex.
edgeB: Input the second edge on the face to get vertex.
body: Input the owning body.
Returns: Returns the newly created face by spliting.

Autodesk.Aec.Modeler.Face.InsertHoles(Autodesk.Aec.Modeler.Face[],Autodesk.Aec.Modeler.Body)
Inserts holes on the face.
holeFaces: Input the holes to insert on face.
body: Input the owning body.
Returns: Returns resulting faces after inserting holes.

Autodesk.Aec.Modeler.Face.DecomposeIntoContiguousFaces(Autodesk.Aec.Modeler.Body)
Decomposes this face into contiguous faces.
body: Input the owning body.
Returns: Returns an array of contiguous faces.

Autodesk.Aec.Modeler.Face.Plane
Gets the plane of the face.
Returns: Returns the plane of the face.

Autodesk.Aec.Modeler.Face.DeletePlane
Deletes the plane of the face.

Autodesk.Aec.Modeler.Face.DeleteInterval
Deletes the interval in the face.

Autodesk.Aec.Modeler.Face.DeleteProjectionInterval
Deletes the projection interval in the face.

Autodesk.Aec.Modeler.Face.IsPointInside(Autodesk.AutoCAD.Geometry.Point3d)
Gets to know whether speicified point is in this face.
point: Input the specified point.
Returns: True if the specified point is in this face.

Autodesk.Aec.Modeler.Face.IsPlanar(System.Double)
Gets to know whehter this face is planar.
epsilon: Input the epsilon value.
Returns: True if the face is planar.

Autodesk.Aec.Modeler.Face.IsSelfIntersecting
Gets to know whether this face is self intersecting.
Returns: True if this face is self intersecting.

Autodesk.Aec.Modeler.Face.Edges
Gets all edges in the face.