Autodesk.Aec.DatabaseServices.StreamBodyColorModeType
Stream body color mode type enumeration.

Autodesk.Aec.DatabaseServices.StreamBodyColorModeType.Ignore
Ignore body color.

Autodesk.Aec.DatabaseServices.StreamBodyColorModeType.UseAsColor
Use as color.

Autodesk.Aec.DatabaseServices.StreamBodyColorModeType.UseAsGsMarker
Use as gsmarker.

Autodesk.Aec.DatabaseServices.StreamBodyColorModeType.UseAsMapIndex
Use as map index.