Autodesk.Aec.Geometry.Ring
Represents a ring.

Autodesk.Aec.Geometry.Ring.#ctor
Initializes a new instance of the Ring class.

Autodesk.Aec.Geometry.Ring.#ctor(Autodesk.AutoCAD.Geometry.Point2dCollection)
Initializes a new instance of the Ring class using the specified point collection.
points: The points defining the ring.

Autodesk.Aec.Geometry.Ring.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for Ring.

Autodesk.Aec.Geometry.Ring.Void
Sets the IsVoid property.
Remarks: A void ring has a negative area.

Autodesk.Aec.Geometry.Ring.IsValidRing
Specifies if the ring is valid.
Returns: Returns true if the ring is valid.

Autodesk.Aec.Geometry.Ring.IsVoid
Specifies if the ring is void.
Returns: Returns the IsVoid property.
Remarks: A void ring has a negative area.

Autodesk.Aec.Geometry.Ring.Area
Specifies the area of the ring.
Returns: Returns the area of the ring.

Autodesk.Aec.Geometry.Ring.Centroid
Specifies the centroid of the ring.
Returns: Returns the centroid of the ring.

Autodesk.Aec.Geometry.Ring.PointInRing(Autodesk.AutoCAD.Geometry.Point2d)
Determines if the specified point is in the ring.
point: The test point.
Returns: Returns PointOnVoidRing, PointOnRing, PointOutsideRing, PointOutsideRing or kPointInRing.

Autodesk.Aec.Geometry.Ring.IsContainedBy(Autodesk.Aec.Geometry.Ring)
Determines if the ring is contained by the specified ring.
otherRing: The other ring.
Returns: Returns true if the ring is contained by the specified ring.

Autodesk.Aec.Geometry.Ring.GetExtrusion(Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Int32)
Calculates an extruded body from the ring.
direction: The extrusion direction.
deviation: The facet deviation.
maxFacetsPerSegment: The maximum number of facets per segment.
Returns: Returns an extruded body from the ring.

Autodesk.Aec.Geometry.Ring.GetFace(System.Double,System.Int32)
Calculates a face from the ring.
deviation: The facet deviation.
maxFacetsPerSegment: The maximum number of facets per segment.
Returns: Returns a face from the ring.

Autodesk.Aec.Geometry.Ring.IsCircle
Specifies if the ring is a circle.
Returns: Returns true if the ring is a circle.

Autodesk.Aec.Geometry.Ring.IsTopologicallyEquivalent(Autodesk.Aec.Geometry.Ring,System.Int32@)
Determines if the ring can be mapped to another ring.
otherRing: The other ring.
offset: The offset to get the rings to line up.
Returns: Returns true if the ring can be mapped to another ring.

Autodesk.Aec.Geometry.Ring.CalculateSegmentPositions(Autodesk.Aec.Geometry.ProfileExtrusionDirection,System.Boolean)
Calculates the position of each segment in the ring.
extrusionDirection: Determines the segment position.
calculateOnlyForNonMarked: Determines if marked rings are calculated.

Autodesk.Aec.Geometry.Ring.CalculateSegmentPositions(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.Aec.Geometry.ProfileExtrusionDirection,System.Boolean)
Calculates the position of each segment in the ring.
topLeft: Defines the quadrant lines.
bottomRight: Defines the quadrant lines.
extrusionDirection: Determines the segment position.
calculateOnlyForNonMarked: Determines if marked rings are calculated.

Autodesk.Aec.Geometry.Ring.ModifySegmentPositions(Autodesk.Aec.Geometry.SegmentPosition,Autodesk.Aec.Geometry.SegmentPosition)
Updates the specified segment positions of each segment of the ring.
oldSegmentPosition: The current segment position.
newSegmentPosition: The desired segment position.

Autodesk.Aec.Geometry.Ring.ModifySegmentPositions(Autodesk.Aec.Geometry.ProfileExtrusionDirection,Autodesk.Aec.Geometry.ProfileExtrusionDirection)
Updates the specified segment positions of each segment of the ring.
oldExtrusionDirection: The current extrusion direction.
newExtrusionDirection: The desired extrusion direction.

Autodesk.Aec.Geometry.Ring.MirrorSegmentPositions
Mirrors each segment of the ring.

Autodesk.Aec.Geometry.Ring.Segments
Returns the segment collection.
Returns: Returns the segment collection.