Autodesk.Aec.DatabaseServices.BlockReference
Represents a block reference.

Autodesk.Aec.DatabaseServices.BlockReference.#ctor
Initializes a new instance of the BlockReference class.

Autodesk.Aec.DatabaseServices.BlockReference.BlockDefId
Gets or sets the block definition id.
Returns: Returns the block definition id.

Autodesk.Aec.DatabaseServices.BlockReference.Scale
Gets or sets the scale.
Returns: Returns the scale.