Autodesk.Aec.Modeler.CylinderSurface
Represents a cylinder surface.

Autodesk.Aec.Modeler.CylinderSurface.#ctor
Initializes a new instance of the CylinderSurface class.

Autodesk.Aec.Modeler.CylinderSurface.#ctor(Autodesk.AutoCAD.Geometry.LineSegment3d,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the CylinderSurface class using the specified axis, radius, approx and body.
axis: The axis.
radius: The radius.
approx: The approx.
body: The body.

Autodesk.Aec.Modeler.CylinderSurface.#ctor(Autodesk.AutoCAD.Geometry.LineSegment3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the CylinderSurface class using the specified axis, start direction, radius, approx and body.
axis: The axis.
startDirection: The start direction.
radius: The radius.
approx: The approx.
body: The body.

Autodesk.Aec.Modeler.CylinderSurface.Radius
Gets the radius.
Returns: The radius.

Autodesk.Aec.Modeler.CylinderSurface.Approx
Gets the approx.
Returns: The approx.