Autodesk.Aec.DatabaseServices.EditingContext
Editing context enumeration.

Autodesk.Aec.DatabaseServices.EditingContext.ClosedShape
Closed shape.

Autodesk.Aec.DatabaseServices.EditingContext.OpenShape
Open shape.