Autodesk.Aec.DatabaseServices.DisplayComponentEntity
Represents a display component entity base class.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.#ctor
Initializes a new instance of the DisplayComponentEntity class.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.IsVisible
Gets or sets if it is visible.
Returns: True if it is visible, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.LayerId
Gets or sets layer id.
Returns: Layer id.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.Color
Gets or sets color.
Returns: Color.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.ColorIndex
Gets or sets color index.
Returns: Color index.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.LinetypeId
Gets or sets line type id.
Returns: Line type id.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.LineWeight
Gets or sets line weight.
Returns: Line weight.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.LinetypeScale
Gets or sets line type scale.
Returns: Line type scale.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.GetPlotStyleNameId()
Gets plot style name id. Please use it together with DisplayComponentEntity.GetPlotStyleNameType.
Returns: Plot style name id.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.GetPlotStyleNameType()
Gets plot style name type.  Please use it together with DisplayComponentEntity.GetPlotStyleNameId.
Returns: Plot style name type.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.SetPlotStyleName(Autodesk.AutoCAD.DatabaseServices.PlotStyleNameType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets plot style name.
type: Plot style name type.
id: Plot style name id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.SetPlotStyleName(Autodesk.AutoCAD.DatabaseServices.PlotStyleNameType)
Sets plot style name.
type: Plot style name type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.ResetEnt
Reset entity.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.AllowByMaterial
Gets or sets if it is allow by material.
Returns: True if it is allow by material, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayComponentEntity.ByMaterial
Gets or sets if it is by material.
Returns: True if it is by material, false otherwise.