Autodesk.Aec.DatabaseServices.MaskBlockDefinition
Represents a mask block definition.

Autodesk.Aec.DatabaseServices.MaskBlockDefinition.#ctor
Initializes a new instance of the MaskBlockDefinition class.

Autodesk.Aec.DatabaseServices.MaskBlockDefinition.CutProfile
Gets or sets the cut profile.
Returns: Returns the cut profile.

Autodesk.Aec.DatabaseServices.MaskBlockDefinition.ExtraGraphicsBlockId
Gets or sets the extra graphics block id.
Returns: Returns the extra graphics block id.