Autodesk.Aec.DatabaseServices.StreamCurves
Represents stream curves.

Autodesk.Aec.DatabaseServices.StreamCurves.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the StreamCurves class using the specified database.
db: The database.

Autodesk.Aec.DatabaseServices.StreamCurves.IgnoreHatch
Gets or sets whether hatch should be ignored.

Autodesk.Aec.DatabaseServices.StreamCurves.SetIgnoreText
Sets whether text should be ignored.

Autodesk.Aec.DatabaseServices.StreamCurves.CollectArcs
Gets or sets whether arcs should be collected.

Autodesk.Aec.DatabaseServices.StreamCurves.ApplySurfaceHatching
Gets or sets whether surface hatching is applied.

Autodesk.Aec.DatabaseServices.StreamCurves.CollectDisplayPropertiesInfomationFor2dSection
Gets or sets if it collects display properties information for 2d section.

Autodesk.Aec.DatabaseServices.StreamCurves.CollectDisplayPropertiesForCurves(System.Boolean)
Collects display properties for curves.
curveIsALine: True if the curve is a line.

Autodesk.Aec.DatabaseServices.StreamCurves.DisplayComponentEntityLines
Gets the line display component entities.

Autodesk.Aec.DatabaseServices.StreamCurves.DisplayComponentEntityArcs
Gets arc display component entities.

Autodesk.Aec.DatabaseServices.StreamCurves.Lines
Gets the collected lines.

Autodesk.Aec.DatabaseServices.StreamCurves.Arcs
Gets the collected arcs.

Autodesk.Aec.DatabaseServices.StreamCurves.NestedEntityFilter
Gets or sets the nested entity filter.
Returns: The nested entity filter.

Autodesk.Aec.DatabaseServices.StreamCurves.IgnoreText
Gets whether text should be ignored.

Autodesk.Aec.DatabaseServices.StreamCurves.BackfaceCullSurfaceHatching
Gets or sets whether BackfaceCullSurfaceHatching should be turned on.
Returns: Boolean value indicates whether BackfaceCullSurfaceHatching should be turned on.