Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutCell
Represents an entity to a layout cell anchor.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutCell.#ctor
Initializes a new instance of the AnchorEntityToLayoutCell class.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutCell.ResizeOffset
Gets or sets the resize offset value.
Returns: Returns the resize offset value.

Autodesk.Aec.DatabaseServices.AnchorEntityToLayoutCell.ApplyResize
Gets or sets the apply resize value.
Returns: Returns the apply resize value.