Autodesk.Aec.Modeler.MorphingMap
Represents a class of morphing map.

Autodesk.Aec.Modeler.MorphingMap.#ctor
Initializes a new instance of the MorphingMap class.

Autodesk.Aec.Modeler.MorphingMap.Null
Gets the null object of morphing map.

Autodesk.Aec.Modeler.MorphingMap.IsNull
Gets to know whether this morphing map is null or not.
Returns: True if morphing map is null.

Autodesk.Aec.Modeler.MorphingMap.IsIdentity
Gets to know whether this morphing map is identity.
Returns: True if the morphing map is identity.

Autodesk.Aec.Modeler.MorphingMap.SetToExplicitIdentityMap(System.Int32)
Sets the morphing map to be explicitly identity.
numberOfEdges: Input the number of edges.

Autodesk.Aec.Modeler.MorphingMap.CreateFromTwoPointLoops(Autodesk.AutoCAD.Geometry.Point2dCollection,Autodesk.AutoCAD.Geometry.Point2dCollection)
Creates the morphing map from two point loops.
pointLoopA: Input the first point loop.
pointLoopB: Input the second point loop.

Autodesk.Aec.Modeler.MorphingMap.Initialize
Initializes the whole morphing map.

Autodesk.Aec.Modeler.MorphingMap.Print
Prints the morphing map.

Autodesk.Aec.Modeler.MorphingMap.Normalize(System.Int32,System.Int32)
Normalizes the whole morphing map.
numberOfEdgesA: Input the number of edges A.
numberOfEdgesB: Input the number of edges B.

Autodesk.Aec.Modeler.MorphingMap.RemapIndices(Autodesk.AutoCAD.Geometry.IntegerCollection,Autodesk.AutoCAD.Geometry.IntegerCollection)
Remaps both the from and to indices of the map.
fromIndexMap: Input the from index collection.
toIndexMap: Input the to index collection.

Autodesk.Aec.Modeler.MorphingMap.Clone
Clones the wrapped object.

Autodesk.Aec.Modeler.MorphingMap.DeleteUnmanagedObject
Deletes the unmanaged object.
Returns: void.

Autodesk.Aec.Modeler.MorphingMap.Elements
Gets the collection of morphing map elements.
Returns: Returns the collection of morphing map elements.