Autodesk.Aec.Modeler.UnspecifiedSurface
Represents an unspecified surface.

Autodesk.Aec.Modeler.UnspecifiedSurface.#ctor
Initializes a new instance of the UnspecifiedSurface class.

Autodesk.Aec.Modeler.UnspecifiedSurface.#ctor(Autodesk.Aec.Modeler.Body)
Initializes a new instance of the UnspecifiedSurface class using the specified body.
body: The body.