Autodesk.Aec.DatabaseServices.LayoutGrid3dNode
Represents a layout grid 3d node.

Autodesk.Aec.DatabaseServices.LayoutGrid3dNode.#ctor
Initializes a new instance of the LayoutGrid3dNode class.

Autodesk.Aec.DatabaseServices.LayoutGrid3dNode.WPosition
Gets or sets the node position on the W axis.
Returns: Returns the node position.