Autodesk.Aec.Geometry.CompoundSegment2d
Represents a compound segment 2d.

Autodesk.Aec.Geometry.CompoundSegment2d.#ctor(Autodesk.AutoCAD.Geometry.Curve2d)
Initializes a new instance of the CompoundSegment2d class using the specified curve.

Autodesk.Aec.Geometry.CompoundSegment2d.GraphiSystemMarker
Returns the graphic system marker.
Returns: Returns the graphic system marker.
Remarks: Applies to the plan view display of a wall.

Autodesk.Aec.Geometry.CompoundSegment2d.GraphicSystemMarker
Sets the graphic system marker.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Applies to the plan view display of a wall.