Autodesk.Aec.DatabaseServices.AnchorContext
Anchor context for the Nested Grid Infill Definition.

Autodesk.Aec.DatabaseServices.AnchorContext.NewAttachment
Object is to be attached.

Autodesk.Aec.DatabaseServices.AnchorContext.AlreadyAttached
Object is already attached.