Autodesk.Aec.DatabaseServices.DictionaryMassElementStyle
Represents a mass element style dictionary.

Autodesk.Aec.DatabaseServices.DictionaryMassElementStyle.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryMassElementStyle class using the specified database.
db: The database.

Autodesk.Aec.DatabaseServices.DictionaryMassElementStyle.GetStandardStyle(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the standard style id.
db: The database.
Returns: Returns the standard style id.