Autodesk.Aec.Modeler.RayBodyIntersection
RayBodyIntersection enumeration.

Autodesk.Aec.Modeler.RayBodyIntersection.RayDoesNotIntersect
RayDoesNotIntersect.

Autodesk.Aec.Modeler.RayBodyIntersection.RayPointAtVertex
RayPointAtVertex.

Autodesk.Aec.Modeler.RayBodyIntersection.RayPointOnEdge
RayPointOnEdge.

Autodesk.Aec.Modeler.RayBodyIntersection.RayPointInFace
RayPointInFace.

Autodesk.Aec.Modeler.RayBodyIntersection.RayIntersectsVertex
RayIntersectsVertex.

Autodesk.Aec.Modeler.RayBodyIntersection.RayIntersectsEdge
RayIntersectsEdge.

Autodesk.Aec.Modeler.RayBodyIntersection.RayIntersectsFace
RayIntersectsFace.