Autodesk.Aec.DatabaseServices.GridUvRadial
Represents a Radial Grid.

Autodesk.Aec.DatabaseServices.GridUvRadial.#ctor
Initializes a new instance of the GridUvRadial class.

Autodesk.Aec.DatabaseServices.GridUvRadial.UInsideRadius
Gets or sets the U inside radius.
Returns: The U inside radius.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvRadial.VAxisAngle
Gets or sets the V axis angle.
Returns: The V axis angle.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvRadial.VAngleSpacing
Gets or sets the V angle spacing.
Returns: The V angle spacing.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvRadial.VStartAngleOffset
Input the V starting angle offset.
Returns: The V starting angle offset.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridUvRadial.VEndAngleOffset
Gets or sets the V end angle offset.
Returns: The V end angle offset.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.