Autodesk.Aec.DatabaseServices.DictionaryRecordAlternateNameTranslator
Represents a name translator.

Autodesk.Aec.DatabaseServices.DictionaryRecordAlternateNameTranslator.#ctor
Initializes a new instance of the DictionaryRecordAlternateNameTranslator class.

Autodesk.Aec.DatabaseServices.DictionaryRecordAlternateNameTranslator.Create(System.IntPtr,System.Boolean)
Creates a new instance of the DictionaryRecordAlternateNameTranslator class.
unmanagedPointer: Inputs the unmanaged pointer of DictionaryRecordAlternateNameTranslator object.
autoDelete: Inputs true if unmanaged object is destroyed by wrapper, otherwise false.