Autodesk.Aec.Modeler.MorphingMapElementCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Item
Gets or sets the MorphingMapElement at the given index.

Autodesk.Aec.Modeler.MorphingMapElementCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Clear
Removes all items from the collection.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Count
Returns the number of MorphingMapElements available on this collection.
Returns: Returns the number of MorphingMapElements available on this collection.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Add(Autodesk.Aec.Modeler.MorphingMapElement)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.Modeler.MorphingMapElementCollection.IndexOf(Autodesk.Aec.Modeler.MorphingMapElement)
Determines the index of the specified item.
item: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Insert(System.Int32,Autodesk.Aec.Modeler.MorphingMapElement)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
item: The item to insert.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Remove(Autodesk.Aec.Modeler.MorphingMapElement)
Removes the specified item from the collection.
item: The item to remove.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Contains(Autodesk.Aec.Modeler.MorphingMapElement)
Determines if the collection contains the specified item.
item: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.Modeler.MorphingMapElementCollection.CopyTo(Autodesk.Aec.Modeler.MorphingMapElement[],System.Int32)
Copies the collection to the array.
array: The MorphingMapElement array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Modeler.MorphingMapElementCollection
Represents a collection of MorphingMapElement.

Autodesk.Aec.Modeler.MorphingMapElementCollection.Item(System.Int32)
Gets or sets the MorphingMapElement at the given index.
index: The index.