Autodesk.Aec.DatabaseServices.DisplayRepresentationTData
Represents a class which is a place that the display representation can stick data related to the draw session of a given entity.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTData.#ctor
Initializes a new instance of the DisplayRepresentationTData class.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTData.MaskProfilePushCount
Gets or sets the count of mask profile push.
Returns: Returns the count of mask profile push.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTData.Properties
Gets or sets the display properties.
Returns: Returns the display properties.