Autodesk.Aec.DatabaseServices.SectionVertex
Represents a section vertex.

Autodesk.Aec.DatabaseServices.SectionVertex.#ctor
Initializes a new instance of the SectionVertex class.

Autodesk.Aec.DatabaseServices.SectionVertex.Location
Gets or sets the location.
Returns: The location point.