Autodesk.Aec.DatabaseServices.UnitType
Represents a unit type.

Autodesk.Aec.DatabaseServices.UnitType.#ctor
Initializes a new instance of the UnitType class.

Autodesk.Aec.DatabaseServices.UnitType.#ctor(Autodesk.Aec.BuiltInUnit,System.Int32)
Initializes a new instance of the UnitType class.
type: The units.
exponent: The exponent.

Autodesk.Aec.DatabaseServices.UnitType.#ctor(Autodesk.Aec.DatabaseServices.UnitType)
Initializes a new instance of the UnitType class.
value: The unit type.

Autodesk.Aec.DatabaseServices.UnitType.Status
Gets the status.
Returns: Returns the status.

Autodesk.Aec.DatabaseServices.UnitType.IsCompatible(Autodesk.Aec.DatabaseServices.UnitType)
Check if the unit type is compatible with another unit type.
value: The other unit type.
Returns: true, if compatible; false, otherwise.

Autodesk.Aec.DatabaseServices.UnitType.Type
Gets the type.
Returns: Returns the type.

Autodesk.Aec.DatabaseServices.UnitType.GetTypeDisplayName(System.Boolean)
Gets the type display name.
getLocalized: true, to return the localized name; false, otherwise.
Returns: Returns the type display name.

Autodesk.Aec.DatabaseServices.UnitType.InternalName
Gets the internal name.
Returns: Returns  the internal name.

Autodesk.Aec.DatabaseServices.UnitType.SingularName(System.Boolean)
Gets the singular name.
getLocalized: true, to return the localized name; false, otherwise.
Returns: Returns the singular name.

Autodesk.Aec.DatabaseServices.UnitType.PluralName(System.Boolean)
Gets the plural name.
getLocalized: true, to return the localized name; false, otherwise.
Returns: Returns the plural name.

Autodesk.Aec.DatabaseServices.UnitType.IsMetric
Gets the value that indicates if the unit type is metric.
Returns: Returns the value that indicates if the unit type is metric.

Autodesk.Aec.DatabaseServices.UnitType.IsImperial
Gets the value that indicates if the unit type is imperial.
Returns: Returns the value that indicates if the unit type is metric.

Autodesk.Aec.DatabaseServices.UnitType.IsSimpleUnit(Autodesk.Aec.BuiltInUnit)
Gets the value that indicates if the unit type is simple.
unit: The built in units.
Returns: Returns the value that indicates if the unit type is simple.