Autodesk.Aec.DatabaseServices.LayoutGrid2dCell
Represents a layout grid 2d cell.

Autodesk.Aec.DatabaseServices.LayoutGrid2dCell.#ctor
Initializes a new instance of the LayoutGrid2dCell class.

Autodesk.Aec.DatabaseServices.LayoutGrid2dCell.UIndex
Gets or sets the index on the U axis.
Returns: Returns the index on the U axis.

Autodesk.Aec.DatabaseServices.LayoutGrid2dCell.VIndex
Gets or sets the index on the V axis.
Returns: Returns the index on the V axis.