Autodesk.Aec.DatabaseServices.DisplayConfigurationImageIndex
DisplayConfigurationImageIndex enumeration.

Autodesk.Aec.DatabaseServices.DisplayConfigurationImageIndex.FirstImage
Index of first image.

Autodesk.Aec.DatabaseServices.DisplayConfigurationImageIndex.MultiView
Index of multi-view.

Autodesk.Aec.DatabaseServices.DisplayConfigurationImageIndex.MultiViewDefault
Index of default multi-view.

Autodesk.Aec.DatabaseServices.DisplayConfigurationImageIndex.FixedView
Index of fixed view.

Autodesk.Aec.DatabaseServices.DisplayConfigurationImageIndex.FixedViewDefault
Index of default fixed view.

Autodesk.Aec.DatabaseServices.DisplayConfigurationImageIndex.LastImage
Index of last image.