Autodesk.Aec.DatabaseServices.GridCustom
Represents a grid custom.

Autodesk.Aec.DatabaseServices.GridCustom.#ctor
Initializes a new instance of the GridCustom class.

Autodesk.Aec.DatabaseServices.GridCustom.LayoutNodeIds
Gets a collection of layout node ids associated with this grid custom.
Returns: Returns a collection of layout node ids associated with this grid custom.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.GridCustom.GetLayoutNodeLocation(System.Int32)
Gets the layout node location for the node with given id.
nodeId: The node id.
Returns: The layout node location for the node with given id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if given id was not found, or if there is no main segment with given id.

Autodesk.Aec.DatabaseServices.GridCustom.GetLayoutNodeCoordinateSystem(System.Int32)
Gets the layout node coordinate system for the node with given id.
nodeId: The node id.
Returns: The layout node coordinate system for the node with given id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if given id was not found, or if there is no main segment with given id.

Autodesk.Aec.DatabaseServices.GridCustom.LayoutCellIds
Gets a collection of layout cell ids associated with this grid custom.
Returns: Returns a collection of layout cell ids associated with this grid custom.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: A layout cell exists in each closed region of the grid.

Autodesk.Aec.DatabaseServices.GridCustom.GetLayoutCellProfile(System.Int32,Autodesk.AutoCAD.Geometry.Matrix3d@)
Gets the layout cell profile and its coordinate system.
cellId: The cell id.
profileToWcs: The coordinate system of the layout cell profile.
Returns: The cell profile, or null if none was available.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if id was not found, or if there are no grid cells available.

Autodesk.Aec.DatabaseServices.GridCustom.UpdateParameters
Updates all nodes and cells of this grid custom.

Autodesk.Aec.DatabaseServices.GridCustom.DeleteTransientData
Deletes all transient data (segments, nodes, and cells)

Autodesk.Aec.DatabaseServices.GridCustom.Segments
Gets the custom grid segments.
Returns: The custom grid segments.

Autodesk.Aec.DatabaseServices.GridCustom.NodeCount
Gets the node count.
Returns: The node count.

Autodesk.Aec.DatabaseServices.GridCustom.CustomGridNodeAt(System.Int32)
Gets the node at the given index.
index: The index.
Returns: The node at the given index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridCustom.CustomGridNode(System.Int32)
Gets the node that has the given id.
id: The id.
Returns: The node that has the given id, or null if none was found.

Autodesk.Aec.DatabaseServices.GridCustom.CellCount
Gets the cell count.
Returns: The cell count.

Autodesk.Aec.DatabaseServices.GridCustom.CustomGridCellAt(System.Int32)
Gets the cell at the index given.
index: The index.
Returns: The cell at the index given.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.GridCustom.CustomGridCell(System.Int32)
Gets the cell that has the given id.
id: The id.
Returns: The cell that has the given id, or null if none was found.

Autodesk.Aec.DatabaseServices.GridCustom.RequiresUpdate
Gets or sets the update status.
Returns: true if the grid requires updating, false otherwise.

Autodesk.Aec.DatabaseServices.GridCustom.PersistentSolution
Gets or sets the status of the solution.
Returns: true if persistent, false otherwise.

Autodesk.Aec.DatabaseServices.GridCustom.TransientExteriorCell
Gets the transient exterior cell.
Returns: The transient exterior cell, or null if none is available.
Remarks: The transient exterior cell is set after an UpdateParameter() call (for non-persistent solutions).