Autodesk.Aec.DatabaseServices.SectionSegment
Represents a section segment.

Autodesk.Aec.DatabaseServices.SectionSegment.#ctor
Initializes a new instance of the SectionSegment class.

Autodesk.Aec.DatabaseServices.SectionSegment.IsMergedSegment
Determine if it is merged segment.
Returns: true if it is merged segment, false otherwise.

Autodesk.Aec.DatabaseServices.SectionSegment.MarkedFromEdit
Determine if it is marked from edit.
Returns: true if it is marked from edit, false otherwise.

Autodesk.Aec.DatabaseServices.SectionSegment.IsAPoint
Determine if it is a point.
Returns: true if it is a point, false otherwise.

Autodesk.Aec.DatabaseServices.SectionSegment.ComponentId
Gets or sets the component ID.
Returns: The component ID.

Autodesk.Aec.DatabaseServices.SectionSegment.StartPoint
Gets or sets the start point.
Returns: The start point.

Autodesk.Aec.DatabaseServices.SectionSegment.EndPoint
Gets or sets the end point.
Returns: The end point.

Autodesk.Aec.DatabaseServices.SectionSegment.LineWorkType
Gets the line work type.
Returns: The line work type.