Autodesk.Aec.DatabaseServices.ViewDependentCombination.SetId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the  view dependent view set id.

Autodesk.Aec.DatabaseServices.ViewDependentCombination.Direction(Autodesk.AutoCAD.Geometry.Vector3d)
Sets the view dependent view direction.

Autodesk.Aec.DatabaseServices.ViewDependentCombination.op_Equality(Autodesk.Aec.DatabaseServices.ViewDependentCombination, Autodesk.Aec.DatabaseServices.ViewDependentCombination)
Compares equality of two objects of ViewDependentCombination type.

Autodesk.Aec.DatabaseServices.ViewDependentCombination.op_Inequality(Autodesk.Aec.DatabaseServices.ViewDependentCombination, Autodesk.Aec.DatabaseServices.ViewDependentCombination)
Compares inequality of two objects of ViewDependentCombination type.