Autodesk.Aec.DatabaseServices.AnchorToReference
Represents an anchor to a reference.

Autodesk.Aec.DatabaseServices.AnchorToReference.#ctor
Initializes a new instance of the AnchorToReference class.

Autodesk.Aec.DatabaseServices.AnchorToReference.IsReferenced(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.RelationType@)
Determines if the specified entity is referenced.
id: The entity.
relationType: The type of relation.
Returns: Returns true if the specified entity is referenced.

Autodesk.Aec.DatabaseServices.AnchorToReference.AppendReferenceObject(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.RelationType)
Adds the passed in object as a reference of this anchor.
id: The referenced object.
relationType: The type of relation.

Autodesk.Aec.DatabaseServices.AnchorToReference.RemoveReferenceObject(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the passed in id from the list of references.
id: The referenced object.

Autodesk.Aec.DatabaseServices.AnchorToReference.RemoveAllReferenceObjects
Removes all references.

Autodesk.Aec.DatabaseServices.AnchorToReference.ReferenceObjectCount
Specifies the number of referenced objects.
Returns: Returns number of referenced objects.
Remarks: This value is usually 1.

Autodesk.Aec.DatabaseServices.AnchorToReference.GetReferenceObjectAt(System.Int32,Autodesk.Aec.DatabaseServices.RelationType@)
Determines the referenced object and relation type at the current index.
index: The index of the referenced object.
relationType: The type of relation.
Returns: Returns the referenced object and relation type at the current index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorToReference.SingleReferenceId
Specifies the Id of the single object referenced.
Returns: Returns the Id of the single object referenced, or null.

Autodesk.Aec.DatabaseServices.AnchorToReference.GetSingleReference(Autodesk.Aec.DatabaseServices.RelationType@)
Specifies the first referenced object and its relation type.
relationType: The type of relation.
Returns: Returns the first referenced object and its relation type.
Remarks: Returns null and NotApplicable if there is no referenced object.

Autodesk.Aec.DatabaseServices.AnchorToReference.SetSingleReference(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.RelationType)
Sets one reference to the specified object.
id: The referenced object Id.
relationType: The type of relation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorToReference.MirrorParameters(System.Boolean,Autodesk.Aec.DatabaseServices.Geo,Autodesk.AutoCAD.Geometry.Matrix3d)
Called internally when the anchor is transformed.
referenceWasMirrored: If true, the reference object was in the selection set.
geo: The owner of this anchor.
transform: The mirror transformation matrix.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: This gives derived anchors a chance to mirror their parameters.