Autodesk.Aec.DatabaseServices.CurveXOffsetType
Defines identifiers that indicate offset types.

Autodesk.Aec.DatabaseServices.CurveXOffsetType.FromStartOfCurve
Measure from the start of the base curve.

Autodesk.Aec.DatabaseServices.CurveXOffsetType.FromEndOfCurve
Measure from the end of the base curve.

Autodesk.Aec.DatabaseServices.CurveXOffsetType.FromMidpointOfCurve
Measure from the midpoint of the base curve.