Autodesk.Aec.Modeler.CircleCurve
Represents a circle curve.

Autodesk.Aec.Modeler.CircleCurve.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for CircleCurve.

Autodesk.Aec.Modeler.CircleCurve.#ctor
Initializes a new instance of the CircleCurve class.

Autodesk.Aec.Modeler.CircleCurve.#ctor(Autodesk.AutoCAD.Geometry.CircularArc3d,System.Int32,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the CircleCurve class using the specified circle, approx and body.
circle: The circle.
approx: The approx.
body: The body.

Autodesk.Aec.Modeler.CircleCurve.Transf
Gets the transform matrix.
Returns: The transform matrix.

Autodesk.Aec.Modeler.CircleCurve.Origin
Gets the origin point.
Returns: The origin point.

Autodesk.Aec.Modeler.CircleCurve.Axis
Gets the axis line.
Returns: The axis line.

Autodesk.Aec.Modeler.CircleCurve.Radius
Gets the radius.
Returns: The radius.

Autodesk.Aec.Modeler.CircleCurve.Approx
Gets the approx.
Returns: The approx.

Autodesk.Aec.Modeler.CircleCurve.Circle
Gets the circle.
Returns: The circle.