Autodesk.Aec.DatabaseServices.EditState
Represents an edit state object.

Autodesk.Aec.DatabaseServices.EditState.RegisterState(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Regiters the edit state for the specified entity.
id: The id of the specified entity.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EditState.UnregisterState(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Unregister the edit state from the specified entity.
id: The id of the specified entity.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.