Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities
Represents a grid assembly grid editor utilities.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.Create
Creates a wrapper class for GridAssemblyGridEditorUtilities.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.#ctor
Initializes a new instance of the GridAssemblyGridEditorUtilities class.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.GetGridDivisionId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the grid division id.
id: The object id.
Returns: The grid division id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if not able to open the in place grid editor for the given id.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.GetCellExtents(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.Geometry.BoundBox2d@)
Gets the cell extents.
id: The object id.
cellExtents: The returned cell extents.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if not able to open the in place grid editor for the given id.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.GetEditableGrid(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.GridAssembly,Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData)
Gets the editable grid assembly.
id: The object id.
gridAssembly: The returned editable grid assembly.
editableGridData: The returned editable grid data.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if not able to open the in place grid editor for the given id, or if the in place grid editor does not have a grid editor component.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.GetEditableGrid(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.GridAssemblyEditableGridData)
Gets the editable grid assembly.
id: The object id of a grid assembly.
editableGridData: The returned editable grid data.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: Throws exception if not able to open the grid assembly for the given id, or if the in place grid editor does not have a grid editor component.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.Clone
Clones the wrapped object.

Autodesk.Aec.DatabaseServices.GridAssemblyGridEditorUtilities.Dispose(System.Boolean)
Deletes the unmanaged object.
disposing: unused.
Returns: void.