Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection
Represents a collection of nested grid division overrides.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.Count
Returns the number of NestedGridDivisionOverride available on this collection.
Returns: Returns the number of NestedGridDivisionOverride available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridDivisionOverride[],System.Int32)
Copies the collection to the array.
array: The NestedGridDivisionOverride array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.Item(System.Int32)
Gets or sets the nested grid division override at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridDivisionOverride)
Adds a nested grid division override to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridDivisionOverride)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridDivisionOverride)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridDivisionOverride)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkAssembly)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.NestedGridDivisionOverrideCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.