Autodesk.Aec.DatabaseServices.GsMarkerInformationNode
Represents a node of the GsMarker information.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.#ctor(Autodesk.Aec.DatabaseServices.GsMarkerInformationTree,Autodesk.Aec.DatabaseServices.GsMarkerInformationNode)
Initializes a new instance of the GsMarkerInformationNode class using the specified with the specified parent tree and parent node.
parentTree: The specified parent tree.
parentNode: The specified parent node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.GsMarker
Gets or sets the GsMarker of the node.
Returns: The GsMarker of the node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.ParentNode
Gets or sets the parent of the node.
Returns: The parent of the node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.ParentTree
Gets or sets the parent tree of the node.
Returns: The parent tree of the node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.Clear
Clear the node and its children nodes.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.ContentToString(System.Boolean,System.Boolean)
Converts the GsMarker of the node to string.
getName: The specified boolean value indicates if the name of the node should be added into the string collection.
continueWithNextLevelNodes: The specified boolean value indicates if the GsMarkers of the children nodes should be converted to the strings.
Returns: The string collection contains the GsMarkers infomation.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.Name
Gets the name of the node.
Returns: The name of the node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.InformationNodeForGsMarker(System.Int32)
Gets the node specified by the GsMarker in the children nodes set.
value: The specified GsMarker.
Returns: The node specified by the GsMarker.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.InformationNodesForGsMarker(System.Int32)
Gets all nodes specified by the GsMarker in the children nodes set.
value: The specified GsMarker.
Returns: All nodes specified by the GsMarker.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.Add(Autodesk.Aec.DatabaseServices.GsMarkerInformationNode)
Adds the specified node to the children nodes set.
node: The specified node to be added.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.CollectInformationNodes
Collects all children nodes of the node.
Returns: All children nodes of the node.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.CollectInformationNodes(Autodesk.AutoCAD.Runtime.RXClass,System.Boolean)
Collects the children nodes of the node, which have the same type as the specified class type.
nodeClass: The specified class type.
recursive: The boolean value indicates if the children of the nodes in the next level should be collected.
Returns: The children nodes have the same type as the specified class type.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.CollectLeafNodeGsMarkers
Gets the GsMarkers of all leaf nodes.
Returns: The GsMarkers of all leaf nodes.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.CollectLeafNodeGsMarkers(System.Boolean)
Gets the GsMarkers of all leaf nodes.
collectAll3DBodyGsMarkers: The boolean value indicates if the GsMarkers of all 3D bodies should be collected.
Returns: The GsMarkers of all leaf nodes.

Autodesk.Aec.DatabaseServices.GsMarkerInformationNode.ObjectIdFromOldId(System.Int32)
Gets the object id from the old id form.
oldId: The specified old id.
Returns: The object id.