Autodesk.Aec.DatabaseServices.ClassificationCollection
Represents a classification array.

Autodesk.Aec.DatabaseServices.ClassificationCollection.#ctor
Initializes a new instance of the ClassificationCollection class.

Autodesk.Aec.DatabaseServices.ClassificationCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.ClassificationCollection.Count
Returns the number of classification ids available on this collection.
Returns: Returns the number of classification ids available on this collection.

Autodesk.Aec.DatabaseServices.ClassificationCollection.CopyTo(Autodesk.AutoCAD.DatabaseServices.ObjectId[],System.Int32)
Copies the collection to the array.
array: The ObjectId array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.ClassificationCollection.Item(System.Int32)
Gets or sets the classification id at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ClassificationCollection.Add(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Adds a classification id to the collection. If the AllowDuplicateDefinitions property is false, and the id has a parent definition that is the same as an entry already in the collection, the add operation will add the new one, but removes the old one and the count does not grow.
item: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationCollection.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.ClassificationCollection.IndexOf(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.ClassificationCollection.Insert(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.ClassificationCollection.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentException: System.ArgumentException.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ClassificationCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ClassificationCollection.GetIdForDefinition(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the classification for the given owning system definition.
idOwningSystemDefinition: The owning system definition.
Returns: Gets the classification for the given owning system definition.

Autodesk.Aec.DatabaseServices.ClassificationCollection.AreDifferent(Autodesk.Aec.DatabaseServices.ClassificationCollection,Autodesk.Aec.DatabaseServices.ClassificationCollection)
Determines if the classification arrays are different.
a: The first classification collection.
b: The second classification collection.
Returns: Returns true if the classification arrays are different.

Autodesk.Aec.DatabaseServices.ClassificationCollection.AllowDuplicateDefinitions
Gets whether the classification collection supports duplicate classification definition Ids. Typically DictionaryRecord and Entity derived classes do NOT support duplicate definitions.
Returns: Returns true if the classification collection supports duplicate definition Ids, or false otherwise.