Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName
DisplayRepresentationTypeName enumeration.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.General
General type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.Plan
Plan type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.Model
Model type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.Sketch
Sketch type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.Reflected
Reflected type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.Elevation
Elevation type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.PlanLowDetail
PlanLowDetail type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.PlanHighDetail
PlanHighDetail type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.ModelLowDetail
ModelLowDetail type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.ModelHighDetail
ModelHighDetail type.

Autodesk.Aec.DatabaseServices.DisplayRepresentationTypeName.Nominal
Nominal type.