Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection
Represents a collection of nested grid edge profile overrides.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.Count
Returns the number of NestedGridEdgeProfileOverride available on this collection.
Returns: Returns the number of NestedGridEdgeProfileOverride available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverride[],System.Int32)
Copies the collection to the array.
array: The NestedGridEdgeProfileOverride array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.Item(System.Int32)
Gets or sets the nested grid edge profile override at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverride)
Adds a nested grid edge profile override to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverride)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverride)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverride)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkAssembly)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.NestedGridEdgeProfileOverrideCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.