Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial
Represents a display properties of material.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.#ctor
Initializes a new instance of the DisplayPropertiesMaterial class.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SurfaceHatch
Gets the surface hatch.
Returns: The surface hatch.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.LineworkProperties
Gets the line work properties.
Returns: The line work properties.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.BodyProperties
Gets the body properties.
Returns: The body properties.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SectionElevationLineworkProperties
Gets the section elevation line work properties.
Returns: The section elevation line work properties.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.PlanHatch
Gets the plane hatch.
Returns: The plane hatch.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SectionHatch
Gets the section hatch.
Returns: The section hatch.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.OutsideBodyProperties
Gets the outside body properties.
Returns: The outside body properties.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SectionedBoundaryProperties
Gets the sectioned boundary properties.
Returns: The sectioned boundary properties.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.DisplayComponentForDisplayComponentType(Autodesk.Aec.DatabaseServices.ByMaterialDisplayComponentType)
Gets the display component for display component type.
materialDisplayComponentType: The material display component type.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.DisplayComponentTypeForDisplayComponent(Autodesk.Aec.DatabaseServices.DisplayComponentEntity)
Gets the display component type for display component.
component: The component.
Returns: The display component type for display component.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.ExcludeFrom2dSectionShrinkwrap
Gets or sets the exclude from 2d section shrink wrap.
Returns: The exclude from 2d section shrink wrap.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.MergeCommonMaterials
Gets or sets the merge common materials.
Returns: The merge common material.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.KeepAllHiddenLinework
Gets or sets the keep all hidden line work.
Returns: The keep all hidden line work.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SurfaceRenderingMaterialId
Gets or sets the surface rendering material id.
Returns: The surface rendering material id.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SectionRenderingMaterialId
Gets or sets the section rendering material id.
Returns: The section rendering material id.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SectionedBodyRenderingMaterialId
Gets or sets the sectioned body rendering material id.
Returns: The sectioned body rendering material id.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SurfaceRenderMaterialMapping
Gets or sets the surface render material mapping.
Returns: The surface render material mapping.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.SurfaceHatchLocationFlags
Gets or sets the surface hatch location flags.
Returns: The surface hatch flags.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.MaterialDisplayComponentName(Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.ByMaterialDisplayComponentType)
Gets the material display component name.
materialDisplayComponentType: The material display component type.
Returns: The material display component name.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.MaterialComponentType(System.String)
Gets the material component type.
componentName: The component name.
Returns: The material component type.

Autodesk.Aec.DatabaseServices.DisplayPropertiesMaterial.GetDisplayPropertiesForMaterial(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the display properties for material.
materialDisplayRepresentId: The material display represent id.
materialId: The material id.
Returns: The display properties for material.