Autodesk.Aec.DatabaseServices.DisplayRepresentationManager
Represents a manager class of display representations.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.#ctor
Initializes a new instance of the DisplayRepresentationManager class with default database.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DisplayRepresentationManager class with specified database.
db: Inputs the specified database.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)
Initializes a new instance of the DisplayRepresentationManager class.
viewportId: Inputs the object id of viewport.
viewDirection: Inputs the direction vector of view.
entityDatabase: Inputs the database of entity.
contextDatabase: Inputs the database of context.
viewportDraw: Inputs the viewport draw.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.Database,Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DisplayRepresentationManager class.
viewportId: Inputs the object id of viewport.
viewDirection: Inputs the direction vector of view.
entityDatabase: Inputs the database of entity.
contextDatabase: Inputs the database of context.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.DisplayConfigurationIdForCurrentViewport
Gets the  display configuration id for current viewport.
Returns: Returns the  display configuration id for current viewport.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.DefaultDisplayConfigurationId
Gets or sets the default display configuration id.
Returns: Returns the default display configuration id.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetDisplayConfigurationId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the display configuration id from particular object.
id: Inputs the particular object id.
Returns: Returns the display configuration id from particular object.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.SetDisplayConfigurationId(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the display configuration id for particular object.
id: Inputs the particular object id.
configurationId: Inputs the display configuration id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.RegisterDisplayRepresentation(Autodesk.AutoCAD.Runtime.RxClassRXClass,System.String)
Registers the display representation with system along with which display representation set it wants to be a part of default.
viewClass: Inputs the the display representation.
viewSetName: Inputs the name of the display representation set.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.RegisterDisplayRepresentation(Autodesk.AutoCAD.Runtime.RxClassRXClass)
Registers the display representation with system.
viewClass: Inputs the the display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.RegisterDisplayRepresentation(Autodesk.AutoCAD.Runtime.RxClassRXClass,System.Collections.Specialized.StringCollection)
Registers the display representation with system along with all display representation sets it wants to be a part of default.
viewClass: Inputs the the display representation.
viewSetNames: Inputs the names of the display representation sets.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.UnregisterDisplayRepresentation(Autodesk.AutoCAD.Runtime.RxClass)
Unregisters the display representation with system.
viewClass: Inputs the the display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetDisplayRepresentationsDictionary(Autodesk.Aec.DatabaseServices.Database)
Gets the dictionary of display representations.
db: Inputs the database.
Returns: Returns the dictionary of display representations.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetDisplayRepresentationId(Autodesk.AutoCAD.Runtime.RxClass)
Gets the object id of  the specified display representation.
viewClass: Inputs the the display representation.
Returns: Returns the object id of  the specified display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetDisplayRepresentationIdFromXref(Autodesk.Aec.DatabaseServices.DisplayRepresentation,Autodesk.AutoCAD.DatabaseServices.Database)
Gets the display representation in the supplied database that is of the type supplied by the viewClass argument.
view: Input the type of display representation.
db: Input the supplied database.
Returns: Returns the the object id of this display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetAllDisplayRepresentationsWorkForSpecifiedClass(Autodesk.AutoCAD.Runtime.RxClass)
Gets all display representations that work for a given class.
worksWithClass: Inputs the specified class that works with some display representations.
Returns: Returns the object id collection of all display representations that work for a given class.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetDisplayRepresentationIdsFromCurrentViewport(Autodesk.AutoCAD.Runtime.RxClass)
Gets object ids of display representations from current viewport for specified class type.
classType: Inputs the class type.
Returns: Returns the object id collection of display representations from current viewport.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetDisplayRepresentationIdsFromCurrentViewport(Autodesk.AutoCAD.Runtime.RxClass,Autodesk.AutoCAD.Runtime.RxClass)
Gets object ids of display representations from current viewport for specified class type and anchor type.
classType: Inputs the class type.
anchorType: Inputs the anchor type.
Returns: Returns the object id collection of display representations from current viewport.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.DisplayRepresentationsDictionaryId
Gets the object id of dictionary for display representations.
Returns: Returns the object id of dictionary for display representations.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.DisplayRepresentaionToObjectTypeMap
Gets the map of display representation class and object id collection.
Returns: Returns the map of display representation class and object id collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.CreateUserDisplayRepresentation(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String,System.Int32)
Creates user's default display representation.
id: Inputs the id.
name: Inputs the name.
flags: Inputs the flags.
Returns: Returns the object id of  created user's default display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.CreateUserDisplayRepresentation(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Creates user's default display representation.
id: Inputs the id.
name: Inputs the name.
Returns: Returns the object id of  created user's default display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.CreateUserDefaultDisplayProperty(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String,System.Int32)
Creates user's default display property.
id: Inputs the id.
name: Inputs the name.
flags: Inputs the flags.
Returns: Returns the object id of  created user's default display property.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.CreateUserDefaultDisplayProperty(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Creates user's default display property.
id: Inputs the id.
name: Inputs the name.
Returns: Returns the object id of  created user's default display property.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.CopyOverridenDisplayProperties(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Copies overriden display properties.
sourceId: Inputs the source id.
userId: Inputs the user id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.UpdateMaskBlockDisplayRepresentations(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Updates mask block display representations.
sourceId: Inputs the source id.
userId: Inputs the user id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetConfigurationOverrideFromInsertPath(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the configuration id from insert path.
blockStack: Inputs the stack of block.
Returns: Returns the configuration id from insert path.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetXrefInsertConfigurationOverride(Autodesk.AutoCAD.DatabaseServices.BlockReference)
Gets the overriden configuration id of the Xref INSERT.
reference: Inputs the block reference as Xref INSERT.
Returns: Returns the object id of the overriden configuration id.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetXrefInsertOverlayDabase(Autodesk.AutoCAD.DatabaseServices.BlockReference)
Gets the overlay database of the Xref INSERT.
reference: Inputs the block reference as Xref INSERT.
Returns: Returns the overlay database of the Xref INSERT.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.SetXrefInsertConfigurationOverride(Autodesk.AutoCAD.DatabaseServices.BlockReference,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets Xref of insert configuration override.
blockReference: Inputs the reference of block.
configurationId: Inputs the configuration id.
inverseOverlayOverride: Inputs the value to indicate whether inversing the overlay override.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.RemoveXrefInsertConfigurationOverride(Autodesk.AutoCAD.DatabaseServices.BlockReference)
Removes the Xref of insert configuration override.
blockReference: Inputs the block reference.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.IsGSViewportDraw(Autodesk.AutoCAD.GraphicsInterface.ViewportDraw)
Checks whether the specified viewport draw is GS.
draw: Inputs the viewport draw.
Returns: True if the specified viewport draw is GS, otherwise false.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.EnsureDisplayRepresentaionsHaveUniqueDictionaryNames
Ensures that the display representations have the unique dictionary names.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.DisplayConfigurationId(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Vector3d)
Gets the display configuration id.
viewportId: Inputs the id of viewport.
viewDirection: Inputs the display representation direction.
Returns: Returns the display configuration id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.DisplayRepresentationSet(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Vector3d)
Gets the set of display representation.
viewportId: Inputs the id of viewport.
viewDirection: Inputs the display representation direction.
Returns: Returns the set of display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.ActualDisplayRepresentationDirection(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.Geometry.Vector3d)
Gets the actual direction of display representation.
viewportId: Inputs the id of viewport.
viewDirection: Inputs the display representation direction.
Returns: Returns the actual direction of display representation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.GetActiveDisplayRepresentationSets(Autodesk.AutoCAD.DatabaseServices.Database)
Gets the sets of active display representation.
db: Inputs the database.
Returns: Returns the sets of active display representation.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.DisplayDxfName
Indicates whether display of the dxf name is currently on or off.
Returns: True if display of dxf name is turned on, otherwise false.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.PushInitialization(System.Boolean)
Pushes the value on the top of the initialization stack of display representation manager.
doInitialization: This argument indicates whether is necessary to do initialization before using display representation manager.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.PushInitialization
Pushes the value of "true" on the top of the initialization stack of display representation manager.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.PopInitialization
Pops the top element of the initialization stack of display representation manager.

Autodesk.Aec.DatabaseServices.DisplayRepresentationManager.Initialization
Gets the top element of initialization stack of display representation manager.
Returns: Returns the top element of initialization stack of display representation manager.