Autodesk.Aec.DatabaseServices.DictionaryRecordNameTranslator
Represents a dictionary record name translator.

Autodesk.Aec.DatabaseServices.DictionaryRecordNameTranslator.#ctor
Initializes a new instance of the DictionaryRecordNameTranslator class.

Autodesk.Aec.DatabaseServices.DictionaryRecordNameTranslator.Create(System.IntPtr,System.Boolean)
Creates a new instance of the DictionaryRecordNameTranslator class.
unmanagedPointer: Inputs the unmanaged pointer of DictionaryRecordNameTranslator object.
autoDelete: Inputs true if unmanaged object is destroyed by wrapper, otherwise false.