Autodesk.Aec.DatabaseServices.InplaceEditor
Represents an inplace editor.

Autodesk.Aec.DatabaseServices.InplaceEditor.#ctor
Initializes a new instance of the InplaceEditor class.

Autodesk.Aec.DatabaseServices.InplaceEditor.OldUcsMatrix
Gets or sets the old ucs matrix.
Returns: The old ucs matrix.

Autodesk.Aec.DatabaseServices.InplaceEditor.EntityId
Gets or sets the entity id.
Returns: The entity id.

Autodesk.Aec.DatabaseServices.InplaceEditor.LongTransactionId
Gets or sets the long transaction id.
Returns: The long transaction id.

Autodesk.Aec.DatabaseServices.InplaceEditor.OldEntityEcs
Gets or sets the old entity ecs.
Returns: The old entity ecs.

Autodesk.Aec.DatabaseServices.InplaceEditor.Entity
Gets or sets the entity.
Returns: The entity.

Autodesk.Aec.DatabaseServices.InplaceEditor.IsCurrentEditorInplaceEditEntity(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets whether the current editor is inplace edit entity.
id: The specified id.
Returns: Boolean value indicates whether the current editor is inplace edit entity.

Autodesk.Aec.DatabaseServices.InplaceEditor.GetInplaceEditEntities
Gets the inplace edit entities.
Returns: The inplace edit entities.

Autodesk.Aec.DatabaseServices.InplaceEditor.InplaceEditorComponentCount
Gets the count of inplace editor component.
Returns: The count of inplace editor component.

Autodesk.Aec.DatabaseServices.InplaceEditor.ActiveInplaceEditorComponentCount
Gets the count of active inplace editor component.
Returns: The count of active inplace editor component.

Autodesk.Aec.DatabaseServices.InplaceEditor.IsSingleComponentEditor
Gets whether the inplace editor is sinble component editor.
Returns: Boolean value indicates whether the inplace editor is sinble component editor.

Autodesk.Aec.DatabaseServices.InplaceEditor.InvalidCommandInInPlaceEditMode(System.String,Autodesk.Aec.DatabaseServices.CommandStatus@)
Tests whether the specified command is not allowed in inplace edit mode.
commandName: The specified command name.
status: Out parameter indicates the constraint of using the specified command.
Returns: Boolean value indicates whether the specifed command is not allowed in inplace edit mode.