Autodesk.Aec.DatabaseServices.SurfaceMappingType
Defines identifiers that indicate by surface mapping type.

Autodesk.Aec.DatabaseServices.SurfaceMappingType.DefaultMapping
Default Mapping.

Autodesk.Aec.DatabaseServices.SurfaceMappingType.FaceMapping
Face Mapping.

Autodesk.Aec.DatabaseServices.SurfaceMappingType.AsSurfaceHatch
As Surface Hatch.