Autodesk.Aec.DatabaseServices.GridAssemblyDefinition
Represents a grid assembly definition.

Autodesk.Aec.DatabaseServices.GridAssemblyDefinition.#ctor
Initializes a new instance of the GridAssemblyDefinition class.

Autodesk.Aec.DatabaseServices.GridAssemblyDefinition.SpecificBoundaryEdgeAssignments
Gets the boundary edge assignment components.
Returns: The boundary edge assignment components.

Autodesk.Aec.DatabaseServices.GridAssemblyDefinition.SpecificInteriorEdgeAssignments
Gets the interior edge assignment components.
Returns: The interior edge assignment components.

Autodesk.Aec.DatabaseServices.GridAssemblyDefinition.SpecificCellAssignments
Gets the cell asignments.
Returns: The cell asignments.

Autodesk.Aec.DatabaseServices.GridAssemblyDefinition.MaxCellAssignmentId(System.Int16)
Recursively search for the maximum cell id.
maxId: The given id.
Returns: The maximum cell assignment id.

Autodesk.Aec.DatabaseServices.GridAssemblyDefinition.MaxEdgeAssignmentId(System.Int16)
Recursively search for the maximum edge id.
maxId: The given id.
Returns: The maximum edge assignment id.

Autodesk.Aec.DatabaseServices.GridAssemblyDefinition.Name
Gets or sets the name of the grid assembly definition.
Returns: The name of the grid assembly definition.