Autodesk.Aec.DatabaseServices.GraphicsStorage
Represents a graphics storage.

Autodesk.Aec.DatabaseServices.GraphicsStorage.LayerId
Gets the layer id.
Returns: The layer id.

Autodesk.Aec.DatabaseServices.GraphicsStorage.LinetypeId
Gets the line type id.
Returns: The line type id.

Autodesk.Aec.DatabaseServices.GraphicsStorage.ColorIndex
Gets the color index.
Returns: The index.

Autodesk.Aec.DatabaseServices.GraphicsStorage.Color
Gets the color.
Returns: The color.

Autodesk.Aec.DatabaseServices.GraphicsStorage.GsMarker
Gets the gs marker.
Returns: The gs marker.

Autodesk.Aec.DatabaseServices.GraphicsStorage.LineWeight
Gets the line weight.
Returns: The line weight.

Autodesk.Aec.DatabaseServices.GraphicsStorage.LineTypeScale
Gets the line type scale.
Returns: The line type scale.

Autodesk.Aec.DatabaseServices.GraphicsStorage.MaterialId
Gets the material id.
Returns: The object id.

Autodesk.Aec.DatabaseServices.GraphicsStorage.PlotStyleType
Gets the plot style name type.
Returns: The plot style name type.

Autodesk.Aec.DatabaseServices.GraphicsStorage.PlotStyleNameId
Gets the plot style name id.
Returns: The plot style name id.

Autodesk.Aec.DatabaseServices.GraphicsStorage.GeometryExtents
Gets the geometry extents.
Returns: The geometry extents.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.