Autodesk.Aec.DatabaseServices.DisplayThemeStyle
Represents a display theme style class.

Autodesk.Aec.DatabaseServices.DisplayThemeStyle.#ctor
Initializes a new instance of the DisplayThemeStyle class.

Autodesk.Aec.DatabaseServices.DisplayThemeStyle.GetDisplayThemeComponents
Gets display theme components.

Autodesk.Aec.DatabaseServices.DisplayThemeStyle.GetDisplayThemeDisplayPropsForEntity(Autodesk.Aec.DatabaseServices.Entity)
Gets display theme display properties for entity.
entity: Entity.
Returns: Display component hatch.

Autodesk.Aec.DatabaseServices.DisplayThemeStyle.GetDisplayThemeDisplayPropsForEntity(Autodesk.Aec.DatabaseServices.Entity,System.Int32)
Gets display theme display properties for entity.
entity: Entity.
componentIndex: Component index.
Returns: Display component hatchs.

Autodesk.Aec.DatabaseServices.DisplayThemeStyle.CellFormat
Gets cell format.
Returns: Display theme cell format.

Autodesk.Aec.DatabaseServices.DisplayThemeStyle.Title
Gets or sets title of this display theme style.
Returns: Title.