Autodesk.Aec.DatabaseServices.DisplayMaterialInformation
Represents a class which stores material display related information.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.Create
Creates a new instance of the DisplayMaterialInformation class.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.#ctor
Initializes a new instance of the DisplayMaterialInformation class.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.#ctor(System.UInt32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.UInt16,System.Boolean)
Initializes a new instance of the DisplayMaterialInformation class using the specified parameters.
locationId: Inputs the location id.
locationStyleId: Inputs the location sytle id.
componentId: Input the component id.
isFromObjectOverride: Inputs the value to indicate whether is from object override or not.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.LocationId
Gets or sets the locations id.
Returns: Returns the location id.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.LocationStyleId
Gets the location style id.
Returns: Returns the location style id.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.LocationStyleId(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the location style id.
id: Inputs the location style id.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.ComponentId
Gets or sets the component id.
Returns: Returns the component id.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.IsFromObjectOverride
Gets or sets to know whether is from object override.
Returns: True if it is from object override. Otherwise false.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.MaterialLocation
Gets the material information location.
Returns: Returns the material information location.

Autodesk.Aec.DatabaseServices.DisplayMaterialInformation.Clone
Clones the current object.
Returns: Returns the newly cloned object.