Autodesk.Aec.ApplicationServices.LegacyDrawingUnitMode
LegacyDrawingUnitMode enumeration.

Autodesk.Aec.ApplicationServices.LegacyDrawingUnitMode.Automatic
Automatic mode.

Autodesk.Aec.ApplicationServices.LegacyDrawingUnitMode.Imperial
Imperial mode.

Autodesk.Aec.ApplicationServices.LegacyDrawingUnitMode.Metric
Metric mode.