Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection
Represents a collection of MultiViewBlockAttributeReferences.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.Count
Returns the number of MultiViewBlockAttributeReferences available on this collection.
Returns: Returns the number of MultiViewBlockAttributeReferences available on this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.CopyTo(Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference[],System.Int32)
Copies the collection to the array.
array: The MultiViewBlockAttributeReference array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.Item(System.Int32)
Gets or sets the MultiViewBlockAttributeReference at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.Add(Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference)
Adds a MultiViewBlockAttributeReference to the collection.
item: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.Contains(Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.IndexOf(Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.Remove(Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReference)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.MultiViewBlockAttributeReferenceCollection.Clear
Removes all items from the collection.