Autodesk.Aec.DatabaseServices.ComponentType
Section2d component type enumeration.

Autodesk.Aec.DatabaseServices.ComponentType.DefiningLine
Defining line.

Autodesk.Aec.DatabaseServices.ComponentType.Hidden
Hidden.

Autodesk.Aec.DatabaseServices.ComponentType.Erased
Erased.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision1
SubDivision 1.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision2
SubDivision 2.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision3
SubDivision 3.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision4
SubDivision 4.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision5
SubDivision 5.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision6
SubDivision 6.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision7
SubDivision 7.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision8
SubDivision 8.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision9
SubDivision 9.

Autodesk.Aec.DatabaseServices.ComponentType.SubDivision10
SubDivision 10.

Autodesk.Aec.DatabaseServices.ComponentType.OuterShrinkwrap
Outer shrinkwrap.

Autodesk.Aec.DatabaseServices.ComponentType.InnerShrinkwrap
Inner shrinkwrap.

Autodesk.Aec.DatabaseServices.ComponentType.UserDefined
User defined.