Autodesk.Aec.Modeler.Entity
Represents an entity.

Autodesk.Aec.Modeler.Entity.Create(System.IntPtr,System.Boolean)
Creates a wrapper class for Entity.
unmanagedPointer: The native pointer.
autoDelete: If it would be auto deleted.

Autodesk.Aec.Modeler.Entity.Flags
Flags property.
Returns: Gets the Flags property.

Autodesk.Aec.Modeler.Entity.DeleteUnmanagedObject()
Deletes the unmanaged object.
Returns: void.