Autodesk.Aec.DatabaseServices.RenderModeType
Render mode enumeration.

Autodesk.Aec.DatabaseServices.RenderModeType.WireFrame
Wireframe mode.

Autodesk.Aec.DatabaseServices.RenderModeType.Shade
Shade mode.

Autodesk.Aec.DatabaseServices.RenderModeType.Explode
Explode mode.