Autodesk.Aec.DatabaseServices.AttributeId
Represents an AEC attribute id.

Autodesk.Aec.DatabaseServices.AttributeId.#ctor
Initializes a new instance of the AttributeId class.

Autodesk.Aec.DatabaseServices.AttributeId.#ctor(Autodesk.Aec.DatabaseServices.ObjectId)
Initializes a new instance of the AttributeId class using the specified AEC related object id.
aecObjectId: Input the AEC related object id.

Autodesk.Aec.DatabaseServices.AttributeId.Id
Gets the AEC related object id.
Returns: The AEC related object id.