Autodesk.Aec.DatabaseServices.LayoutGrid3d
Represents a layout grid 3d. LayoutGrid3d builds onto VolumeLayoutTool by restricting node layouts to a regular 3d grid structure.

Autodesk.Aec.DatabaseServices.LayoutGrid3d.#ctor
Initializes a new instance of the LayoutGrid3d class.

Autodesk.Aec.DatabaseServices.LayoutGrid3d.BaseGrid
Gets the base grid.
Returns: The base grid, or null if the grid was not defined yet.

Autodesk.Aec.DatabaseServices.LayoutGrid3d.GridType
Gets the grid type.
Returns: Returns the grid type.