Autodesk.Aec.DatabaseServices.DisplayRepresentationImageIndex
DisplayRepresentationImageIndex enumeration.

Autodesk.Aec.DatabaseServices.DisplayRepresentationImageIndex.FirstImage
Index of first image.

Autodesk.Aec.DatabaseServices.DisplayRepresentationImageIndex.Normal
Index of normal image.

Autodesk.Aec.DatabaseServices.DisplayRepresentationImageIndex.WithoutProperties
Index of without properties.

Autodesk.Aec.DatabaseServices.DisplayRepresentationImageIndex.UserDefined
Index of user defined.

Autodesk.Aec.DatabaseServices.DisplayRepresentationImageIndex.LastImage
Index of last image.