Autodesk.Aec.DatabaseServices.CurveYMeasureToType
Defines identifiers that indicate measure to types.

Autodesk.Aec.DatabaseServices.CurveYMeasureToType.ToCenter
Measure to the center of the anchored object.

Autodesk.Aec.DatabaseServices.CurveYMeasureToType.ToFrontEdge
Measure to the front edge of the anchored object.

Autodesk.Aec.DatabaseServices.CurveYMeasureToType.ToBackEdge
Measure to the back edge of the anchored object.