Autodesk.Aec.DatabaseServices.MassGroup
Represents a mass group.

Autodesk.Aec.DatabaseServices.MassGroup.#ctor
Initializes a new instance of the MassGroup class.

Autodesk.Aec.DatabaseServices.MassGroup.SubType
Gets or sets the subtype.
Returns: Returns the subtype.

Autodesk.Aec.DatabaseServices.MassGroup.Body
Gets the body.
Returns: The body.

Autodesk.Aec.DatabaseServices.MassGroup.AddNode(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.Aec.DatabaseServices.Operation)
Adds a node.
entity: The entity.
operation: The mass group operation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.Nodes
Gets the nodes.
Returns: Returns the nodes.

Autodesk.Aec.DatabaseServices.MassGroup.NodeCount
Gets the number of nodes.
Returns: Returns the number of nodes.

Autodesk.Aec.DatabaseServices.MassGroup.RemoveNode(Autodesk.AutoCAD.DatabaseServices.Entity)
Removes the specified node.
entity: The entity node.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.RemoveAllNodes
Removes all nodes.

Autodesk.Aec.DatabaseServices.MassGroup.MoveNodeToAfter(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Moves the node after the specified node id.
id: The id of the node to move.
afterId: The node to move after.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.MoveNodeToBefore(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Moves the node before the specified id.
id: The id of the node to move.
beforeId: The node to move before.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.MoveNodeToEnd(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Moves a node to the end.
id: The node to move.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.MoveNodeToBeginning(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Moves a node to the beginning.
id: The node to move.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.GetOperation(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the mass group operation for the specified element.
id: The element id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.SetOperation(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.Operation)
Sets the mass group operation for the specified element.
id: The element id.
operation: The mass group operation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.Volume
Gets the volume.
Returns: Returns the volume.

Autodesk.Aec.DatabaseServices.MassGroup.Entities
Gets the elements of the group.

Autodesk.Aec.DatabaseServices.MassGroup.RootNode
Gets the root node.
Returns: The id of the root element.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.ParentMassing(Autodesk.Aec.DatabaseServices.Operation@)
Finds the parent and operation of this mass group.
operation: The operation.
Returns: Returns the parent and operation of this mass group.

Autodesk.Aec.DatabaseServices.MassGroup.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.Aec.DatabaseServices.Operation@,System.Boolean)
Determines if the mass element is contained by this group.
id: The mass element id.
operation: The operation.
recursive: true, to perform a recursive search.

Autodesk.Aec.DatabaseServices.MassGroup.SaveBody(System.String)
Saved the mass group body to a file.
filename: The body filename.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.GetMaterialId(System.Int32)
Gets the material id.
componentId: The component id.
Returns: Returns the material id.

Autodesk.Aec.DatabaseServices.MassGroup.SupportsAnchoring
Gets or sets whether the mass group supports anchoring.
Returns: Returns true if the mass group supports anchoring,return false otherwise.

Autodesk.Aec.DatabaseServices.MassGroup.SetSupportsAnchoring(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets whether anchoring is supported by the specified mass group .
massGroupId: The mass group id.
supports: Input true if anchoring is supported by the specified mass group,false otherwise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassGroup.GetSupportsAnchoring(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets whether anchoring is supported by the specified mass group .
massGroupId: The mass group id.
Returns: Returns true if anchoring is supported by the specified mass group , false otherwise.