Autodesk.Aec.BuiltInUnit
BuiltInUnit enumeration.

Autodesk.Aec.BuiltInUnit.Dimensionless
No units.

Autodesk.Aec.BuiltInUnit.Kilogram
Unit of mass (SI).

Autodesk.Aec.BuiltInUnit.Meter
Unit of length (SI).

Autodesk.Aec.BuiltInUnit.Second
Unit of time (SI).

Autodesk.Aec.BuiltInUnit.Kelvin
Unit of temperature (SI).

Autodesk.Aec.BuiltInUnit.Ampere
Unit of current (SI).

Autodesk.Aec.BuiltInUnit.Mole
Unit of amount of substance (SI).

Autodesk.Aec.BuiltInUnit.Candela
Unit of luminous intensity (SI).

Autodesk.Aec.BuiltInUnit.Radian
Unit of plane angle.

Autodesk.Aec.BuiltInUnit.Steradian
Unit of solid angle.

Autodesk.Aec.BuiltInUnit.Newton
Unit of force.

Autodesk.Aec.BuiltInUnit.Lumen
Unit of luminous flux of light.

Autodesk.Aec.BuiltInUnit.Joule
Unit of energy.

Autodesk.Aec.BuiltInUnit.Pascals
Unit of pressure.

Autodesk.Aec.BuiltInUnit.Watt
Unit of power.

Autodesk.Aec.BuiltInUnit.Volt
Unit of electrical potential.

Autodesk.Aec.BuiltInUnit.Lux
Unit of illumination of a surface.

Autodesk.Aec.BuiltInUnit.Angstrom
Unit of length.

Autodesk.Aec.BuiltInUnit.AstronomicalUnit
Unit of length.

Autodesk.Aec.BuiltInUnit.Gigameter
Unit of length.

Autodesk.Aec.BuiltInUnit.Kilometer
Unit of length.

Autodesk.Aec.BuiltInUnit.Hectometer
Unit of length.

Autodesk.Aec.BuiltInUnit.Dekameter
Unit of length.

Autodesk.Aec.BuiltInUnit.Decimeter
Unit of length.

Autodesk.Aec.BuiltInUnit.Centimeter
Unit of length.

Autodesk.Aec.BuiltInUnit.Millimeter
Unit of length.

Autodesk.Aec.BuiltInUnit.Micron
Unit of length.

Autodesk.Aec.BuiltInUnit.Millimicron
Unit of length.

Autodesk.Aec.BuiltInUnit.LightYear
Unit of length (astronomical).

Autodesk.Aec.BuiltInUnit.Parsec
Unit of length (astronomical).

Autodesk.Aec.BuiltInUnit.Foot
Unit of length.

Autodesk.Aec.BuiltInUnit.Inch
Unit of length.

Autodesk.Aec.BuiltInUnit.Caliber
Unit of length.

Autodesk.Aec.BuiltInUnit.Yards
Unit of length.

Autodesk.Aec.BuiltInUnit.Fathoms
Unit of length (nautical).

Autodesk.Aec.BuiltInUnit.Cable
Unit of length (nautical).

Autodesk.Aec.BuiltInUnit.Bolt
Unit of length (cloth).

Autodesk.Aec.BuiltInUnit.Chain
Unit of length (survey).

Autodesk.Aec.BuiltInUnit.ChainEngineers
Unit of length (survey).

Autodesk.Aec.BuiltInUnit.Link
Unit of length (survey).

Autodesk.Aec.BuiltInUnit.Cubit
Unit of length.

Autodesk.Aec.BuiltInUnit.Furlong
Unit of length (survey).

Autodesk.Aec.BuiltInUnit.Hand
Unit of length.

Autodesk.Aec.BuiltInUnit.MileNautical
Unit of length.

Autodesk.Aec.BuiltInUnit.Mile
Unit of length.

Autodesk.Aec.BuiltInUnit.LeagueNautical
Unit of length.

Autodesk.Aec.BuiltInUnit.LeagueStatute
Unit of length.

Autodesk.Aec.BuiltInUnit.Mil
Unit of length.

Autodesk.Aec.BuiltInUnit.Pace
Unit of length.

Autodesk.Aec.BuiltInUnit.Palm
Unit of length.

Autodesk.Aec.BuiltInUnit.Rod
Unit of length (survey).

Autodesk.Aec.BuiltInUnit.Rope
Unit of length.

Autodesk.Aec.BuiltInUnit.Skein
Unit of length.

Autodesk.Aec.BuiltInUnit.Span
Unit of length.

Autodesk.Aec.BuiltInUnit.SurveyFoot
Unit of length.

Autodesk.Aec.BuiltInUnit.SquareMeters
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareFoot
Unit of area.

Autodesk.Aec.BuiltInUnit.Acre
Unit of area.

Autodesk.Aec.BuiltInUnit.Are
Unit of area.

Autodesk.Aec.BuiltInUnit.Barn
Unit of area.

Autodesk.Aec.BuiltInUnit.Centare
Unit of area.

Autodesk.Aec.BuiltInUnit.Hectare
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareAngstrom
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareAstronomicalUnit
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareBolt
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareCable
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareCaliber
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareCentimeter
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareCubit
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareDecimeter
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareFathom
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareFurlong
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareGigameter
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareHand
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareInch
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareKilometer
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareLeagueNautical
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareLeagueStatute
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareLightYear
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareLink
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareMicron
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareMil
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareMileNautical
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareMileStatute
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareMillimeter
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareMillimicron
Unit of area.

Autodesk.Aec.BuiltInUnit.SquarePace
Unit of area.

Autodesk.Aec.BuiltInUnit.SquarePalm
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareParsec
Unit of area.

Autodesk.Aec.BuiltInUnit.SquarePerch
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareRope
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareSkein
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareSpan
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareSurveyFoot
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareYard
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareChain
Unit of area.

Autodesk.Aec.BuiltInUnit.Township
Unit of area.

Autodesk.Aec.BuiltInUnit.CubicMeter
Unit of volume.

Autodesk.Aec.BuiltInUnit.Liter
Unit of volume.

Autodesk.Aec.BuiltInUnit.Barrel
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.BoardFoot
Unit of volume.

Autodesk.Aec.BuiltInUnit.Bushel
Unit of volume.

Autodesk.Aec.BuiltInUnit.Centiliter
Unit of volume.

Autodesk.Aec.BuiltInUnit.Cord
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicCentimeter
Unit of volume.

Autodesk.Aec.BuiltInUnit.Decistere
Unit of volume.

Autodesk.Aec.BuiltInUnit.Dekaliter
Unit of volume.

Autodesk.Aec.BuiltInUnit.Dekastere
Unit of volume.

Autodesk.Aec.BuiltInUnit.Dram
Unit of volume.

Autodesk.Aec.BuiltInUnit.DryPint
Unit of volume.

Autodesk.Aec.BuiltInUnit.DryQuart
Unit of volume.

Autodesk.Aec.BuiltInUnit.Firkin
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.Gallon
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.Gill
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.Hogshead
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.Kiloliter
Unit of volume.

Autodesk.Aec.BuiltInUnit.Minim
Unit of volume.

Autodesk.Aec.BuiltInUnit.FluidOunce
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.Peck
Unit of volume.

Autodesk.Aec.BuiltInUnit.FluidPint
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.FluidQuart
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.RegisterTon
Unit of volume.

Autodesk.Aec.BuiltInUnit.Tun
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.CubicAngstrom
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicAstronomicalUnit
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicBolt
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicCable
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicCaliber
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicChain
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicCubit
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicFathom
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicFoot
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicFurlong
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicGigameter
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicHand
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicHectometer
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicInch
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicLeagueNautical
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicLeagueStatute
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicLightYear
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicLink
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicMil
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicMileNautical
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicMileStatute
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicMillimeter
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicMillimicron
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicPace
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicPalm
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicParsec
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicPerch
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicRope
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicSkein
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicSpan
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicSurveyFoot
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicYard
Unit of volume.

Autodesk.Aec.BuiltInUnit.Dalton
Unit of mass.

Autodesk.Aec.BuiltInUnit.Grain
Unit of mass.

Autodesk.Aec.BuiltInUnit.Gram
Unit of mass.

Autodesk.Aec.BuiltInUnit.Hundredweight
Unit of mass.

Autodesk.Aec.BuiltInUnit.LongTon
Unit of mass.

Autodesk.Aec.BuiltInUnit.Ounce
Unit of mass.

Autodesk.Aec.BuiltInUnit.OunceTroy
Unit of mass.

Autodesk.Aec.BuiltInUnit.Pennyweight
Unit of mass.

Autodesk.Aec.BuiltInUnit.Pound
Unit of mass.

Autodesk.Aec.BuiltInUnit.Slug
Unit of mass.

Autodesk.Aec.BuiltInUnit.Stone
Unit of mass.

Autodesk.Aec.BuiltInUnit.Ton
Unit of mass.

Autodesk.Aec.BuiltInUnit.Tonne
Unit of mass.

Autodesk.Aec.BuiltInUnit.Minute
Unit of time.

Autodesk.Aec.BuiltInUnit.Hour
Unit of time.

Autodesk.Aec.BuiltInUnit.Day
Unit of time.

Autodesk.Aec.BuiltInUnit.Week
Unit of time.

Autodesk.Aec.BuiltInUnit.Fortnight
Unit of time.

Autodesk.Aec.BuiltInUnit.SiderealYear
Unit of time.

Autodesk.Aec.BuiltInUnit.TropicalYear
Unit of time.

Autodesk.Aec.BuiltInUnit.Decade
Unit of time.

Autodesk.Aec.BuiltInUnit.Century
Unit of time.

Autodesk.Aec.BuiltInUnit.Millenium
Unit of time.

Autodesk.Aec.BuiltInUnit.CubicDecimeter
Unit of volume.

Autodesk.Aec.BuiltInUnit.DecimalDegree
Unit of angle.

Autodesk.Aec.BuiltInUnit.DegreeMinuteSecond
Unit of angle.

Autodesk.Aec.BuiltInUnit.Gradient
Unit of angle.

Autodesk.Aec.BuiltInUnit.SurveyorUnit
Unit for surveyors.

Autodesk.Aec.BuiltInUnit.KilogramPerCubicMeter
Unit of density.

Autodesk.Aec.BuiltInUnit.PoundPerCubicFoot
Unit of density.

Autodesk.Aec.BuiltInUnit.PoundPerCubicInch
Unit of density.

Autodesk.Aec.BuiltInUnit.Kiloampere
Unit of electrical current.

Autodesk.Aec.BuiltInUnit.Milliampere
Unit of electrical current.

Autodesk.Aec.BuiltInUnit.Kilovolt
Unit of electric potential and electromotive force.

Autodesk.Aec.BuiltInUnit.Millivolt
Unit of electric potential and electromotive force.

Autodesk.Aec.BuiltInUnit.Kilowatt
Unit of power.

Autodesk.Aec.BuiltInUnit.InternationalBritishThermalUnit
Unit of heat quantity.

Autodesk.Aec.BuiltInUnit.InternationalCalorie
Unit of heat.

Autodesk.Aec.BuiltInUnit.InternationalKilocalorie
Unit of heat.

Autodesk.Aec.BuiltInUnit.KilowattHour
Unit of energy.

Autodesk.Aec.BuiltInUnit.USThermalUnit
Unit of heat quantity.

Autodesk.Aec.BuiltInUnit.NewtonMeter
Unit of moment.

Autodesk.Aec.BuiltInUnit.DecanewtonMeter
Unit of moment.

Autodesk.Aec.BuiltInUnit.KilonewtonMeter
Unit of moment.

Autodesk.Aec.BuiltInUnit.MeganewtonMeter
Unit of moment.

Autodesk.Aec.BuiltInUnit.FootKilopound
Unit of moment.

Autodesk.Aec.BuiltInUnit.KilogramForceMeter
Unit of energy and work.

Autodesk.Aec.BuiltInUnit.KilogramForceFoot
Unit of energy and work.

Autodesk.Aec.BuiltInUnit.TonForceFoot
Unit of energy and work.

Autodesk.Aec.BuiltInUnit.TonneForceMeter
Unit of energy and work.

Autodesk.Aec.BuiltInUnit.FootPoundForce
Unit of energy and work.

Autodesk.Aec.BuiltInUnit.Decanewton
Unit of force.

Autodesk.Aec.BuiltInUnit.Kilonewton
Unit of force.

Autodesk.Aec.BuiltInUnit.Meganewton
Unit of force.

Autodesk.Aec.BuiltInUnit.Kilopound
Unit of forces.

Autodesk.Aec.BuiltInUnit.KilogramForce
Unit of force.

Autodesk.Aec.BuiltInUnit.Hertz
Unit of frequency.

Autodesk.Aec.BuiltInUnit.CyclePerSecond
Unit of frequency.

Autodesk.Aec.BuiltInUnit.PascalPerMeter
Unit of pressure per meter.

Autodesk.Aec.BuiltInUnit.InchesOfWaterPer100Feet
Unit of inches of water per 100 feet.

Autodesk.Aec.BuiltInUnit.FootCandle
Unit of illumination.

Autodesk.Aec.BuiltInUnit.FootLambert
Unit of luminance.

Autodesk.Aec.BuiltInUnit.CandelaPerSquareMeter
Unit of luminous intensity per square meter.

Autodesk.Aec.BuiltInUnit.NewtonPerMeter
Unit of force per meter.

Autodesk.Aec.BuiltInUnit.DecanewtonPerMeter
Unit of force per meter.

Autodesk.Aec.BuiltInUnit.KilonewtonPerMeter
Unit of force per meter.

Autodesk.Aec.BuiltInUnit.MeganewtonPerMeter
Unit of force per meter.

Autodesk.Aec.BuiltInUnit.KilopoundPerFoot
Unit of force per foot.

Autodesk.Aec.BuiltInUnit.KilogramForcePerMeter
Unit of force per meter.

Autodesk.Aec.BuiltInUnit.TonneForcePerMeter
Unit of force per meter.

Autodesk.Aec.BuiltInUnit.PoundForcePerFoot
Unit of force per foot.

Autodesk.Aec.BuiltInUnit.KilogramPerMeter
Unit of force per meter.

Autodesk.Aec.BuiltInUnit.PoundPerFoot
Unit of force per foot.

Autodesk.Aec.BuiltInUnit.VoltAmpere
Unit of electric measurement.

Autodesk.Aec.BuiltInUnit.KilovoltAmpere
Unit of electric measurement.

Autodesk.Aec.BuiltInUnit.HorsePower
Unit of power.

Autodesk.Aec.BuiltInUnit.KilogramForceMeterPerSecond
Unit of force.

Autodesk.Aec.BuiltInUnit.FootPoundForcePerSecond
Unit of force.

Autodesk.Aec.BuiltInUnit.InternationalCaloriePerSecond
Unit of heat quantity over time.

Autodesk.Aec.BuiltInUnit.InternationalKilocaloriePerSecond
Unit of heat quantity over time.

Autodesk.Aec.BuiltInUnit.InternationalBritishThermalUnitPerSecond
Unit of heat quantity over time.

Autodesk.Aec.BuiltInUnit.InternationalBritishThermalUnitPerHour
Unit of heat quantity over time.

Autodesk.Aec.BuiltInUnit.WattPerSquareMeter
Unit of power over area.

Autodesk.Aec.BuiltInUnit.WattPerSquareFoot
Unit of power over area.

Autodesk.Aec.BuiltInUnit.InchOfWater
Unit of inches of water.

Autodesk.Aec.BuiltInUnit.Kilopascal
Unit of pressure.

Autodesk.Aec.BuiltInUnit.Megapascal
Unit of pressure.

Autodesk.Aec.BuiltInUnit.PoundPerSquareInch
Unit of pressure.

Autodesk.Aec.BuiltInUnit.PoundPerSquareFoot
Unit of pressure.

Autodesk.Aec.BuiltInUnit.MillimeterOfMercury
Unit of pressure.

Autodesk.Aec.BuiltInUnit.InchOfMercury
Unit of pressure.

Autodesk.Aec.BuiltInUnit.StandardAtmosphere
Unit of pressure.

Autodesk.Aec.BuiltInUnit.NewtonPerSquareMillimeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.NewtonPerSquareMeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.DecanewtonPerSquareMillimeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.DecanewtonPerSquareMeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.KilonewtonPerSquareMeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.MeganewtonPerSquareMeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.KilopoundPerSquareinch
Unit of pressure.

Autodesk.Aec.BuiltInUnit.KilopoundPerSquareFoot
Unit of pressure.

Autodesk.Aec.BuiltInUnit.KilogramForcePerSquareMillimeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.KilogramForcePerSquareCentimeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.KilogramForcePerSquareMeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.TonneForcePerSquareCentimeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.TonneForcePerSquareMeter
Unit of pressure.

Autodesk.Aec.BuiltInUnit.TonForcePerSquareFoot
Unit of pressure.

Autodesk.Aec.BuiltInUnit.Bar
Unit of length.

Autodesk.Aec.BuiltInUnit.Fahrenheit
Unit of temperature.

Autodesk.Aec.BuiltInUnit.Celsius
Unit of temperature.

Autodesk.Aec.BuiltInUnit.Rankine
Unit of temperature.

Autodesk.Aec.BuiltInUnit.MeterPerSecond
Unit of speed.

Autodesk.Aec.BuiltInUnit.FootPerMinute
Unit of speed.

Autodesk.Aec.BuiltInUnit.CentimeterPerMinute
Unit of speed.

Autodesk.Aec.BuiltInUnit.CubicMeterPerSecond
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicMeterPerHour
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicFootPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.LiterPerSecond
Unit of flow.

Autodesk.Aec.BuiltInUnit.USGallonPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.USGallonPerHour
Unit of flow.

Autodesk.Aec.BuiltInUnit.Millisecond
Unit of time.

Autodesk.Aec.BuiltInUnit.PoundForce
Unit of force.

Autodesk.Aec.BuiltInUnit.InternationalMillionBritishThermalUnitPerHour
Unit of heat quantity over time.

Autodesk.Aec.BuiltInUnit.InternationalThousandBritishThermalUnitPerHour
Unit of heat quantity over time.

Autodesk.Aec.BuiltInUnit.CandelaPerSquareFoot
Unit of luminous intensity per square foot.

Autodesk.Aec.BuiltInUnit.RevolutionPerMinute
Unit of revolutions per minute.

Autodesk.Aec.BuiltInUnit.InchesOfMercuryPer100feet
Unit of inches of mercury per 100 feet.

Autodesk.Aec.BuiltInUnit.MillimetersOfMercuryPer100feet
Unit of millimeters of mercury per 100 feet.

Autodesk.Aec.BuiltInUnit.KilowattPerSquareMeter
Unit of energy per area.

Autodesk.Aec.BuiltInUnit.KilowattPerSquareFoot
Unit of energy per area.

Autodesk.Aec.BuiltInUnit.MeterPerMinute
Unit of speed.

Autodesk.Aec.BuiltInUnit.FootPerSecond
Unit of speed.

Autodesk.Aec.BuiltInUnit.CubicFootPerSecond
Unit of flow.

Autodesk.Aec.BuiltInUnit.LiterPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.USGallonPerSecond
Unit of flow.

Autodesk.Aec.BuiltInUnit.SurveyFootPerSecond
Unit of speed.

Autodesk.Aec.BuiltInUnit.CubicSurveyFootPerSecond
Unit of flow.

Autodesk.Aec.BuiltInUnit.ImpGallon
Unit of volume (liquid).

Autodesk.Aec.BuiltInUnit.FootPerSecondSquared
Unit of acceleration.

Autodesk.Aec.BuiltInUnit.MeterPerSecondSquared
Unit of acceleration.

Autodesk.Aec.BuiltInUnit.SurveyFootPerSecondSquared
Unit of acceleration.

Autodesk.Aec.BuiltInUnit.AngularMilNato
Unit of angle.

Autodesk.Aec.BuiltInUnit.AngularMilSweden
Unit of angle.

Autodesk.Aec.BuiltInUnit.AngularMilUssr
Unit of angle.

Autodesk.Aec.BuiltInUnit.AcreFootPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.AcreFootPerHour
Unit of flow.

Autodesk.Aec.BuiltInUnit.AcreFootPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.AcreInchPerHour
Unit of flow.

Autodesk.Aec.BuiltInUnit.AcreInchPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicFootPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicFootPerHour
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicInchPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicMeterPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicMeterPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.CubicYardPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.ImpGallonPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.ImpGallonPerHour
Unit of flow.

Autodesk.Aec.BuiltInUnit.ImpGallonPerMinute
Unit of flow.

Autodesk.Aec.BuiltInUnit.ImpGallonPerSecond
Unit of flow.

Autodesk.Aec.BuiltInUnit.ImpMillionGallonPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.LiterPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.LiterPerHour
Unit of flow.

Autodesk.Aec.BuiltInUnit.MillionLiterPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.UsGallonPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.UsMillionGallonPerDay
Unit of flow.

Autodesk.Aec.BuiltInUnit.MileNauticalInt
Unit of length.

Autodesk.Aec.BuiltInUnit.FootPerHour
Unit of velocity.

Autodesk.Aec.BuiltInUnit.InchPerHour
Unit of velocity.

Autodesk.Aec.BuiltInUnit.InchPerMinute
Unit of velocity.

Autodesk.Aec.BuiltInUnit.InchPerSecond
Unit of velocity.

Autodesk.Aec.BuiltInUnit.KilometerPerHour
Unit of velocity.

Autodesk.Aec.BuiltInUnit.KilometerPerMinute
Unit of velocity.

Autodesk.Aec.BuiltInUnit.KilometerPerSecond
Unit of velocity.

Autodesk.Aec.BuiltInUnit.Knot
Unit of velocity.

Autodesk.Aec.BuiltInUnit.KnotUK
Unit of velocity.

Autodesk.Aec.BuiltInUnit.MeterPerHour
Unit of velocity.

Autodesk.Aec.BuiltInUnit.MilePerHour
Unit of velocity.

Autodesk.Aec.BuiltInUnit.MilePerMinute
Unit of velocity.

Autodesk.Aec.BuiltInUnit.MilePerSecond
Unit of velocity.

Autodesk.Aec.BuiltInUnit.SurveyInch
Unit of length.

Autodesk.Aec.BuiltInUnit.SurveyYard
Unit of length.

Autodesk.Aec.BuiltInUnit.SurveyRod
Unit of length.

Autodesk.Aec.BuiltInUnit.MileStatute
Unit of length.

Autodesk.Aec.BuiltInUnit.SquareSurveyYard
Unit of area.

Autodesk.Aec.BuiltInUnit.SurveyAcre
Unit of area.

Autodesk.Aec.BuiltInUnit.SquareMile
Unit of area.

Autodesk.Aec.BuiltInUnit.CubicSurveyYard
Unit of volume.

Autodesk.Aec.BuiltInUnit.CubicMile
Unit of volume.

Autodesk.Aec.BuiltInUnit.SurveyMilePerHour
Unit of velocity.

Autodesk.Aec.BuiltInUnit.CubicKilometer
Unit of volume.

Autodesk.Aec.BuiltInUnit.GramPerCubicCentimeter
Unit of density.