Autodesk.Aec.Modeler.RevolutionSurface
Represents a revolution surface.

Autodesk.Aec.Modeler.RevolutionSurface.Axis
Gets the axis line.
Returns: Returns the axis line.

Autodesk.Aec.Modeler.RevolutionSurface.StartDir
Gets the start vector.
Returns: Returns the start vector.