Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities
Represents Aec XReference Subcommand Activities.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.Start
Start.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.StartItem
StartItem.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.EndItem
EndItem.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.End
End.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.WillAbort
WillAbort.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.Aborted
Aborted.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.StartXBindBlock
StartXBindBlock.

Autodesk.Aec.DatabaseServices.AecXReferenceSubcommandActivities.StartXBindSymbol
StartXBindSymbol.