Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection
Represents a collection of nested grid cell overrides.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.Count
Returns the number of NestedGridCellMergeData available on this collection.
Returns: Returns the number of NestedGridCellMergeData available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridCellMergeData[],System.Int32)
Copies the collection to the array.
array: The NestedGridCellMergeData array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.Item(System.Int32)
Gets or sets the nested grid cell override at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridCellMergeData)
Adds a nested grid cell override to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridCellMergeData)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridCellMergeData)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridCellMergeData)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkAssembly)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.NestedGridCellMergeDataCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.