Autodesk.Aec.DatabaseServices.LineWorkComponentCollection
Represents a collection of section vertex.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.Count
Returns the number of LineWorkComponents available on this collection.
Returns: Returns the number of LineWorkComponents available on this collection.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.CopyTo(Autodesk.Aec.DatabaseServices.LineWorkComponent[],System.Int32)
Copies the collection to the array.
array: The LineWorkComponent array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.Item(System.Int32)
Gets or sets the LineWorkComponent at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.Add(Autodesk.Aec.DatabaseServices.LineWorkComponent)
Adds a LineWorkComponent to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.Contains(Autodesk.Aec.DatabaseServices.LineWorkComponent)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.IndexOf(Autodesk.Aec.DatabaseServices.LineWorkComponent)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.LineWorkComponent)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkComponent)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.LineWorkComponentCollection.Clear
Removes all items from the collection.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not Implemented.