Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection
Represents a collection of nested infill components.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Count
Returns the number of NestedGridInfillDefinition available on this collection.
Returns: Returns the number of NestedGridInfillDefinition available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridInfillDefinition[],System.Int32)
Copies the collection to the array.
array: The NestedGridInfillDefinition array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Item(System.Int32)
Gets or sets the nested grid division at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridInfillDefinition)
Adds a nested grid division to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridInfillDefinition)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridInfillDefinition)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridInfillDefinition)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkComponent)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Remove(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Removes the specified item from the collection.
id: The id of the item to remove.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridInfillComponentCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.