Autodesk.Aec.DatabaseServices.GridCustomCell
Represents a grid cell custom.

Autodesk.Aec.DatabaseServices.GridCustomCell.#ctor
Initializes a new instance of the GridCustomCell class.

Autodesk.Aec.DatabaseServices.GridCustomCell.ExtractNodeCount
Gets the node count.
Returns: The node count.

Autodesk.Aec.DatabaseServices.GridCustomCell.NodeInformationCollection
Gets the node information collection.
Returns: The node information collection.
Throws System.Exception: System.Exception.

Autodesk.Aec.DatabaseServices.GridCustomCell.CalculateCellProfile
Gets the custom cell grid profile.
Returns: The custom cell grid profile, or null if there none defined yet.