Autodesk.Aec.DatabaseServices.EntityInterferenceShrinkWrapEffect
Entity interference shrink wrap effect .

Autodesk.Aec.DatabaseServices.EntityInterferenceShrinkWrapEffect.Ignore
Entity interference is a shrink wrap effect of ignore.

Autodesk.Aec.DatabaseServices.EntityInterferenceShrinkWrapEffect.Additive
Entity interference is a shrink wrap effect of additive.

Autodesk.Aec.DatabaseServices.EntityInterferenceShrinkWrapEffect.Subtractive
Entity interference is a shrink wrap effect of subtractive.