Autodesk.Aec.DatabaseServices.CurveZOffsetFromType
Defines identifiers that indicate offset from types.

Autodesk.Aec.DatabaseServices.CurveZOffsetFromType.FromBottom
Measure from the bottom of the base curve.

Autodesk.Aec.DatabaseServices.CurveZOffsetFromType.FromTop
Measure from the top of the base curve.

Autodesk.Aec.DatabaseServices.CurveZOffsetFromType.FromCenter
Measure from the center of the base curve.