Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection
Represents a collection of nested grid edge overrides.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.Count
Returns the number of NestedGridEdgeOverride available on this collection.
Returns: Returns the number of NestedGridEdgeOverride available on this collection.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.CopyTo(Autodesk.Aec.DatabaseServices.NestedGridEdgeOverride[],System.Int32)
Copies the collection to the array.
array: The NestedGridEdgeOverride array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.Item(System.Int32)
Gets or sets the nested grid edge override at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.Add(Autodesk.Aec.DatabaseServices.NestedGridEdgeOverride)
Adds a nested grid edge override to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.Contains(Autodesk.Aec.DatabaseServices.NestedGridEdgeOverride)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.IndexOf(Autodesk.Aec.DatabaseServices.NestedGridEdgeOverride)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.NestedGridEdgeOverride)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.Remove(Autodesk.Aec.DatabaseServices.LineWorkAssembly)
Removes the specified item from the collection.
value: The item to remove.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Not implemented.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.NestedGridEdgeOverrideCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.