Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter
DisplayConfigurationParameter enumeration.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.DefaultViewDependentSet
Default view dependent set.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.HardSet
Hard set.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.ViewDependentSet
View dependent set.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.UseViewportViewDirection
Uses viewport view direction.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.HardViewDirection
Hard view direction.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.HardViewDirectionType
Hard view direction type.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.CutPlaneOffset
Cut plane offset.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.CutPlaneAbove
Cut plane above.

Autodesk.Aec.DatabaseServices.DisplayConfigurationParameter.CutPlaneBelow
Cut plane below.