Autodesk.Aec.DatabaseServices.StreamCollectClipBodies
Represents a stream that clips the bodies pushed into the stream with the specifed clip body.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the StreamCollectClipBodies class using the specified database.
db: The database.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.SetBodyClipVolume(Autodesk.Aec.Modeler.Body)
Sets the body filter. This function makes a copy of the body filter parameter and use the copy while streaming.  Changing the body parameter instance outside the function won't affect the streaming process.
bodyFilter: The body filter.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.GetCollectedGraphics
Gets the collected graphics.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.SetCalculateShrinkwrap(System.Boolean,Autodesk.AutoCAD.Geometry.Matrix3d,System.Boolean)
Sets if shrinkwrap needs to be calculated during the streaming.
value: True to turn on shrinkwrap.
toShrinkwrapPlane: The matrix of shrinkwrap plane.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.SetCalculateShrinkwrap(System.Boolean,Autodesk.AutoCAD.Geometry.Matrix3d)
Sets if shrinkwrap needs to be calculated during the streaming. The shrinkwrap object is always initialized by calling this function.
value: True to turn on shrinkwrap.
toShrinkwrapPlane: The matrix of shrinkwrap plane.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.SetRetainBodies(System.Boolean)
Sets if the bodies pushed into the stream are retained instead of turned into shells.
value: True to retain bodies.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.SetSkipAnnotationObjects(System.Boolean)
Sets whether to skip annotation objects during streaming.
value: True to skip annotation objects.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.BackfaceCullSurfaceHatching
Gets or sets whether BackfaceCullSurfaceHatching should be turned on.
Returns: Boolean value indicates whether BackfaceCullSurfaceHatching should be turned on.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.ShrinkwrapProfile
Gets the profile of the shrinkwrap.

Autodesk.Aec.DatabaseServices.StreamCollectClipBodies.CalculateShrinkwrap
Gets whether the shrinkwrap calculation is turned on.
Returns: True if the shrinkwrap calculation is turned on.