Autodesk.Aec.Modeler.Vertex
Represents a vertex.

Autodesk.Aec.Modeler.Vertex.#ctor
Initializes a new instance of the Vertex class.

Autodesk.Aec.Modeler.Vertex.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.Aec.Modeler.Body)
Initializes a new instance of the Vertex class using the specified point and body.
point: The point of vertex.
body: The body which the vertes is on it.

Autodesk.Aec.Modeler.Vertex.Point
Gets or sets the point.
Returns: The point.

Autodesk.Aec.Modeler.Vertex.Transform(Autodesk.AutoCAD.Geometry.Matrix3d)
Transfer from a matrix.
matrix: The matrix.

Autodesk.Aec.Modeler.Vertex.Modified
Sets it is modified.

Autodesk.Aec.Modeler.Vertex.VertexSurfaceData(Autodesk.Aec.Modeler.Edge)
Gets the vertex surface data.
edge: The edge.
Returns: The vertex surface data.

Autodesk.Aec.Modeler.Vertex.VertexSurfaceDataCollection
Gets the VertexSurfaceDataCollection.
Returns: The VertexSurfaceDataCollection.