Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation
Represents a component information of the selected entity.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.#ctor
Initializes a new instance of the EntitySelectedComponentInformation class.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.#ctor(System.String,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.MaterialInformation)
Initializes a new instance of the EntitySelectedComponentInformation class using the specified component information, viewport and material information.
displayComponentName: The name of the specified component.
displayPropertiesId: The object id of the specified component display properties.
displayRepresentationId: The object id of the specified component display representation.
viewportId: The obejct id of the viewport.
viewportNumber: The number of the viewport.
materialDisplayPropertiesId: The object id of the specified material display properties.
materialDisplayRepresentationId: The object id of the specified material display representation.
materialInformation: The specified material information.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayComponentName
Gets or sets the name of the display component.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayPropertiesId
Gets or sets the object id of the specified display properties.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayRepresentationId
Gets or sets the object id of the specified display representation.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.ViewportId
Gets or sets the object id of the specified viewport.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.ViewportNumber
Gets or sets the number of the viewport.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.MaterialDisplayPropertiesId
Gets or sets the specified object id of the material display properties.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.MaterialDisplayRepresentationId
Gets or sets the specified object id of the material display representation.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.MaterialInformation
Gets or sets the specified material information.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.HasMaterialInformation
Gets or sets the boolean value to indicate if the component has the material information.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.CurrentByMaterialStatus
Gets or sets the boolean value to indicate if the current material is in the ByMaterial status.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.ComponentName
Gets the component name.
Returns: The component name.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayProperties
Gets the object id of the display properties.
Returns: The object id of the display properties.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayedDrawingDefaultWarningMessage
Gets or sets the boolean value to indicate if a warning message should be displayed when display properties are modified at the drawing default level.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayedStyleOverrideWarningMessage
Gets or sets the boolean value to indicate if a warning message should be displayed when display properties are modified at the style override level.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayedSystemOverrideWarningMessage
Gets or sets the boolean value to indicate if a warning message should be displayed when display properties are modified at the system override level.

Autodesk.Aec.DatabaseServices.EntitySelectedComponentInformation.DisplayedMaterialWarningMessage
Gets or sets the boolean value to indicate if a warning message should be displayed when the material definitions are modified.