Autodesk.Aec.DatabaseServices.DisplaySet
Represents a class that maintains a list of user definable display representations.

Autodesk.Aec.DatabaseServices.DisplaySet.#ctor
Initializes a new instance of the DisplaySet class.

Autodesk.Aec.DatabaseServices.DisplaySet.SetStandardType(Autodesk.Aec.DatabaseServices.StandardDisplaySetType,Autodesk.AutoCAD.DatabaseServices.Database)
Sets the standard type for the display set.
type: Inputs the type.
db: Inputs the database.

Autodesk.Aec.DatabaseServices.DisplaySet.GetStandardType
Gets the standard type for the display set.
Returns: Returns the standard type for the display set.

Autodesk.Aec.DatabaseServices.DisplaySet.DisplayRepresentationIds
Gets the collection of display representation ids.
Returns: Returns the the collection of display representation ids.

Autodesk.Aec.DatabaseServices.DisplaySet.WorksWith(Autodesk.AutoCAD.Runtime.RXClass)
Gets the display representation ids which are working with the specifed class.
type: Inputs the RXClass type of the object.
Returns: Returns the display representation ids which are working with the specifed class.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.DisplaySet.IsStandardSet
Gets to know whether this display set is standard or not.
Returns: True if this display set is standard, otherwise is false.

Autodesk.Aec.DatabaseServices.DisplaySet.HasLiveClippingBody
Gets to know whether this display set has live clipping body.
Returns: True if this display set has live clipping body, otherwise false.

Autodesk.Aec.DatabaseServices.DisplaySet.LiveSectionBody
Gets the live section body.
Returns: Returns the live section body.

Autodesk.Aec.DatabaseServices.DisplaySet.LiveSectionClipVolumes
Gets or sets the live section clip volumes.

Autodesk.Aec.DatabaseServices.DisplaySet.SetTransientLiveSectionBody
Sets the transient live section body.

Autodesk.Aec.DatabaseServices.DisplaySet.HasTransientLiveSectionBody
Gets to know whether this display set has transient live section body.
Returns: True if this display set has transient live section body, otherwise false.

Autodesk.Aec.DatabaseServices.DisplaySet.ClipModelGeometry
Gets or sets the model geometry to be clipped or not.

Autodesk.Aec.DatabaseServices.DisplaySet.ShowClippedMaterials
Gets or sets the display set to show clipped materials or not.

Autodesk.Aec.DatabaseServices.DisplaySet.DisableSurfaceHatching
Gets or sets to disable surface hatching or not.

Autodesk.Aec.DatabaseServices.DisplaySet.DisableSectionedBodyDisplay
Gets or sets the display set to disable section body display or not.

Autodesk.Aec.DatabaseServices.DisplaySet.GetDisplayRangeSectionBody(Autodesk.Aec.DatabaseServices.DisplayConfiguration)
Gets the display range section body.
configuration: Inputs the display configuration.
Returns: Returns the display range section body.

Autodesk.Aec.DatabaseServices.DisplaySet.GetCombinedDisplayRangeAndLiveSectionBody(Autodesk.Aec.DatabaseServices.DisplayConfiguration)
Gets combined display range and live section body with specified display configuration.
configuration: Inputs the display configuration.
Returns: Returns combined display range and live section body with specified display configuration.

Autodesk.Aec.DatabaseServices.DisplaySet.ClassificationFilter
Gets the classification filter of the display set.
Remarks: When there are no classifications present, an empty collection is provided that classification definition Ids can be added to.

Autodesk.Aec.DatabaseServices.DisplaySet.UpdateMergedClassifications(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
?
oldSystemDefinition: ?
oldClassId: ?
newSystemDefinition: ?
newClassId: ?
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.