Autodesk.Aec.DatabaseServices.AnchorEntityToCurve
Represents an entity to a curve anchor.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.#ctor
Initializes a new instance of the AnchorEntityToCurve class.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.AnchorX
Gets the AnchorToCurveX member.
Returns: Returns the AnchorToCurveX member.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.AnchorY
Gets the AnchorToCurveY member.
Returns: Returns the AnchorToCurveY member.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.AnchorZ
Gets the AnchorToCurveZ member.
Returns: Returns the AnchorToCurveZ member.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.FlipX
Gets or sets the flip in X value.
Returns: Returns true if flipped in X.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.FlipY
Gets or sets the flip in Y value.
Returns: Returns true if flipped in Y.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.FlipZ
Gets or sets the flip in Z value.
Returns: Returns true if flipped in Z.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.CurveId
Gets or sets the curve Id.
Returns: Returns the curve Id.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.Rotation
Gets or sets the rotation.
Returns: Returns the rotation.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.RotationAroundX
Gets or sets the rotation around X.
Returns: Returns the rotation around X.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.ReverseParameters
Reverses the X parameters, and flips X and Y.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.CurveThickness
Gets the curve thickness of the referenced object.
Returns: Returns the curve thickness of the referenced object.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.CurveWidth
Gets the curve width of the referenced object.
Returns: Returns the curve width of the referenced object.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.CurveNormal
Gets the curve normal of the referenced object.
Returns: Returns the curve normal of the referenced object.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.SwitchAnchoredEnd(Autodesk.Aec.DatabaseServices.Geo)
Changes the end that the anchored object is referencing.
geo: The anchored object.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.GetEntityExtents(Autodesk.Aec.DatabaseServices.Geo)
Calculates the extents of the anchored object.
geo: The anchored object.
Returns: The extents.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.CalculateCurveThickness(Autodesk.AutoCAD.DatabaseServices.Curve)
Gets the thickness of the specified curve.
curve: The curve.
Returns: Returns the thickness of the specified curve.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.CalculateCurveWidth(Autodesk.AutoCAD.DatabaseServices.Curve)
Gets the width of the specified curve.
curve: The curve.
Returns: Returns the width of the specified curve.

Autodesk.Aec.DatabaseServices.AnchorEntityToCurve.CalculateCurveNormal(Autodesk.AutoCAD.DatabaseServices.Curve)
Gets the normal of the specified curve.
curve: The curve.
Returns: Returns the normal of the specified curve.