Autodesk.Aec.DatabaseServices.ImpTree
Represents an implementation tree.

Autodesk.Aec.DatabaseServices.ImpTree.#ctor
Initializes a new instance of the ImpTree class.

Autodesk.Aec.DatabaseServices.ImpTree.AllowNullObjects
Gets or sets whether null objects are allowed.
Returns: Returns whether null objects are allowed.

Autodesk.Aec.DatabaseServices.ImpTree.SubObjectsMightHaveReferences
Gets or sets whether subobjects can have references.
Returns: Returns whether subobjects can have references.

Autodesk.Aec.DatabaseServices.ImpTree.AllowChildren
Gets or sets whether children are allowed.
Returns: Returns whether children are allowed.

Autodesk.Aec.DatabaseServices.ImpTree.Root
Gets the root of the tree.
Returns: Returns the root of the tree.

Autodesk.Aec.DatabaseServices.ImpTree.IsRoot
Specifies whether this is the root.
Returns: Returns whether this is the root.

Autodesk.Aec.DatabaseServices.ImpTree.ParentTree
Gets the parent tree.
Returns: Returns the parent tree.

Autodesk.Aec.DatabaseServices.ImpTree.Children
Gets the children tree collection.
Returns: Returns the children tree collection.

Autodesk.Aec.DatabaseServices.ImpTree.Add(Autodesk.Aec.DatabaseServices.ImpTree)
Adds a tree to the children collection.
value: The tree.
Returns: The index of the newly added tree in the children collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ImpTree.Insert(System.Int32,Autodesk.Aec.DatabaseServices.ImpTree)
Inserts a tree to the specified position of the children tree collection.
index: The specified position.
value: The tree.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ImpTree.RemoveAll
Removes all the trees in the children tree collection.

Autodesk.Aec.DatabaseServices.ImpTree.RemoveAt(System.Int32)
Removes a child at the specified position in the children tree collection.
index: The specified position.

Autodesk.Aec.DatabaseServices.ImpTree.GetAt(System.Int32)
Gets the child tree at the specified position.
index: The specified position.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ImpTree.GetCount
Gets the count of children.
Returns: The count of children.