Autodesk.Aec.DatabaseServices.ApplyToFlags
The interference types for the ApplyTo option.

Autodesk.Aec.DatabaseServices.ApplyToFlags.ApplyToInfill
Applies to infill.

Autodesk.Aec.DatabaseServices.ApplyToFlags.ApplyToBoundaryEdges
Applies to boundary edges.

Autodesk.Aec.DatabaseServices.ApplyToFlags.ApplyToInteriorEdges
Applies to interior edges.