Autodesk.Aec.DatabaseServices.DisplayComponentHatch
Represents a display component hatch base class.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.#ctor
Initializes a new instance of the DisplayComponentHatch class.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.HatchType
Gets or sets hatch type.
Returns: Hatch type.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.PatternName
Gets or sets pattern name.
Returns: Pattern name.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.Scale
Gets or sets scale.
Returns: Scale.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.Angle
Gets or sets angle.
Returns: Angle.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.UseAngleOfObject
Gets or sets if it use angle of object.
Returns: True if it use angle of object, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.Spacing
Gets or sets spacing.
Returns: Spacing.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.UOffset
Gets or sets UOffset.
Returns: UOffset.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.VOffset
Gets or sets VOffset.
Returns: VOffset.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.IsDoubleHatch
Gets or sets if it is double hatch.
Returns: True if it is double hatch, false otherwise.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.SetHatchParams(Autodesk.AutoCAD.DatabaseServices.Hatch,System.Double,System.Double)
Sets hatch parameters.
hatch: Hatch.
angleOfObject: Angle of object.
ucsXAngleOffset: Ucs X angle offset.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.SetHatchParamsToAcadSettings(Autodesk.AutoCAD.DatabaseServices.Hatch)
Set hatch parameters to acad settings.
hatch: Hatch.

Autodesk.Aec.DatabaseServices.DisplayComponentHatch.ResetHatch
Reset hatch.