Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection
Represents a collection of MultiViewBlockDisplayRepresentationDefinitions.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.Count
Returns the number of MultiViewBlockDisplayRepresentationDefinitions available on this collection.
Returns: Returns the number of MultiViewBlockDisplayRepresentationDefinitions available on this collection.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.CopyTo(Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition[],System.Int32)
Copies the collection to the array.
array: The MultiViewBlockDisplayRepresentationDefinition array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.Item(System.Int32)
Gets or sets the MultiViewBlockDisplayRepresentationDefinition at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.Add(Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition)
Adds a MultiViewBlockDisplayRepresentationDefinition to the collection.
item: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.Contains(Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.IndexOf(Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.Remove(Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinition)
Removes the specified item from the collection.
value: The item to remove.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.MultiViewBlockDisplayRepresentationDefinitionCollection.Clear
Removes all items from the collection.