Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection
Represents a collection of ViewDependentCombinationCollection.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.Item(System.Int32)
Gets or sets the ViewDependentCombination at the given index.
index: The index.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.Clear
Removes all items from the collection.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.Count
Returns the number of ViewDependentCombinations available on this collection.
Returns: Returns the number of ViewDependentCombinations available on this collection.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.Add(Autodesk.Aec.DatabaseServices.ViewDependentCombination)
Adds the specified item to the collection.
item: The item.
Returns: Returns the index where the item was added.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.IndexOf(Autodesk.Aec.DatabaseServices.ViewDependentCombination)
Determines the index of the specified item.
item: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.Insert(System.Int32,Autodesk.Aec.DatabaseServices.ViewDependentCombination)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
item: The item to insert.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.Remove(Autodesk.Aec.DatabaseServices.ViewDependentCombination)
Removes the specified item from the collection.
item: The item to remove.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.Contains(Autodesk.Aec.DatabaseServices.ViewDependentCombination)
Determines if the collection contains the specified item.
item: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.ViewDependentCombinationCollection.CopyTo(Autodesk.Aec.DatabaseServices.ViewDependentCombination[],System.Int32)
Copies the collection to the array.
array: The ViewDependentCombination array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.