Autodesk.Aec.DatabaseServices.UseAsAutomaticBoundary
Defines identifiers that indicate whether the object can act as an automatic boundary.

Autodesk.Aec.DatabaseServices.UseAsAutomaticBoundary.NotApplicableToThisObject
Automatic Boundries do not apply to this object type.

Autodesk.Aec.DatabaseServices.UseAsAutomaticBoundary.Yes
This object is set to act as an automatic boundary.

Autodesk.Aec.DatabaseServices.UseAsAutomaticBoundary.No
This object is not set to act as an automatic boundary.

Autodesk.Aec.DatabaseServices.UseAsAutomaticBoundary.ByStyle
This object relies on the value in it's style to determine whether it is set to act as an automatic boundary.