Autodesk.Aec.DatabaseServices.PolygonStyle
Represents a polygon style.

Autodesk.Aec.DatabaseServices.PolygonStyle.#ctor
Initializes a new instance of the PolygonStyle class.

Autodesk.Aec.DatabaseServices.PolygonStyle.EdgeWidth
Gets or sets the edge width.
Returns: Returns the edge width.

Autodesk.Aec.DatabaseServices.PolygonStyle.EdgeWidthJustifyType
Gets or sets the edge width justification type.
Returns: Returns the edge width justification type.