Autodesk.Aec.DatabaseServices.ExtendedStringCollection
Represents a collection of String.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.GetEnumerator
Returns an enumerator for this collection.
Returns: Returns an enumerator for this collection.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.Count
Returns the number of System::String available on this collection.
Returns: Returns the number of System::String available on this collection.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.CopyTo(System.String[],System.Int32)
Copies the collection to the array.
array: The System::String array.
index: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.Item(System.Int32)
Gets or sets the item at the given index.
index: The index.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.Add(System.String)
Adds an item to the collection.
value: The item.
Returns: Returns the index where the item was added.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.Contains(System.String)
Determines if the collection contains the specified item.
value: The item.
Returns: Returns true if the collection contains the specified item.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.IndexOf(System.String)
Determines the index of the specified item.
value: The item.
Returns: Returns the index of the specified item.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.Insert(System.Int32,System.String)
Inserts the specified item into the collection at the specified index.
index: The index to insert the item at.
value: The item to insert.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.Remove(System.String)
Removes the specified item from the collection.
value: The item to remove.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.RemoveAt(System.Int32)
Removes the item at the specified index.
index: The index.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.Clear
Removes all items from the collection.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.ExtendedStringCollection.AddBatch
Add multiple strings to the collection.
stringList: Strings.