Autodesk.Aec.DatabaseServices.MassElement
Represents a mass element.

Autodesk.Aec.DatabaseServices.MassElement.#ctor
Initializes a new instance of the MassElement class.

Autodesk.Aec.DatabaseServices.MassElement.SubType
Gets or sets the user-defined subtype.
Returns: Returns the user-defined subtype.

Autodesk.Aec.DatabaseServices.MassElement.Width
Gets or sets the width.
Returns: Returns the width.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.Depth
Gets or sets the depth.
Returns: Returns the depth.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.Height
Gets or sets the height.
Returns: Returns the height.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.Radius
Gets or sets the radius.
Returns: Returns the radius.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.Rise
Gets or sets the rise.
Returns: Returns the rise.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.Deviation
Gets or sets the deviation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.Body
Gets the body.
Returns: Returns the body.

Autodesk.Aec.DatabaseServices.MassElement.ShapeType
Gets the shape type.
Returns: The shape type.

Autodesk.Aec.DatabaseServices.MassElement.ShapeSubType
Gets the shape subtype.
Returns: Returns the shape subtype.

Autodesk.Aec.DatabaseServices.MassElement.ProfileId
Gets or sets the profile id.
Returns: Returns the profile id.

Autodesk.Aec.DatabaseServices.MassElement.Profile
Gets or sets the profile.
Returns: Returns the profile.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.Volume
Gets the volume.
Returns: Returns the volume.

Autodesk.Aec.DatabaseServices.MassElement.Create(Autodesk.Aec.DatabaseServices.ShapeType)
Creates a mass element with the specified shape type.
type: The shape type.
Returns: Returns a mass element with the specified shape type.

Autodesk.Aec.DatabaseServices.MassElement.Create(Autodesk.Aec.DatabaseServices.ShapeType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Creates a mass element with the specified shape type and profile id.
type: The shape type.
profileId: The profile id.
Returns: Returns a mass element with the specified shape type and profile id.

Autodesk.Aec.DatabaseServices.MassElement.Create(Autodesk.Aec.DatabaseServices.ShapeType,Autodesk.Aec.Geometry.Profile)
Creates a mass element with the specified shape type and profile.
type: The shape type.
profile: The profile.
Returns: Returns a mass element with the specified shape type and profile.

Autodesk.Aec.DatabaseServices.MassElement.ChangeTo(Autodesk.Aec.DatabaseServices.ShapeType)
Changes the shape type.
type: The shape type.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.ChangeTo(Autodesk.Aec.DatabaseServices.ShapeType,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Changes the shape type and profile.
type: The shape type.
profileId: The profile id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.ChangeTo(Autodesk.Aec.DatabaseServices.ShapeType,Autodesk.Aec.Geometry.Profile)
Changes the shape type and profile.
type: The shape type.
profile: The profile.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.MassElement.ParentMassing(Autodesk.AutoCAD.DatabaseServices.ObjectId@,Autodesk.Aec.DatabaseServices.Operation@)
Gets the parent massing id and the operation.
id: The parent massing id.
operation: The operation.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: This method throws an exception if the mass is not in a group.

Autodesk.Aec.DatabaseServices.MassElement.SetBody(Autodesk.Aec.Modeler.Body,System.Boolean)
Sets the body.
body: The body.
centerToLcs: Determines if the body is centered to the local CS.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.
Remarks: This function applies for objects created with the ShapeType set to BoundaryRepresentation.

Autodesk.Aec.DatabaseServices.MassElement.GetMaterialId(System.Int32,System.Boolean@)
Gets the material id for the specified component.
component: The component index.
wasOverridden: true, if the material is overriden.