Autodesk.Aec.Modeler.UnspecifiedCurve
Represents a unspecified curve.

Autodesk.Aec.Modeler.UnspecifiedCurve.#ctor
Initializes a new instance of the UnspecifiedCurve class.

Autodesk.Aec.Modeler.UnspecifiedCurve.#ctor(Autodesk.Aec.Modeler.Body)
Initializes a new instance of the UnspecifiedCurve class using the specified body.
body: The body.