Autodesk.Aec.DisplayOptionWithRespectToCutPlane
Display Option With Respect To Cut Plane enumeration.

Autodesk.Aec.DisplayOptionWithRespectToCutPlane.DisplayAlways
Display aways.

Autodesk.Aec.DisplayOptionWithRespectToCutPlane.DisplayIfIntersectedByCutPlane
Display if intersected but cut plane.

Autodesk.Aec.DisplayOptionWithRespectToCutPlane.DisplayIfFallsInAboveCutPlaneRange
Display if falls in above cut plane range.

Autodesk.Aec.DisplayOptionWithRespectToCutPlane.DisplayIfFallsInBelowCutPlaneRange
Display if falls in below cut plane range.