Autodesk.Aec.DatabaseServices.ImpObject
Represents an implementation object.

Autodesk.Aec.DatabaseServices.ImpObject.#ctor
Initializes a new instance of the ImpObject class.

Autodesk.Aec.DatabaseServices.ImpObject.Description
Gets or sets the description.
Returns: Returns the description.

Autodesk.Aec.DatabaseServices.ImpObject.SubSetDatabaseDefaults(Autodesk.AutoCAD.DatabaseServices.Database)
Sets any uninitialized data before the object is closed.
db: The database.
Remarks: This call is forwarded to the internal implementation class.

Autodesk.Aec.DatabaseServices.ImpObject.SetToStandard(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes data to realistic values after object construction.
db: The database.

Autodesk.Aec.DatabaseServices.ImpObject.Database
Gets the database.
Returns: Returns the database.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.