Autodesk.Aec.DatabaseServices.Attribute
Represents an AEC attribute.

Autodesk.Aec.DatabaseServices.Attribute.#ctor
Initializes a new instance of the Attribute class.

Autodesk.Aec.DatabaseServices.Attribute.Copy
Creates a copy of this attribute.
Returns: A copy of this attribute.