Autodesk.Aec.DatabaseServices.GraphicsStorageVisibility
GraphicsStorageVisibility used to map the AcGiVisibility.

Autodesk.Aec.DatabaseServices.GraphicsStorageVisibility.Invisible
Element is displayed as Invisible.

Autodesk.Aec.DatabaseServices.GraphicsStorageVisibility.Visible
Element is displayed as Visible.

Autodesk.Aec.DatabaseServices.GraphicsStorageVisibility.Silhouette
Element is displayed as Silhouette.