Autodesk.Aec.DatabaseServices.EntityBodyModifier
Represents an entity body modifier.

Autodesk.Aec.DatabaseServices.EntityBodyModifier.#ctor
Initializes a new instance of the EntityBodyModifier class.

Autodesk.Aec.DatabaseServices.EntityBodyModifier.Body
Sets the body.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EntityBodyModifier.SetBodyFromMassElement(Autodesk.Aec.DatabaseServices.MassElement,Autodesk.AutoCAD.Geometry.Matrix3d)
Sets the body from a mass element.
massElement: Input the mass element.
wcsToEcs: Input the matrix.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EntityBodyModifier.GetBodyAsMassElement
Gets the body as a mass element.
Returns: The mass element.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.

Autodesk.Aec.DatabaseServices.EntityBodyModifier.ComponentId
Gets or sets the component id.
Returns: The component id.

Autodesk.Aec.DatabaseServices.EntityBodyModifier.OperationType
Gets or sets the body modifier operation type.
Returns: The body modifier operation type.

Autodesk.Aec.DatabaseServices.EntityBodyModifier.TransformBy(Autodesk.AutoCAD.Geometry.Matrix3d)
Transforms the body modifier by the input matrix.
matrix: Input the matrix.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.