Autodesk.Aec.DatabaseServices.NodeLocationType
Node location types.

Autodesk.Aec.DatabaseServices.NodeLocationType.Start
Node at start.

Autodesk.Aec.DatabaseServices.NodeLocationType.End
Node at end.

Autodesk.Aec.DatabaseServices.NodeLocationType.Intersection
Node at intersection.