Autodesk.Aec.DatabaseServices.NestedGridDefinition
Represents a nested grid definition.

Autodesk.Aec.DatabaseServices.NestedGridDefinition.#ctor
Initializes a new instance of the NestedGridDefinition class.

Autodesk.Aec.DatabaseServices.NestedGridDefinition.GridDivisionId
Gets or sets the grid division id.
Throws Autodesk.AutoCAD.Runtime.Exception: Autodesk.AutoCAD.Runtime.Exception.