Autodesk.Aec.DatabaseServices.DictionaryClassificationDefinition
Represents a classification dictionary.

Autodesk.Aec.DatabaseServices.DictionaryClassificationDefinition.#ctor(Autodesk.AutoCAD.DatabaseServices.Database)
Initializes a new instance of the DictionaryClassificationDefinition class using the specified database.
db: The drawing database.