Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection
Represents a compound curve 2d vertex collection.

Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection.#ctor
Initializes a new instance of the CompoundCurve2dVertexCollection class.

Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection.DeleteUnmanagedObject()
Disposes the unmanaged object.

Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection.CopyTo
Copies the collection to an array.
array: The array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection.Item(System.Int32)
Gets or sets the CompoundCurve2dVertex at the given index.
index: The index.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Method currently unavailable. Will throw an InvalidOperationException() if used.

Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection.Count
Returns the number of elements in the collection.

Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection.GetEnumerator
Gets the enumerator for the collection.

Autodesk.Aec.Geometry.CompoundCurve2dVertexCollection.CopyTo(Autodesk.Aec.Geometry.CompoundCurve2dVertex[],System.Int32)
Copies the collection to an array.
array: The CompoundCurve2dVertex array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.