Autodesk.Aec.DatabaseServices.LineWorkType
Section2d linework type enumeration.

Autodesk.Aec.DatabaseServices.LineWorkType.LineWork
Line work.

Autodesk.Aec.DatabaseServices.LineWorkType.SurfaceHatching
Surface hatching.

Autodesk.Aec.DatabaseServices.LineWorkType.SectionHatching
Section hatching.