Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode
Represents a node of the GsMarker information related to the display component.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode.#ctor
Initializes a new instance of the GsMarkerDisplayComponentInformationNode class.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode.#ctor(System.String,Autodesk.Aec.DatabaseServices.GsMarkerInformationTree,Autodesk.Aec.DatabaseServices.GsMarkerInformationNode)
Initializes a new instance of the GsMarkerDisplayComponentInformationNode class using the specified name, parent tree and parent node.
name: The specified name.
parentTree: The specified parent tree.
parentNode: The specified parent node.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode.DisplayComponentName
Gets or sets the display component name.
Returns: The display component name.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode.ParentDisplayRepresentationInformationNode
Gets or sets the parent node of the display component information.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode.DisplayPropertiesId
Gets the object id of the display properties.
Returns: The object id of the display properties.

Autodesk.Aec.DatabaseServices.GsMarkerDisplayComponentInformationNode.DisplayRepresentationId
Gets the object id of the display representation.
Returns: The object id of the display representation.