Autodesk.Aec.Geometry.ProfileResult
ProfileResult enumeration.

Autodesk.Aec.Geometry.ProfileResult.PointInProfile
The point is inside the profile.

Autodesk.Aec.Geometry.ProfileResult.PointOutsideProfile
The point is outside the profile.

Autodesk.Aec.Geometry.ProfileResult.PointOnRing
The point is on a ring.

Autodesk.Aec.Geometry.ProfileResult.PointOnVoidRing
The point is on a void ring.

Autodesk.Aec.Geometry.ProfileResult.PointInRing
The point is in the ring.

Autodesk.Aec.Geometry.ProfileResult.PointOutsideRing
The point is outside the ring.

Autodesk.Aec.Geometry.ProfileResult.RingInsideProfile
The ring is inside the profile.

Autodesk.Aec.Geometry.ProfileResult.RingCoincidesWithRing
The ring coincides with another ring.

Autodesk.Aec.Geometry.ProfileResult.RingCoincidesWithVoidRing
The ring coincides with a void ring.

Autodesk.Aec.Geometry.ProfileResult.RingOutsideProfile
The ring is outside the profile.