Autodesk.Aec.Geometry.Segment2dCollection
Represents a segment 2d collection.

Autodesk.Aec.Geometry.Segment2dCollection.DeleteUnmanagedObject()
Disposes the unmanaged object.

Autodesk.Aec.Geometry.Segment2dCollection.CopyTo
Copies the collection to an array.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.

Autodesk.Aec.Geometry.Segment2dCollection.Item(System.Int32)
Gets or sets the Segment2d at the given index.
index: The index.
Throws System.InvalidOperationException: System.InvalidOperationException.
Remarks: Method currently unavailable. Will throw an InvalidOperationException() if used.

Autodesk.Aec.Geometry.Segment2dCollection.Count
Returns the number of elements in the collection.

Autodesk.Aec.Geometry.Segment2dCollection.GetEnumerator
Gets the enumerator for the collection.

Autodesk.Aec.Geometry.Segment2dCollection.CopyTo(Autodesk.Aec.Geometry.Segment2d[],System.Int32)
Copies the collection to an array.
array: The Segment2d array.
start: The start index to begin copying.
Throws System.ArgumentNullException: System.ArgumentNullException.
Throws System.ArgumentOutOfRangeException: System.ArgumentOutOfRangeException.
Throws System.ArgumentException: System.ArgumentException.