Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly
Represents an entity to a grid assembly anchor.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.#ctor
Initializes a new instance of the AnchorEntityToGridAssembly class.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.GridAssemblyId
Gets or sets the Id of the grid assembly.
Returns: Returns the Id of the grid assembly.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.GridAssemblyCellId
Gets or sets the Id of the grid assembly cell.
Returns: The Id of the grid assembly cell.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.GetOrientation(System.Boolean@,System.Boolean@,System.Boolean@)
Gets the orientation of the anchor.
flipX: The flip in X value.
flipY: The flip in Y value.
flipZ: The flip in Z value.
Returns: Returns the orientation of the anchor.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.SetOrientation(System.Boolean,System.Boolean,System.Boolean)
Sets the orientation of the anchor.
flipX: The flip in X value.
flipY: The flip in Y value.
flipZ: The flip in Z value.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.HasSizingOffsets
Gets or sets the value that determines if the anchor has sizing offsets.
Returns: Returns the value that determines if the anchor has sizing offsets.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.BottomOffset
Gets or sets the bottom offset.
Returns: Returns the bottom offset.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.TopOffset
Gets or sets the top offset.
Returns: Returns the top offset.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.LeftOffset
Gets or sets the left offset.
Returns: Returns the left offset.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.RightOffset
Gets or sets the right offset.
Returns: Returns the right offset.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.AllowVariesFromInfillDefinition
Gets or sets the value that determines if the anchor is allowed to vary from the infill definition.
Returns: Returns the value that determines if the anchor is allowed to vary from the infill definition.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.YOffset
Gets or sets the Y offset.
Returns: Returns the Y offset.

Autodesk.Aec.DatabaseServices.AnchorEntityToGridAssembly.YAlignment
Gets or sets the Y alignment.
Returns: Returns the Y alignment.